[{"plot": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red.", "genres": ["Crime", "Drama"], "title": "The Shawshank Redemption trailer", "url": "https://www.youtube.com/embed/NmzuHjWmXOc", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRTzrWQdl1WQML-v4sLaTmqCtWAv9ql8xx6kQdqpH2tDqamkN2TM_bQzwQR", "year": 1994, "id": "0111161"}, {"plot": "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba.", "genres": ["Crime", "Drama"], "title": "The Godfather: Part II trailer", "url": "https://www.youtube.com/embed/qJr92K_hKl0", "pic": "", "year": 1974, "id": "0071562"}, {"plot": "Set within a year after the events of Batman Begins, Batman, Lieutenant James Gordon, and new district attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City until a mysterious and sadistic criminal mastermind known only as the Joker appears in Gotham, creating a new wave of chaos. Batman's struggle against the Joker becomes deeply personal, forcing him to \"confront everything he believes\" and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent and Rachel Dawes.", "genres": ["Action", "Crime", "Drama", "Thriller"], "title": "The Dark Knight trailer", "url": "https://www.youtube.com/embed/EXeTwQWrcwY", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTt4tmtlx9gndfS3KsIXNf1G1zSzy7zaU152qkEoRUeTfTcwzUBNfg-pA", "year": 2008, "id": "0468569"}, {"plot": "Oskar Schindler is a vainglorious and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us.", "genres": ["Biography", "Drama", "History"], "title": "Schindler's List trailer", "url": "https://www.youtube.com/embed/M5FpB6qDGAE", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRRm6M6zj35c8zAbbW1IMXUGWTFWoonRLN2tsXdU_YVpR_ngHXcUvNILdCP", "year": 1993, "id": "0108052"}, {"plot": "The final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Hobbits Frodo and Sam reach Mordor in their quest to destroy the \"one ring\", while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith.", "genres": ["Adventure", "Drama", "Fantasy"], "title": "The Lord of the Rings: The Return of the King trailer", "url": "https://www.youtube.com/embed/y2rYRu8UW8M", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSLeppx7uhokRsmuTgdZCyeqJJ_UMo14FFUON48aWzCG2Hg9X8A8WXvc68", "year": 2003, "id": "0167260"}, {"plot": "A nameless first person narrator (Edward Norton) attends support groups in attempt to subdue his emotional state and relieve his insomniac state. When he meets Marla (Helena Bonham Carter), another fake attendee of support groups, his life seems to become a little more bearable. However when he associates himself with Tyler (Brad Pitt) he is dragged into an underground fight club and soap making scheme. Together the two men spiral out of control and engage in competitive rivalry for love and power. When the narrator is exposed to the hidden agenda of Tyler's fight club, he must accept the awful truth that Tyler may not be who he says he is.", "genres": ["Drama"], "title": "Fight Club trailer", "url": "https://www.youtube.com/embed/_XgQA9Ab0Gw", "pic": "", "year": 1999, "id": "0137523"}, {"plot": "Luke Skywalker, Han Solo, Princess Leia and Chewbacca face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi master's help will Luke survive when the dark side of the Force beckons him into the ultimate duel with Darth Vader.", "genres": ["Action", "Adventure", "Fantasy", "Sci-Fi"], "title": "Star Wars: Episode V - The Empire Strikes Back trailer", "url": "", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcS6xZsd1WUe8nsuKJLlFgnEZFPuyr9jN-WzIkNzAGWDg6UgnQSePLhex_c", "year": 1980, "id": "0080684"}, {"plot": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible - inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "title": "Inception trailer", "url": "https://www.youtube.com/embed/YoHD9XEInc0", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcS5qRPL_OU_OBI1neZdaAWkCYNn7itxoDCIClj99W2f9D-Uh2om0m1Ppqk", "year": 2010, "id": "1375666"}, {"plot": "While Frodo and Sam, now accompanied by a new guide, continue their hopeless journey towards the land of shadow to destroy the One Ring, each member of the broken fellowship plays their part in the battle against the evil wizard Saruman and his armies of Isengard.", "genres": ["Adventure", "Drama", "Fantasy"], "title": "The Lord of the Rings: The Two Towers trailer", "url": "https://www.youtube.com/embed/2dlRvAjU_RI", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSyvcaLsIGQ4RvKg-pZgP_i_IP2LM-ezxMbhtWRkBVPgkVo1uwKx1wLX12E", "year": 2002, "id": "0167261"}, {"plot": "Henry Hill might be a small time gangster, who may have taken part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who might have set their sights a bit higher. His two partners could kill off everyone else involved in the robbery, and slowly start to think about climbing up through the hierarchy of the Mob. Henry, however, might be badly affected by his partners' success, but will he consider stooping low enough to bring about the downfall of Jimmy and Tommy?", "genres": ["Biography", "Crime", "Drama"], "title": "Goodfellas trailer", "url": "https://www.youtube.com/embed/qo5jJpHtI1Y", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcS_ffvp80rZ3sGocIh5Xz0EqkWu_XFvFHYxrB64OrU1BvOYeZ78pCiFISqe", "year": 1990, "id": "0099685"}, {"plot": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellion.", "genres": ["Action", "Sci-Fi"], "title": "The Matrix trailer", "url": "https://www.youtube.com/embed/vKQi3bBA1y8", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSkYsy3GO-XsGVgf4GpYPoz1JfHgPXBK7O6DheUOmHsvhOei16K2-ZV-2U", "year": 1999, "id": "0133093"}, {"plot": "The Imperial Forces, under orders from cruel Darth Vader, hold Princess Leia hostage in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker and Han Solo, captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 and C-3PO to rescue the beautiful princess, help the Rebel Alliance and restore freedom and justice to the Galaxy.", "genres": ["Action", "Adventure", "Fantasy", "Sci-Fi"], "title": "Star Wars: Episode IV - A New Hope trailer", "url": "https://www.youtube.com/embed/9gvqpFbRKtQ", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQYvzE8dydgX4hHTn9Q4x5VEw_0MIe9JZuniHM_EKxxDMyrYtpMsbtSlWU", "year": 1977, "id": "0076759"}, {"plot": "Brazil, 1960s, City of God. The Tender Trio robs motels and gas trucks. Younger kids watch and learn well...too well. 1970s: Li'l Zé has prospered very well and owns the city. He causes violence and fear as he wipes out rival gangs without mercy. His best friend Bené is the only one to keep him on the good side of sanity. Rocket has watched these two gain power for years, and he wants no part of it. Yet he keeps getting swept up in the madness. All he wants to do is take pictures. 1980s: Things are out of control between the last two remaining gangs...will it ever end? Welcome to the City of God.", "genres": ["Crime", "Drama"], "title": "City of God trailer", "url": "https://www.youtube.com/embed/dcUOO4Itgmw", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQM_g4Kxy1sVa5mcvjQl8yc5uBV60UfafIhCkeXSt85UuHHHbzlxeruFHQV", "year": 2002, "id": "0317248"}, {"plot": "FBI trainee Clarice Starling works hard to advance her career, including trying to hide or put behind her West Virginia roots, of which if some knew would automatically classify her as being backward or white trash. After graduation, she aspires to work in the agency's Behavioral Science Unit under the leadership of Jack Crawford. While she is still a trainee, Crawford does ask her to question Dr. Hannibal Lecter, a psychiatrist imprisoned thus far for eight years in maximum security isolation for being a serial killer, he who cannibalized his victims. Clarice is able to figure out the assignment is to pick Lecter's brains to help them solve another serial murder case, that of someone coined by the media as Buffalo Bill who has so far killed five victims, all located in the eastern US, all young women who are slightly overweight especially around the hips, all who were drowned in natural bodies of water, and all who were stripped of large swaths of skin. She also figures that Crawford chose her as a woman to be able to trigger some emotional response from Lecter. After speaking to Lecter for the first time, she realizes that everything with him will be a psychological game with her having often to read between the very cryptic lines he provides. She has to decide how much she will play along as his request in return for talking to him is to expose herself emotionally to him. The case takes more dire turns when a sixth victim is discovered, this one from who they are able to retrieve a key piece of evidence if Lecter is being forthright as to its meaning. A potential seventh victim is high profile Catherine Martin, the daughter of Senator Ruth Martin, which places greater scrutiny on the case as they search for a hopefully still alive Catherine. Who may factor into what happens is Dr. Frederick Chilton, the warden at the prison, he an opportunist who sees the higher profile with Catherine, meaning a higher profile for himself if he can insert himself successfully into the proceedings.", "genres": ["Crime", "Drama", "Thriller"], "title": "The Silence of the Lambs trailer", "url": "https://www.youtube.com/embed/lQKs169Sl0I", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcR5-h9ehdrgv8QVzSv8S6up_qrlPikrn8GevySblwvwTpZFpHccRL7v4PY", "year": 1991, "id": "0102926"}, {"plot": "Following a truck hijack in New York, five conmen are arrested and brought together for questioning. As none of them are guilty, they plan a revenge operation against the police. The operation goes well, but then the influence of a legendary mastermind criminal called Keyser Söze is felt. It becomes clear that each one of them has wronged Söze at some point and must pay back now. The payback job leaves 27 men dead in a boat explosion, but the real question arises now: Who actually is Keyser Söze?", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "The Usual Suspects trailer", "url": "https://www.youtube.com/embed/D4NMO5b1_Ew", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQ5hRvb-AIQz8rU0PfTKo0boOqVu1UgOcdsIOG1j6b5C-tINyCVWeJj2U90", "year": 1995, "id": "0114814"}, {"plot": "After her father, mother, older sister and little brother are killed by her father's employers, the 12-year-old daughter of an abject drug dealer is forced to take refuge in the apartment of a professional hitman who at her request teaches her the methods of his job so she can take her revenge on the corrupt DEA agent who ruined her life by killing her beloved brother.", "genres": ["Crime", "Drama", "Thriller"], "title": "Léon: The Professional trailer", "url": "https://www.youtube.com/embed/ns4vh_xAn98", "pic": "", "year": 1994, "id": "0110413"}, {"plot": "Opening with the Allied invasion of Normandy on 6 June 1944, members of the 2nd Ranger Battalion under Cpt. Miller fight ashore to secure a beachhead. Amidst the fighting, two brothers are killed in action. Earlier in New Guinea, a third brother is KIA. Their mother, Mrs. Ryan, is to receive all three of the grave telegrams on the same day. The United States Army Chief of Staff, George C. Marshall, is given an opportunity to alleviate some of her grief when he learns of a fourth brother, Private James Ryan, and decides to send out 8 men (Cpt. Miller and select members from 2nd Rangers) to find him and bring him back home to his mother...", "genres": ["Drama", "War"], "title": "Saving Private Ryan trailer", "url": "https://www.youtube.com/embed/zwhP5b4tD6g", "pic": "", "year": 1998, "id": "0120815"}, {"plot": "Derek Vineyard is paroled after serving 3 years in prison for brutally killing two black men who tried to break into/steal his truck. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.", "genres": ["Crime", "Drama"], "title": "American History X trailer", "url": "https://www.youtube.com/embed/JsPW6Fj3BUI", "pic": "", "year": 1998, "id": "0120586"}, {"plot": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life.", "genres": ["Adventure", "Drama", "Sci-Fi"], "title": "Interstellar trailer", "url": "https://www.youtube.com/embed/3WzHXI5HizQ", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRPzoHcVHsmz8RtoZrQJ8tAEKp5zLzZslw89YA7HamJ9rybjqdkKUtA5Jg", "year": 2014, "id": "0816692"}, {"plot": "A tramp falls in love with a beautiful blind girl. Her family is in financial trouble. The tramp's on-and-off friendship with a wealthy man allows him to be the girl's benefactor and suitor.", "genres": ["Comedy", "Drama", "Romance"], "title": "City Lights trailer", "url": "https://www.youtube.com/embed/X_W1tOngo-w", "pic": "", "year": 1931, "id": "0021749"}, {"plot": "Death Row guards at a penitentiary, in the 1930's, have a moral dilemma with their job when they discover one of their prisoners, a convicted murderer, has a special gift.", "genres": ["Crime", "Drama", "Fantasy", "Mystery"], "title": "The Green Mile trailer", "url": "https://www.youtube.com/embed/Ki4haFrqSrw", "pic": "", "year": 1999, "id": "0120689"}, {"plot": "In Paris, the aristocratic and intellectual Philippe is a quadriplegic millionaire who is interviewing candidates for the position of his carer, with his red-haired secretary Magalie. Out of the blue, the rude African Driss cuts the line of candidates and brings a document from the Social Security and asks Phillipe to sign it to prove that he is seeking a job position so he can receive his unemployment benefit. Philippe challenges Driss, offering him a trial period of one month to gain experience helping him. Then Driss can decide whether he would like to stay with him or not. Driss accepts the challenge and moves to the mansion, changing the boring life of Phillipe and his employees.", "genres": ["Biography", "Comedy", "Drama"], "title": "The Intouchables trailer", "url": "https://www.youtube.com/embed/0V8ZJ_8qARs", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcT16u0NivBB-pj3Mkichwma3Kt-P7KiNQDf4aeaD9aFHA_J-hDvyqSaq78", "year": 2011, "id": "1675434"}, {"plot": "The year is 1936. An archeology professor named Indiana Jones is venturing in the jungles of South America searching for a golden statue. Unfortunately, he sets off a deadly trap but miraculously escapes. Then, Jones hears from a museum curator named Marcus Brody about a biblical artifact called The Ark of the Covenant, which can hold the key to humanly existence. Jones has to venture to vast places such as Nepal and Egypt to find this artifact. However, he will have to fight his enemy Rene Belloq and a band of Nazis in order to reach it.", "genres": ["Action", "Adventure"], "title": "Raiders of the Lost Ark trailer", "url": "https://www.youtube.com/embed/XkkzKHCx154", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRUQkmZAZHLFBzf1WDG9FpKoKaLiVr7IvPJyUXxeAYWwFeKV5TuRb8l3oQ", "year": 1981, "id": "0082971"}, {"plot": "In this adaptation of the autobiography \"The Pianist: The Extraordinary True Story of One Man's Survival in Warsaw, 1939-1945,\" Wladyslaw Szpilman, a Polish Jewish radio station pianist, sees Warsaw change gradually as World War II begins. Szpilman is forced into the Warsaw Ghetto, but is later separated from his family during Operation Reinhard. From this time until the concentration camp prisoners are released, Szpilman hides in various locations among the ruins of Warsaw.", "genres": ["Biography", "Drama", "War"], "title": "The Pianist trailer", "url": "https://www.youtube.com/embed/itR0-I9idXk", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcS9S0riKjvQvo0mBBhTAyjZ9z2L_v3KCZD0CNSV3RHnbbT0zYRfTKm3eGI", "year": 2002, "id": "0253474"}, {"plot": "In South Boston, the state police force is waging war on Irish-American organized crime. Young undercover cop Billy Costigan is assigned to infiltrate the mob syndicate run by gangland chief Frank Costello. While Billy quickly gains Costello's confidence, Colin Sullivan, a hardened young criminal who has infiltrated the state police as an informer for the syndicate is rising to a position of power in the Special Investigation Unit. Each man becomes deeply consumed by their double lives, gathering information about the plans and counter-plans of the operations they have penetrated. But when it becomes clear to both the mob and the police that there is a mole in their midst, Billy and Colin are suddenly in danger of being caught and exposed to the enemy - and each must race to uncover the identity of the other man in time to save themselves. But is either willing to turn on their friends and comrades they've made during their long stints undercover?", "genres": ["Crime", "Drama", "Thriller"], "title": "The Departed trailer", "url": "https://www.youtube.com/embed/iQpb1LoeVUc", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRXNkD6jqQsaz4zeHqR_jgJR-OC5wvmEPhlA4_i_jVOWphfa3ChEd0Ruw", "year": 2006, "id": "0407887"}, {"plot": "Over 10 years have passed since the first cyborg called The Terminator tried to kill Sarah Connor and her unborn son, John Connor. John Connor, the future leader of the human resistance, is now a healthy young boy. However another Terminator is sent back through time called the T-1000, which is more advanced and more powerful than its predecessor. The Mission: to kill John Connor when he's still a child. However, Sarah and John do not have to face this threat of a Terminator alone. Another Terminator is also sent back through time. The mission: to protect John and Sarah Connor at all costs. The battle for tomorrow has begun...", "genres": ["Action", "Sci-Fi", "Thriller"], "title": "Terminator 2: Judgment Day trailer", "url": "https://www.youtube.com/embed/7QXDPzx71jQ", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQgcTdabRLmA95-Q4u3z2j2_1jUiSYc6OLBy8AzlzICilqLDd6f0sNCQ-U", "year": 1991, "id": "0103064"}, {"plot": "Marty McFly, a typical American teenager of the Eighties, is accidentally sent back to 1955 in a plutonium-powered DeLorean \"time machine\" invented by a slightly mad scientist. During his often hysterical, always amazing trip back in time, Marty must make certain his teenage parents-to-be meet and fall in love - so he can get back to the future.", "genres": ["Adventure", "Comedy", "Sci-Fi"], "title": "Back to the Future trailer", "url": "https://www.youtube.com/embed/2SrV13F3x7Y", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRW9PPy2YjXLdy3wFGvmMI-B4PsYEv0ghE1Ig4kKFPgPmgwr_IOkm-abMo", "year": 1985, "id": "0088763"}, {"plot": "A young and talented drummer attending a prestigious music academy finds himself under the wing of the most respected professor at the school, one who does not hold back on abuse towards his students. The two form an odd relationship as the student wants to achieve greatness, and the professor pushes him.", "genres": ["Drama", "Music"], "title": "Whiplash trailer", "url": "https://www.youtube.com/embed/iTgk3WbTErk", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTxNqBPjv7yIcQ1mstqbL4EZvJMfplqSrPxIh0ypIWZSfa2X9fkfFhAaA", "year": 2014, "id": "2582802"}, {"plot": "Memento chronicles two separate stories of Leonard, an ex-insurance investigator who can no longer build new memories, as he attempts to find the murderer of his wife, which is the last thing he remembers. One story line moves forward in time while the other tells the story backwards revealing more each time.", "genres": ["Mystery", "Thriller"], "title": "Memento trailer", "url": "https://www.youtube.com/embed/ploSYVE0uao", "pic": "", "year": 2000, "id": "0209144"}, {"plot": "In 2029 the mutant population has shrunk significantly and the X-Men have disbanded. Logan, whose power to self-heal is dwindling, has surrendered himself to alcohol and now earns a living as a chauffeur. He takes care of the ailing old Professor X whom he keeps hidden away. One day, a female stranger asks Logan to drive a girl named Laura to the Canadian border. At first he refuses, but the Professor has been waiting for a long time for her to appear. Laura possesses an extraordinary fighting prowess and is in many ways like Wolverine. She is pursued by sinister figures working for a powerful corporation; this is because her DNA contains the secret that connects her to Logan. A relentless pursuit begins - In this third cinematic outing featuring the Marvel comic book character Wolverine we see the superheroes beset by everyday problems. They are ageing, ailing and struggling to survive financially. A decrepit Logan is forced to ask himself if he can or even wants to put his remaining powers to good use. It would appear that in the near-future, the times in which they were able put the world to rights with razor sharp claws and telepathic powers are now over.", "genres": ["Action", "Drama", "Sci-Fi", "Thriller"], "title": "Logan trailer", "url": "https://www.youtube.com/embed/rwbA7VQo1nw", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQ7JkUU5Jo5XPDTpz3Py_0uUnazkaM-6d5V5LwcTH2OuC42WuReT9BkrTw", "year": 2017, "id": "3315342"}, {"plot": "In the end of the Nineteenth Century, in London, Robert Angier, his beloved wife Julia McCullough and Alfred Borden are friends and assistants of a magician. When Julia accidentally dies during a performance, Robert blames Alfred for her death and they become enemies. Both become famous and rival magicians, sabotaging the performance of the other on the stage. When Alfred performs a successful trick, Robert becomes obsessed trying to disclose the secret of his competitor with tragic consequences.", "genres": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "title": "The Prestige trailer", "url": "https://www.youtube.com/embed/o4gHCmTQDVI", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSgkz6ymILIY1mYA90PZgump3Hl5xVJQ84KDoDpXm7Jx5FaOfA3BVVdXg", "year": 2006, "id": "0482571"}, {"plot": "A commercial crew aboard the deep space towing vessel, Nostromo is on its way home when they pick up an SOS warning from a distant moon. What they don't know is that the SOS warning is not like any other ordinary warning call. Picking up the signal, the crew realize that they are not alone on the spaceship when an alien stowaway is on the cargo ship.", "genres": ["Horror", "Sci-Fi"], "title": "Alien trailer", "url": "https://www.youtube.com/embed/LjLamj-b0I8", "pic": "", "year": 1979, "id": "0078748"}, {"plot": "In Hollywood of the 50's, the obscure screenplay writer Joe Gillis is not able to sell his work to the studios, is full of debts and is thinking in returning to his hometown to work in an office. While trying to escape from his creditors, he has a flat tire and parks his car in a decadent mansion in Sunset Boulevard. He meets the owner and former silent-movie star Norma Desmond, who lives alone wit her butler and driver Max von Mayerling. Norma is demented and believes she will return to the cinema industry, and is protected and isolated from the world by Max, who was his director and husband in the past and still loves her. Norma proposes Joe to move to the mansion and help her in writing a screenplay for her comeback to the cinema, and the small-time writer becomes her lover and gigolo. When Joe falls in love for the young aspirant writer Betty Schaefer, Norma becomes jealous and completely insane and her madness leads to a tragic end.", "genres": ["Drama", "Film-Noir"], "title": "Sunset Boulevard trailer", "url": "https://www.youtube.com/embed/Ine1eH8fKZc", "pic": "", "year": 1950, "id": "0043014"}, {"plot": "A famous film director remembers his childhood at the Cinema Paradiso where Alfredo, the projectionist, first brought about his love of films. He returns home to his Sicilian village for the first time after almost 30 years and is reminded of his first love, Elena, who disappeared from his life before he left for Rome.", "genres": ["Drama"], "title": "Cinema Paradiso trailer", "url": "https://www.youtube.com/embed/C2-GX0Tltgw", "pic": "", "year": 1988, "id": "0095765"}, {"plot": "Gerd Wiesler is an officer with the Stasi, the East German secret police. The film begins in 1984 when Wiesler attends a play written by Georg Dreyman, who is considered by many to be the ultimate example of the loyal citizen. Wiesler has a gut feeling that Dreyman can't be as ideal as he seems and believes surveillance is called for. The Minister of Culture agrees but only later does Wiesler learn that the Minister sees Dreyman as a rival and lusts after his partner Christa-Maria. The more time he spends listening in on them, the more he comes to care about them. The once rigid Stasi officer begins to intervene in their lives, in a positive way, protecting them whenever possible. Eventually, Wiesler activities catch up to him and while there is no proof of wrongdoing, he finds himself in menial jobs - until the unbelievable happens.", "genres": ["Drama", "Thriller"], "title": "The Lives of Others trailer", "url": "https://www.youtube.com/embed/n3_iLOp6IhM", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSHB_TyG1lbfSm3hf8kq1vnpNyox2CLs_AMuLay3yevQaqdgHK9UtkKKIU", "year": 2006, "id": "0405094"}, {"plot": "The futility and irony of the war in the trenches in WWI is shown as a unit commander in the French army must deal with the mutiny of his men and a glory-seeking general after part of his force falls back under fire in an impossible attack.", "genres": ["Drama", "War"], "title": "Paths of Glory trailer", "url": "https://www.youtube.com/embed/nmDA60X-f_A", "pic": "", "year": 1957, "id": "0050825"}, {"plot": "A German dentist buys the freedom of a slave and trains him with the intent to make him his deputy bounty hunter. Instead, he is led to the site of the slave's wife who belongs to a ruthless plantation owner.", "genres": ["Drama", "Western"], "title": "Django Unchained trailer", "url": "https://www.youtube.com/embed/eUdM9vrCbow", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSuUVGLmpPCCa7L3dVAeghdYE4QMUjAiEpPN907_nIBwrlip3NYQ6CVTKU", "year": 2012, "id": "1853728"}, {"plot": "In a distant, but not so unrealistic, future where mankind has abandoned earth because it has become covered with trash from products sold by the powerful multi-national Buy N Large corporation, WALL-E, a garbage collecting robot has been left to clean up the mess. Mesmerized with trinkets of Earth's history and show tunes, WALL-E is alone on Earth except for a sprightly pet cockroach. One day, EVE, a sleek (and dangerous) reconnaissance robot, is sent to Earth to find proof that life is once again sustainable. WALL-E falls in love with EVE. WALL-E rescues EVE from a dust storm and shows her a living plant he found amongst the rubble. Consistent with her \"directive\", EVE takes the plant and automatically enters a deactivated state except for a blinking green beacon. WALL-E, doesn't understand what has happened to his new friend, but, true to his love, he protects her from wind, rain, and lightning, even as she is unresponsive. One day a massive ship comes to reclaim EVE, but WALL-E, out of love or loneliness, hitches a ride on the outside of the ship to rescue EVE. The ship arrives back at a large space cruise ship, which is carrying all of the humans who evacuated Earth 700 years earlier. The people of Earth ride around this space resort on hovering chairs which give them a constant feed of TV and video chatting. They drink all of their meals through a straw out of laziness and/or bone loss, and are all so fat that they can barely move. When the auto-pilot computer, acting on hastily-given instructions sent many centuries before, tries to prevent the people of Earth from returning by stealing the plant, WALL-E, EVE, the portly captain, and a band of broken robots stage a mutiny.", "genres": ["Animation", "Adventure", "Family", "Sci-Fi"], "title": "WALL·E trailer", "url": "https://www.youtube.com/embed/alIq_wG9FNk", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTi3sgUNozbJqOZHzBDTu2wLwo-QQKgR1o7caEdoOcDLrE-BWqIMg0hq_8", "year": 2008, "id": "0910970"}, {"plot": "Despite his tarnished reputation after the events of The Dark Knight, in which he took the rap for Dent's crimes, Batman feels compelled to intervene to assist the city and its police force which is struggling to cope with Bane's plans to destroy the city.", "genres": ["Action", "Thriller"], "title": "The Dark Knight Rises trailer", "url": "https://www.youtube.com/embed/M-mf5IyVIAc", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSP3__1lmfMgCtIiaTbrkBO6b9y90JGMiidjwpfar4mJJt_2w3b2W9yC_0a", "year": 2012, "id": "1345836"}, {"plot": "Fifty seven years after Ellen Ripley survived her disastrous ordeal, her escape vessel is recovered after drifting across the galaxy as she slept in cryogenic stasis. Back on Earth, nobody believed her story about the \"Aliens\" on the moon LV-426. After the \"Company\" orders the colony on LV-426 to investigate, however, all communication with the colony is lost. The Company enlists Ripley to aid a team of tough, rugged space marines on a rescue mission to the now partially terraformed moon to find out if there are aliens or survivors. As the mission unfolds, Ripley will be forced to come to grips with her worst nightmare, but even as she does, she finds that the worst is yet to come.", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "title": "Aliens trailer", "url": "https://www.youtube.com/embed/AW-7_HE98PY", "pic": "", "year": 1986, "id": "0090605"}, {"plot": "An average man is kidnapped and imprisoned in a shabby cell for 15 years without explanation. He then is released, equipped with money, a cellphone and expensive clothes. As he strives to explain his imprisonment and get his revenge, Oh Dae-Su soon finds out that his kidnapper has a greater plan for him and is set onto a path of pain and suffering in an attempt to uncover the motive of his mysterious tormentor.", "genres": ["Drama", "Mystery", "Thriller"], "title": "Oldboy trailer", "url": "https://www.youtube.com/embed/2HkjrJ6IK5E", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRRIt6dRK3hWOdenaBWZcoc4-YvtQ7ZeD7RLE7x8Sb4ZxhwPW8957qTWQ", "year": 2003, "id": "0364569"}, {"plot": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.", "genres": ["Comedy", "Drama", "Music", "Musical", "Romance"], "title": "La La Land (I) trailer", "url": "https://www.youtube.com/embed/0pdqf4P9MB8", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQuG_tqe_Oh6mv_M3nz3MI_MinvGyvY2uEZXV3k9FxLdzT1ejmWeAb1Ma-b", "year": 2016, "id": "3783958"}, {"plot": "It's Britain, 1953. Upon his return to work following a heart attack, irrepressible barrister Sir Wilfrid Robarts, known as a barrister for the hopeless, takes on a murder case, much to the exasperation of his medical team, led by his overly regulated private nurse, Miss Plimsoll, who tries her hardest to ensure that he not return to his hard living ways - including excessive cigar smoking and drinking - while he takes his medication and gets his much needed rest. That case is defending American war veteran Leonard Vole, a poor, out of work, struggling inventor who is accused of murdering his fifty-six year old lonely and wealthy widowed acquaintance, Emily French. The initial evidence is circumstantial but points to Leonard as the murderer. Despite being happily married to East German former beer hall performer Christine Vole, he fostered that friendship with Mrs. French in the hopes that she would finance one of his many inventions to the tune of a few hundred pounds. It thus does not help his case when it is learned that Mrs. French changed her will prior to her murder with Leonard being the primary beneficiary of a £80,000 estate. Leonard states that he knew nothing about the will. Christine is apparently the only alibi Leonard has to his whereabouts at the time of the murder. The usual methods Sir Wilfrid uses to test his clients' guilt or innocence leads to him believing that Leonard is indeed innocent. As the trial progresses, the prosecution calls a surprise witness, one that could place a nail in the coffin of Sir Wilfrid's planned line of defense. As Sir Wilfrid gets deeper and deeper into the case, something doesn't quite sit right with him, although he doesn't know what it is. The primary questions become how far Sir Wilfrid will go to obtain evidence to acquit Leonard, and if he will ever discover why he feels that there is something odd about the case.", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Witness for the Prosecution trailer", "url": "https://www.youtube.com/embed/KsVN1hv9D5c", "pic": "", "year": 1957, "id": "0051201"}, {"plot": "A group of reporters are trying to decipher the last word ever spoken by Charles Foster Kane, the millionaire newspaper tycoon: \"Rosebud.\" The film begins with a news reel detailing Kane's life for the masses, and then from there, we are shown flashbacks from Kane's life. As the reporters investigate further, the viewers see a display of a fascinating man's rise to fame, and how he eventually fell off the top of the world.", "genres": ["Drama", "Mystery"], "title": "Citizen Kane trailer", "url": "https://www.youtube.com/embed/YXIr1P9Fm5A", "pic": "", "year": 1941, "id": "0033467"}, {"plot": "John \"Scottie\" Ferguson is a retired San Francisco police detective who suffers from acrophobia and Madeleine is the lady who leads him to high places. A wealthy shipbuilder who is an acquaintance from college days approaches Scottie and asks him to follow his beautiful wife, Madeleine. He fears she is going insane, maybe even contemplating suicide, he believes she is possessed by a dead ancestor. Scottie is skeptical, but agrees after he sees the beautiful Madeleine.", "genres": ["Mystery", "Romance", "Thriller"], "title": "Vertigo trailer", "url": "https://www.youtube.com/embed/c2u96ONO5K0", "pic": "", "year": 1958, "id": "0052357"}, {"plot": "Six criminals, who are strangers to each other, are hired by a crime boss, Joe Cabot, to carry out a diamond robbery. Right at the outset, they are given false names with the intention that they won't get too close and will concentrate on the job instead. They are completely sure that the robbery is going to be a success. But, when the police show up right at the time and the site of the robbery, panic spreads amongst the group members, and two of them are killed in the subsequent shootout, along with a few policemen and civilians. When the remaining people assemble at the premeditated rendezvous point (a warehouse), they begin to suspect that one of them is an undercover cop.", "genres": ["Crime", "Drama", "Thriller"], "title": "Reservoir Dogs trailer", "url": "https://www.youtube.com/embed/vayksn4Y93A", "pic": "", "year": 1992, "id": "0105236"}, {"plot": "In Germany, Hans Beckert is an unknown killer of girls. He whistles Edvard Grieg's 'In The Hall of the Mountain King', from the 'Peer Gynt' Suite I Op. 46 while attracting the little girls for death. The police force pressed by the Minister give its best effort trying unsuccessfully to arrest the serial killer. The organized crime has great losses due to the intense search and siege of the police and decides to chase the murderer, with the support of the beggars association. They catch Hans and briefly judge him.", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "M trailer", "url": "https://www.youtube.com/embed/nsVproWjN6c", "pic": "", "year": 1931, "id": "0022100"}, {"plot": "Sara Goldfarb (Ellen Burstyn) is a retired widow, living in a small apartment. She spends most of her time watching TV, especially a particular self-help show. She has delusions of rising above her current dull existence by being a guest on that show. Her son, Harry (Jared Leto) is a junkie but along with his friend Tyrone (Marlon Wayans) has visions of making it big by becoming a drug dealer. Harry's girlfriend Marion (Jennifer Connelly) could be fashion designer or artist but is swept along in Harry's drug-centric world. Meanwhile Sara has developed an addiction of her own. She desperately wants to lose weight and so goes on a crash course involving popping pills, pills which turn out to be very addictive and harmful to her mental state.", "genres": ["Drama"], "title": "Requiem for a Dream trailer", "url": "https://www.youtube.com/embed/0nU7dC9bIDg", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSLeppx7uhokRsmuTgdZCyeqJJ_UMo14FFUON48aWzCG2Hg9X8A8WXvc68", "year": 2000, "id": "0180093"}, {"plot": "Protagonist Alex DeLarge is an \"ultraviolent\" youth in futuristic Britain. As with all luck, his eventually runs out and he's arrested and convicted of murder and rape. While in prison, Alex learns of an experimental program in which convicts are programmed to detest violence. If he goes through the program, his sentence will be reduced and he will be back on the streets sooner than expected. But Alex's ordeals are far from over once he hits the mean streets of Britain that he had a hand in creating.", "genres": ["Crime", "Drama", "Sci-Fi"], "title": "A Clockwork Orange trailer", "url": "https://www.youtube.com/embed/xHFPi_3kc1U", "pic": "", "year": 1971, "id": "0066921"}, {"plot": "Travis Bickle is an ex-Marine and Vietnam War veteran living in New York City. As he suffers from insomnia, he spends his time working as a taxi driver at night, watching porn movies at seedy cinemas during the day, or thinking about how the world, New York in particular, has deteriorated into a cesspool. He's a loner who has strong opinions about what is right and wrong with mankind. For him, the one bright spot in New York humanity is Betsy, a worker on the presidential nomination campaign of Senator Charles Palantine. He becomes obsessed with her. After an incident with her, he believes he has to do whatever he needs to make the world a better place in his opinion. One of his priorities is to be the savior for Iris, a twelve-year-old runaway and prostitute who he believes wants out of the profession and under the thumb of her pimp and lover Matthew.", "genres": ["Crime", "Drama"], "title": "Taxi Driver trailer", "url": "https://www.youtube.com/embed/sLpMx8_TYOo", "pic": "", "year": 1976, "id": "0075314"}, {"plot": "In 1938, Walter Neff, an experienced salesman of the Pacific All Risk Insurance Co., meets the seductive wife of one of his clients, Phyllis Dietrichson, and they have an affair. Phyllis proposes to kill her husband to receive the proceeds of an accident insurance policy and Walter devises a scheme to receive twice the amount based on a double indemnity clause. When Mr. Dietrichson is found dead on a train track, the police accept the determination of accidental death. However, the insurance analyst and Walter's best friend Barton Keyes does not buy the story and suspects that Phyllis has murdered her husband with the help of another man.", "genres": ["Crime", "Drama", "Film-Noir", "Mystery", "Thriller"], "title": "Double Indemnity trailer", "url": "https://www.youtube.com/embed/S3wjJcuGsVE", "pic": "", "year": 1944, "id": "0036775"}, {"plot": "A man, Joel Barish, heartbroken that his girlfriend Clementine underwent a procedure to erase him from her memory, decides to do the same. However, as he watches his memories of her fade away, he realizes that he still loves her, and may be too late to correct his mistake.", "genres": ["Drama", "Romance", "Sci-Fi"], "title": "Eternal Sunshine of the Spotless Mind trailer", "url": "https://www.youtube.com/embed/yE-f1alkq9I", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTIxEUEnfV62bkoaQ_igvqBtOLzXf3QKGODnTQMadiyhK00iNlmYZtDLmw", "year": 2004, "id": "0338013"}, {"plot": "Antonio Salieri believes that Wolfgang Amadeus Mozart's music is divine and miraculous. He wishes he was himself as good a musician as Mozart so that he can praise the Lord through composing. He began his career as a devout man who believes his success and talent as a composer are God's rewards for his piety. He's also content as the respected, financially well-off, court composer of Austrian Emperor Joseph II. But he's shocked to learn that Mozart is such a vulgar creature, and can't understand why God favored Mozart to be his instrument. Salieri's envy has made him an enemy of God whose greatness was evident in Mozart. He is ready to take revenge against God and Mozart for his own musical mediocrity.", "genres": ["Biography", "Drama", "History", "Music"], "title": "Amadeus trailer", "url": "https://www.youtube.com/embed/3qikgX4rlG4", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQAQHrXVNtoMNqkvERGP8vPZVY3NI1yJCwuC0NlmKFKEixH2_4cawCUeE0", "year": 1984, "id": "0086879"}, {"plot": "Woody, Buzz and the whole gang are back. As their owner Andy prepares to depart for college, his loyal toys find themselves in daycare where untamed tots with their sticky little fingers do not play nice. So, it's all for one and one for all as they join Barbie's counterpart Ken, a thespian hedgehog named Mr. Pricklepants and a pink, strawberry-scented teddy bear called Lots-o'-Huggin' Bear to plan their great escape.", "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy"], "title": "Toy Story 3 trailer", "url": "https://www.youtube.com/embed/YscpiNUtRN0", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQSVIZ1xhzLt6unLFgAgly2FiyUvpQq0kG2i2iTjih5dj5Emp_3JY9fJfE", "year": 2010, "id": "0435761"}, {"plot": "Biopic of Mahavir Singh Phogat, who taught wrestling to his daughters Babita Kumari and Geeta Phogat. Geeta Phogat was India's first female wrestler to win at the 2010 Commonwealth Games, where she won the gold medal (55 kg) while her sister Babita Kumari won the silver (52 kg).", "genres": ["Action", "Biography", "Drama", "Sport"], "title": "Dangal trailer", "url": "https://www.youtube.com/embed/IEHCkBd3VPI", "pic": "", "year": 2016, "id": "5074352"}, {"plot": "\"2001\" is a story of evolution. Sometime in the distant past, someone or something nudged evolution by placing a monolith on Earth (presumably elsewhere throughout the universe as well). Evolution then enabled humankind to reach the moon's surface, where yet another monolith is found, one that signals the monolith placers that humankind has evolved that far. Now a race begins between computers (HAL) and human (Bowman) to reach the monolith placers. The winner will achieve the next step in evolution, whatever that may be.", "genres": ["Adventure", "Sci-Fi"], "title": "2001: A Space Odyssey trailer", "url": "https://www.youtube.com/embed/Qv4Jv15OSGI", "pic": "", "year": 1968, "id": "0062622"}, {"plot": "A little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that he has life (as a toy) good. However, he must worry about Andy's family moving, and what Woody does not know is about Andy's birthday party. Woody does not realize that Andy's mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy's new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips.", "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy"], "title": "Toy Story trailer", "url": "https://www.youtube.com/embed/KYz2wyBy3kc", "pic": "", "year": 1995, "id": "0114709"}, {"plot": "Sadik is one of the rebellious youth who has been politically active as a university student and became a left-wing journalist in the 70's, despite his father's expectations of him becoming an agricultural engineer and taking control of their family farm in an Aegean village. On the dawn of September 12, 1980, when a merciless military coup hits the country, they cannot find access to any hospital or a doctor and his wife dies while giving birth to their only child, Deniz. After a long-lasting period of torture, trials, and jail time, Sadik returns to his village with 7-8 years old Deniz, knowing that it will be hard to correct things with his father, Huseyin.", "genres": ["Drama"], "title": "Meu Pai e Meu Filho trailer", "url": "https://www.youtube.com/embed/fn9ZIds57DM", "pic": "", "year": 2005, "id": "0476735"}, {"plot": "Russ Duritz (Bruce Willis) is a wealthy L.A. image consultant, but as he nears 40, he's cynical, dogless, chickless, estranged from his father (Daniel von Bargen), and he has no memories of his childhood. One night he surprises an intruder (Spencer Breslin), who turns out to be a kid, almost 8 years old. There's something oddly familiar about the chubby lad, whose name is Rusty. The boy's identity sparks a journey into Russ's past that the two of them take - to find the key moment that has defined who Russ is. Two long-suffering women look on with disbelief: Russ's secretary, Janet(Lily Tomlin), and his assistant, the lovely Amy, to whom Rusty takes a shine. What, and who, is at the end of this journey?", "genres": ["Comedy", "Family", "Fantasy"], "title": "The Kid trailer", "url": "https://www.youtube.com/embed/7uOKGTmzCbg", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQ9DuygjCU5g9PR9Dq4ELO0FMOpWApKo1TICmry_V4-ihGN8cY1VS40tgA", "year": 2000, "id": "0219854"}, {"plot": "In German-occupied France, young Jewish refugee Shosanna Dreyfus witnesses the slaughter of her family by Colonel Hans Landa. Narrowly escaping with her life, she plots her revenge several years later when German war hero Fredrick Zoller takes a rapid interest in her and arranges an illustrious movie premiere at the theater she now runs. With the promise of every major Nazi officer in attendance, the event catches the attention of the \"Basterds\", a group of Jewish-American guerrilla soldiers led by the ruthless Lt. Aldo Raine. As the relentless executioners advance and the conspiring young girl's plans are set in motion, their paths will cross for a fateful evening that will shake the very annals of history.", "genres": ["Adventure", "Drama", "War"], "title": "Inglourious Basterds trailer", "url": "https://www.youtube.com/embed/fYfquwgz21g", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcT7TRysmC-ztOzNqBV-d4-ZSoIaELJ2S8T8n0yBP4ZGc5M0DPvPW_BI8Kc", "year": 2009, "id": "0361748"}, {"plot": "Turkish and his close friend/accomplice Tommy get pulled into the world of match fixing by the notorious Brick Top. Things get complicated when the boxer they had lined up gets badly beaten by Pitt, a 'pikey' ( slang for an Irish Gypsy)- who comes into the equation after Turkish, an unlicensed boxing promoter wants to buy a caravan off the Irish Gypsies. They then try to convince Pitt not only to fight for them, but to lose for them too. Whilst all this is going on, a huge diamond heist takes place, and a fistful of motley characters enter the story, including 'Cousin Avi', 'Boris The Blade', 'Franky Four Fingers' and 'Bullet Tooth Tony'. Things go from bad to worse as it all becomes about the money, the guns, and the damned dog!", "genres": ["Comedy", "Crime"], "title": "Snatch trailer", "url": "https://www.youtube.com/embed/u8jVN5UAji8", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTJmiyEf1HhlL-_bgS46zlk9Xtwyim5MiQ1EqaXrpz0fcdhSv9FtBkuC-At", "year": 2000, "id": "0208092"}, {"plot": "Farhan Qureshi and Raju Rastogi want to re-unite with their fellow collegian, Rancho, after faking a stroke aboard an Air India plane, and excusing himself from his wife - trouser less - respectively. Enroute, they encounter another student, Chatur Ramalingam, now a successful businessman, who reminds them of a bet they had undertaken 10 years ago. The trio, while recollecting hilarious antics, including their run-ins with the Dean of Delhi's Imperial College of Engineering, Viru Sahastrabudhe, race to locate Rancho, at his last known address - little knowing the secret that was kept from them all this time.", "genres": ["Comedy", "Drama"], "title": "3 Idiotas trailer", "url": "https://www.youtube.com/embed/xvszmNXdM4w", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRoiYR0y9Fsbs9nU6J-xtqGZtP1PZ4o9lzdRvjUarXf_vpHsQyDdpjAAg", "year": 2009, "id": "1187043"}, {"plot": "Monco is a bounty killer chasing El Indio and his gang. During his hunting, he meets Col. Douglas Mortimer, another bounty killer, and they decide to make a partnership, chase the bad guys together and split the reward. During their enterprise, there will be lots of bullets and funny situations. In the end, one of the bounty hunters shows the real intention of his hunting.", "genres": ["Western"], "title": "For a Few Dollars More trailer", "url": "https://www.youtube.com/embed/XsS3GLw2-DA", "pic": "", "year": 1965, "id": "0059578"}, {"plot": "Lucas is a Kindergarten teacher who takes great care of his students. Unfortunately for him, young Klara has a run-away imagination and concocts a lie about her teacher. Before Lucas is even able to understand the consequences, he has become the outcast of the town. The hunt is on to prove his innocence before it's taken from him for good.", "genres": ["Drama"], "title": "The Hunt trailer", "url": "https://www.youtube.com/embed/RMPFnc3Gcbg", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTWaNz241O0n5Q9h_0BW-jd6AqXiftiTNZZhUAAcCwZUkJABiNzGAMpzlg", "year": 2012, "id": "2106476"}, {"plot": "A touching tale of a wayward young man who struggles to find his identity, living in a world where he can solve any problem, except the one brewing deep within himself, until one day he meets his soul mate who opens his mind and his heart.", "genres": ["Drama"], "title": "Good Will Hunting trailer", "url": "https://www.youtube.com/embed/z02M3NRtkAA", "pic": "", "year": 1997, "id": "0119217"}, {"plot": "Nader (Peyman Moaadi) and Simin (Leila Hatami) argue about living abroad. Simin prefers to live abroad to provide better opportunities for their only daughter, Termeh. However, Nader refuses to go because he thinks he must stay in Iran and take care of his father (Ali-Asghar Shahbazi), who suffers from Alzheimers. However, Simin is determined to get a divorce and leave the country with her daughter.", "genres": ["Drama", "Mystery"], "title": "A Separation trailer", "url": "https://www.youtube.com/embed/KfuM_v15v-o", "pic": "", "year": 2011, "id": "1832382"}, {"plot": "An art collector appeals to Jones to embark on a search for the Holy Grail. He learns that another archaeologist has disappeared while searching for the precious goblet, and the missing man is his own father, Dr. Henry Jones. The artifact is much harder to find than they expected, and its powers are too much for those impure in heart.", "genres": ["Action", "Adventure", "Fantasy"], "title": "Indiana Jones and the Last Crusade trailer", "url": "https://www.youtube.com/embed/WGpq-LDV6jU", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcT-6fj6rGxmO5u8zPsOFjUl4yrbD6645osRqU6pg5h69H9sqaODQ--w0vEo", "year": 1989, "id": "0097576"}, {"plot": "Eve (Anne Baxter) is waiting backstage to meet her \"idol\" aging Broadway Star, Margo Channing (Bette Davis). It all seems innocent enough as Eve explains that she has seen Margo in EVERY performance of the current play she is in. Only Playright critic DeWitt (George Sanders) sees through Eve's evil plan, which is to take her parts and fiancé, Bill Simpson (Gary Merrill) When the fiancé shows no interest, she tries for playwright Hugh Marlowe (Lloyd Richards) but DeWitt stops her. After she accepts her award, she decides to skip the after-party and goes to her room, where we find a young woman named Phoebe, who snuck into her room and fell asleep. This is where the \"Circle of Life\" now comes to fruition as Eve is going to get played the way she did Margo.", "genres": ["Drama"], "title": "All About Eve trailer", "url": "https://www.youtube.com/embed/dokR0scNqiQ", "pic": "", "year": 1950, "id": "0042192"}, {"plot": "When his parents are killed, billionaire playboy Bruce Wayne relocates to Asia where he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as 'Batman'. But it doesn't stay quiet for long.", "genres": ["Action", "Adventure"], "title": "Batman Begins trailer", "url": "https://www.youtube.com/embed/neY2xVmOfUM", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcT1cEiQcZsIkCGgys5tZaM-DtWSf-nfCLt6y2BsxrVF6qUQrB-qUia8zQ7K", "year": 2005, "id": "0372784"}, {"plot": "Carl Fredricksen as a boy wanted to explore South America and find the forbidden Paradise Falls. About 64 years later he gets to begin his journey along with a Boy Scout named Russel with help from 500 balloons. On their journey they discover many new friends including a talking dog and Carl and Russel figure out that someone evil plans. Carl soon realizes that this evildoer is his childhood idol. Will they be able to defeat him and will they find Paradise Falls?", "genres": ["Animation", "Adventure", "Comedy", "Family"], "title": "Up trailer", "url": "https://www.youtube.com/embed/pkqzFUhGPJg", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTmWvr_GJOj05zuWq7K7JQv7Qm0XJJSZdl0UVFSOtMQGuV-A6h9MK7ENlzw", "year": 2009, "id": "1049413"}, {"plot": "Fred C. Dobbs and Bob Curtin, both down on their luck in Tampico, Mexico in 1925, meet up with a grizzled prospector named Howard and decide to join with him in search of gold in the wilds of central Mexico. Through enormous difficulties, they eventually succeed in finding gold, but bandits, the elements, and most especially greed threaten to turn their success into disaster.", "genres": ["Adventure", "Drama", "Western"], "title": "The Treasure of the Sierra Madre trailer", "url": "https://www.youtube.com/embed/XZ8Q9mOYJgE", "pic": "", "year": 1948, "id": "0040897"}, {"plot": "In April of 1945, Germany stands at the brink of defeat with the Soviet Armies closing in from the west and south. In Berlin, capital of the Third Reich, Adolf Hitler proclaims that Germany will still achieve victory and orders his Generals and advisers to fight to the last man. \"Downfall\" explores these final days of the Reich, where senior German leaders (such as Himmler and Goring) began defecting from their beloved Fuhrer, in an effort to save their own lives, while still others (Joseph Goebbels) pledge to die with Hitler. Hitler, himself, degenerates into a paranoid shell of a man, full of optimism one moment and suicidal depression the next. When the end finally does comes, and Hitler lies dead by his own hand, what is left of his military must find a way to end the killing that is the Battle of Berlin, and lay down their arms in surrender.", "genres": ["Biography", "Drama", "History", "War"], "title": "Downfall trailer", "url": "https://www.youtube.com/embed/-rmskOYlAYI", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQM90vC2dfa_UbE4Mxs8x97sHs9f19gUX2UOFpCTT2x-9CXiSCJIHH3ii1s", "year": 2004, "id": "0363163"}, {"plot": "When Jake LaMotta steps into a boxing ring and obliterates his opponent, he's a prizefighter. But when he treats his family and friends the same way, he's a ticking time bomb, ready to go off at any moment. Though LaMotta wants his family's love, something always seems to come between them. Perhaps it's his violent bouts of paranoia and jealousy. This kind of rage helped make him a champ, but in real life, he winds up in the ring alone.", "genres": ["Biography", "Drama", "Sport"], "title": "Raging Bull trailer", "url": "https://www.youtube.com/embed/YiVOwxsa4OM", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRjECuWZ9C-Mbx_-oYiay3p9bLx8B6tGfBzpZgZgNnJlmqQCmajacGeG-s", "year": 1980, "id": "0081398"}, {"plot": "NYPD cop John McClane goes on a Christmas vacation to visit his wife Holly in Los Angeles where she works for the Nakatomi Corporation. While they are at the Nakatomi headquarters for a Christmas party, a group of bank robbers led by Hans Gruber take control of the building and hold everyone hostage, with the exception of John, while they plan to perform a lucrative heist. Unable to escape and with no immediate police response, John is forced to take matters into his own hands.", "genres": ["Action", "Thriller"], "title": "Die Hard trailer", "url": "https://www.youtube.com/embed/2TQ-pOvI6Xo", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRN_t_UzIGVgyOC4e8cJ1DX_5fUrvXe6FX5ETradCm3r5HBQHONMPbv-ck", "year": 1988, "id": "0095016"}, {"plot": "Zahra's shoes are gone; her older brother Ali lost them. They are poor, there are no shoes for Zahra until they come up with an idea: they will share one pair of shoes, Ali's. School awaits. Will the plan succeed?", "genres": ["Drama", "Family"], "title": "Children of Heaven trailer", "url": "https://www.youtube.com/embed/dqxvZeQsVzY", "pic": "", "year": 1997, "id": "0118849"}, {"plot": "Based on a true story, a group of allied escape artist-type prisoners-of-war (POWs) are all put in an 'escape proof' camp. Their leader decides to try to take out several hundred all at once. The first half of the film is played for comedy as the prisoners mostly outwit their jailers to dig the escape tunnel. The second half is high adventure as they use boats and trains and planes to get out of occupied Europe.", "genres": ["Adventure", "Drama", "History", "Thriller", "War"], "title": "The Great Escape trailer", "url": "https://www.youtube.com/embed/xbVCgc-4zj8", "pic": "", "year": 1963, "id": "0057115"}, {"plot": "Andreiv Rublev charts the life of the great icon painter through a turbulent period of 15th Century Russian history, a period marked by endless fighting between rival Princes and by Tatar invasions.", "genres": ["Biography", "Drama", "History"], "title": "Andrei Rublev trailer", "url": "https://www.youtube.com/embed/8N5oiRPxUJ0", "pic": "", "year": 1966, "id": "0060107"}, {"plot": "In 1944 falangist Spain, a girl, fascinated with fairy-tales, is sent along with her pregnant mother to live with her new stepfather, a ruthless captain of the Spanish army. During the night, she meets a fairy who takes her to an old faun in the center of the labyrinth. He tells her she's a princess, but must prove her royalty by surviving three gruesome tasks. If she fails, she will never prove herself to be the the true princess and will never see her real father, the king, again.", "genres": ["Drama", "Fantasy", "War"], "title": "Pan's Labyrinth trailer", "url": "https://www.youtube.com/embed/5mmV8YdehA0", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRXNkD6jqQsaz4zeHqR_jgJR-OC5wvmEPhlA4_i_jVOWphfa3ChEd0Ruw", "year": 2006, "id": "0457430"}, {"plot": "Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy, Fear, Anger, Disgust and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school.", "genres": ["Animation", "Adventure", "Comedy", "Drama", "Family", "Fantasy"], "title": "Inside Out (I) trailer", "url": "", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRUASkfaSn0Omy6QcaaX0vn1Ea0auORa6bYKzUEfV_5DFIoUbItNIutPCA", "year": 2015, "id": "2096673"}, {"plot": "Japanese warlord Hidetori Ichimonji decides the time has come to retire and divide his fiefdom among his three sons. His eldest and middle sons - Taro and Jiro - agree with his decision and promise to support him for his remaining days. The youngest son Saburo disagrees with all of them arguing that there is little likelihood the three brothers will remain united. Insulted by his son's brashness, the warlord banishes Saburo. As the warlord begins his retirement, he quickly realizes that his two eldest sons selfish and have no intention of keeping their promises. It leads to war and only banished Saburo can possibly save him.", "genres": ["Action", "Drama"], "title": "Ran trailer", "url": "https://www.youtube.com/embed/AbbfDntoRRk", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQveY_wh1kGy8p9ogqnK2M-czKM4a5E1-Jb7AvR_Z3PbbFFt0CwqNBmv4A", "year": 1985, "id": "0089881"}, {"plot": "ROOM tells the extraordinary story of Jack, a spirited 5-year-old who is looked after by his loving and devoted mother. Like any good mother, Ma dedicates herself to keeping Jack happy and safe, nurturing him with warmth and love and doing typical things like playing games and telling stories. Their life, however, is anything but typical--they are trapped--confined to a 10-by-10-foot space that Ma has euphemistically named Room. Ma has created a whole universe for Jack within Room, and she will stop at nothing to ensure that, even in this treacherous environment, Jack is able to live a complete and fulfilling life. But as Jack's curiosity about their situation grows, and Ma's resilience reaches its breaking point, they enact a risky plan to escape, ultimately bringing them face-to-face with what may turn out to be the scariest thing yet: the real world.", "genres": ["Drama"], "title": "O Quarto de Jack (I) trailer", "url": "https://www.youtube.com/embed/IeM5qJp2v8Y", "pic": "", "year": 2015, "id": "3170832"}, {"plot": "A lone prospector ventures into Alaska looking for gold. He gets mixed up with some burly characters and falls in love with the beautiful Georgia. He tries to win her heart with his singular charm.", "genres": ["Adventure", "Comedy", "Drama", "Family"], "title": "The Gold Rush trailer", "url": "https://www.youtube.com/embed/4FhPYptZoDg", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSPOT8NRNPoKpB86vljNuZOJ0OnRGg025Wpo6njSyUTtR8dZMCeCOM_WN8", "year": 1925, "id": "0015864"}, {"plot": "In 1999, retired Argentinian federal justice agent Benjamín Espósito is writing a novel, using an old closed case as the source material. That case is the brutal rape and murder of Liliana Coloto. In addition to seeing the extreme grief of the victim's husband Ricardo Morales, Benjamín, his assistant Pablo Sandoval, and newly hired department chief Irene Menéndez-Hastings were personally affected by the case as Benjamín and Pablo tracked the killer, hence the reason why the unsatisfactory ending to the case has always bothered him. Despite the department already having two other suspects, Benjamín and Pablo ultimately were certain that a man named Isidoro Gómez is the real killer. Although he is aware that historical accuracy is not paramount for the novel, the process of revisiting the case is more an issue of closure for him. He tries to speak to the key players in the case, most specifically Irene, who still works in the justice department and who he has always been attracted to but never pursued due to the differences in their ages and social classes. The other issue is that Gómez is still at large, no one aware if he is alive or dead. But as Pablo at the time mentioned that passion is one thing that cannot be changed in behavior, Benjamín learns now that that premise still holds true.", "genres": ["Drama", "Mystery", "Thriller"], "title": "The Secret in Their Eyes trailer", "url": "https://www.youtube.com/embed/hlSASsGs73w", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTyzH0jJCWlYenIVESPeGfVDA17ie1l61Jtyce3Po86jxPri_NVWtw5cF0", "year": 2009, "id": "1305806"}, {"plot": "In the futuristic year of 2019, Los Angeles has become a dark and depressing metropolis, filled with urban decay. Rick Deckard, an ex-cop, is a \"Blade Runner\". Blade runners are people assigned to assassinate \"replicants\". The replicants are androids that look like real human beings. When four replicants commit a bloody mutiny on the Off World colony, Deckard is called out of retirement to track down the androids. As he tracks the replicants, eliminating them one by one, he soon comes across another replicant, Rachel, who evokes human emotion, despite the fact that she's a replicant herself. As Deckard closes in on the leader of the replicant group, his true hatred toward artificial intelligence makes him question his own identity in this future world, including what's human and what's not human.", "genres": ["Sci-Fi", "Thriller"], "title": "Blade Runner trailer", "url": "https://www.youtube.com/embed/KPcZHjKJBnE", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRn8Bm9-eD4jkXYDKXsR3vnErFPAuyW4avwKpAmRYrXg8c72MluDvZ2gQ", "year": 1982, "id": "0083658"}, {"plot": "A love story between an 18-year-old girl named Sophie, cursed by a witch into an old woman's body, and a magician named Howl. Under the curse, Sophie sets out to seek her fortune, which takes her to Howl's strange moving castle. In the castle, Sophie meets Howl's fire demon, named Karishifâ. Seeing that she is under a curse, the demon makes a deal with Sophie--if she breaks the contract he is under with Howl, then Karushifâ will lift the curse that Sophie is under, and she will return to her 18-year-old shape.", "genres": ["Animation", "Adventure", "Family", "Fantasy"], "title": "Howl's Moving Castle trailer", "url": "https://www.youtube.com/embed/UibodUGoL4M", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcS3G5-M8xbVPr4afJkiVFfVH2nZBR5hwk4yuIs_fVtq8_Y3_IbQ_pI6ADU", "year": 2004, "id": "0347149"}, {"plot": "A Knight and his squire are home from the crusades. Black Death is sweeping their country. As they approach home, Death appears to the knight and tells him it is his time. The knight challenges Death to a chess game for his life. The Knight and Death play as the cultural turmoil envelopes the people around them as they try, in different ways, to deal with the upheaval the plague has caused.", "genres": ["Drama", "Fantasy"], "title": "The Seventh Seal trailer", "url": "https://www.youtube.com/embed/4M3AQMHRufY", "pic": "", "year": 1957, "id": "0050976"}, {"plot": "Four Jack-the-lads find themselves heavily - seriously heavily - in debt to an East End hard man and his enforcers after a crooked card game. Overhearing their neighbours in the next flat plotting to hold up a group of out-of-their-depth drug growers, our heros decide to stitch up the robbers in turn. In a way the confusion really starts when a pair of antique double-barrelled shotguns go missing in a completely different scam.", "genres": ["Comedy", "Crime"], "title": "Lock, Stock and Two Smoking Barrels trailer", "url": "https://www.youtube.com/embed/KZh33gGK3Y8", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRkb8O8sJbkgbRbM6-0YwsfIUIZVq086HdbzddGBbOsfa5t5qgrHUW7aDQ", "year": 1998, "id": "0120735"}, {"plot": "A mother's last wishes send twins Jeanne and Simon on a journey to the Middle East in search of their tangled roots. Adapted from Wajdi Mouawad's acclaimed play, Incendies tells the powerful and moving tale of two young adults' voyage to the core of deep-rooted hatred, never-ending wars and enduring love.", "genres": ["Drama", "Mystery", "War"], "title": "Incendies trailer", "url": "https://www.youtube.com/embed/0nycksytL1A", "pic": "", "year": 2010, "id": "1255953"}, {"plot": "The true story of Desmond T. Doss, the conscientious objector who, at the Battle of Okinawa, won the Medal of Honor for his incredible bravery and regard for his fellow soldiers. We see his upbringing and how this shaped his views, especially his religious view and anti-killing stance. We see Doss's trials and tribulations after enlisting in the US Army and trying to become a medic. Finally, we see the hell on Earth that was Hacksaw Ridge.", "genres": ["Biography", "Drama", "History", "War"], "title": "Até o Último Homem trailer", "url": "https://www.youtube.com/embed/R4cmOy0V8UA", "pic": "", "year": 2016, "id": "2119532"}, {"plot": "From the heights of notoriety to the depths of depravity, John Forbes Nash, Jr. experienced it all. A mathematical genius, he made an astonishing discovery early in his career and stood on the brink of international acclaim. But the handsome and arrogant Nash soon found himself on a painful and harrowing journey of self-discovery. After many years of struggle, he eventually triumphed over his tragedy, and finally - late in life - received the Nobel Prize.", "genres": ["Biography", "Drama"], "title": "A Beautiful Mind trailer", "url": "https://www.youtube.com/embed/kKbKpTXmlLw", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSZJ-KAeVOoDr_1JKM2kydyfaB5amnJTjEXA7yByjsioi_CnktHxO_M-z-m", "year": 2001, "id": "0268978"}, {"plot": "With the exception of his elderly housekeeper Miss Agda who he treats almost like a surrogate platonic wife, widowed seventy-eight year old Dr. Isak Borg, a former medical doctor and professor, has retreated from any human contact, partly his own want but partly the decision of others who do not want to spend time with him because of his cold demeanor. He is traveling from his home in Stockholm to Lund to accept an honorary degree. Instead of flying as was the original plan, he decides to take the day long drive instead. Along for the ride is his daughter-in-law Marianne, who had been staying with him for the month but has now decided to go home. The many stops and encounters along the way make him reminisce about various parts of his life. Those stops which make him reminisce directly are at his childhood summer home, at the home of his equally emotionally cold mother, and at a gas station where the attendants praise him as a man for his work. But the lives of other people they encounter almost mirror his own, including hitchhikers Sara, Viktor and Anders - who remind him of his cousin Sara who he was going to marry, himself and his irresponsible brother Sigfrid who Sara eventually married - a bickering married couple Sten and Berit Alman, and Marianne and her husband and Isak's son Evald, whose marriage is as strained as was his own.", "genres": ["Drama", "Romance"], "title": "Wild Strawberries trailer", "url": "https://www.youtube.com/embed/0RzOCwer-gc", "pic": "", "year": 1957, "id": "0050986"}, {"plot": "Tells the story of Evey Hammond and her unlikely but instrumental part in bringing down the fascist government that has taken control of a futuristic Great Britain. Saved from a life-and-death situation by a man in a Guy Fawkes mask who calls himself V, she learns a general summary of V's past and, after a time, decides to help him bring down those who committed the atrocities that led to Britain being in the shape that it is in.", "genres": ["Action", "Drama", "Thriller"], "title": "V for Vendetta trailer", "url": "", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQh1WEzffx3JdXx3DHwB61oKcxgjkDT-YevK-B7BzZGJ0WcG0OUYI6alA", "year": 2005, "id": "0434409"}, {"plot": "Johnnie loves his train (\"The General\") and Annabelle Lee. When the Civil War begins he is turned down for service because he's more valuable as an engineer. Annabelle thinks it's because he's a coward. Union spies capture The General with Annabelle on board. Johnnie must rescue both his loves.", "genres": ["Action", "Adventure", "Comedy", "Drama", "War", "Western"], "title": "The General trailer", "url": "https://www.youtube.com/embed/g193eTLigrQ", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQTroeC14dmOHEQlHFe5KnrNYvmmznT0k1Qgw-6MY07OrNeZpisY2NVzhc", "year": 1926, "id": "0017925"}, {"plot": "Jordan Belfort is a Long Island penny stockbroker who served 22 months in prison for defrauding investors in a massive 1990s securities scam that involved widespread corruption on Wall Street and in the corporate banking world, including shoe designer Steve Madden.", "genres": ["Biography", "Comedy", "Crime", "Drama"], "title": "The Wolf of Wall Street trailer", "url": "https://www.youtube.com/embed/idAVRvQeYAE", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcStrljWl_2MSZzjUmIzzWN6VsTCzS9IfCBEKyksmzNaHTJhg_CVmMMbSaU", "year": 2013, "id": "0993846"}, {"plot": "Two brothers face the fight of a lifetime - and the wreckage of their broken family - within the brutal, high-stakes world of Mixed Martial Arts (MMA) fighting in Lionsgate's action/drama, WARRIOR. A former Marine, haunted by a tragic past, Tommy Riordan returns to his hometown of Pittsburgh and enlists his father, a recovered alcoholic and his former coach, to train him for an MMA tournament awarding the biggest purse in the history of the sport. As Tommy blazes a violent path towards the title prize, his brother, Brendan, a former MMA fighter unable to make ends meet as a public school teacher, returns to the amateur ring to provide for his family. Even though years have passed, recriminations and past betrayals keep Brendan bitterly estranged from both Tommy and his father. But when Brendan's unlikely rise as an underdog sets him on a collision course with Tommy, the two brothers must finally confront the forces that tore them apart, all the while waging the most intense, winner-takes-all battle of their lives.", "genres": ["Action", "Drama", "Sport"], "title": "Warrior trailer", "url": "https://www.youtube.com/embed/I5kzcwcQA1Q", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQm7-Es0JHKT929nk-FA3tAgr7-vStcBt08bJQjyQANnbLEkbgKDZTxT5U", "year": 2011, "id": "1291584"}, {"plot": "A man calls up the Mumbai police, and tells them he has placed five different bombs in the city -- all set to go off in some time. He wants four terrorists in exchange. Does he get them? Who is behind it all? What's his motive? Is there more than meets the eye?", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "A Wednesday trailer", "url": "https://www.youtube.com/embed/LGfwASavWNQ", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTZ3YxTGgZdAAnqbx6yz_Rgq6DJDEFkChAX2sQ5-5RRLxg3IxPEIh7tWiQk", "year": 2008, "id": "1280558"}, {"plot": "Walt Kowalski is a widower who holds onto his prejudices despite the changes in his Michigan neighborhood and the world around him. Kowalski is a grumpy, tough-minded, unhappy old man who can't get along with either his kids or his neighbors. He is a Korean War veteran whose prize possession is a 1972 Gran Torino he keeps in mint condition. When his neighbor Thao, a young Hmong teenager under pressure from his gang member cousin, tries to steal his Gran Torino, Kowalski sets out to reform the youth. Drawn against his will into the life of Thao's family, Kowalski is soon taking steps to protect them from the gangs that infest their neighborhood.", "genres": ["Drama"], "title": "Gran Torino trailer", "url": "https://www.youtube.com/embed/EiC9dcPrMNE", "pic": "", "year": 2008, "id": "1205489"}, {"plot": "When \"The Dude\" Lebowski is mistaken for a millionaire Lebowski, two thugs urinate on his rug to coerce him into paying a debt he knows nothing about. While attempting to gain recompense for the ruined rug from his wealthy counterpart, he accepts a one-time job with high pay-off. He enlists the help of his bowling buddy, Walter, a gun-toting Jewish-convert with anger issues. Deception leads to more trouble, and it soon seems that everyone from porn empire tycoons to nihilists want something from The Dude.", "genres": ["Comedy", "Crime", "Mystery"], "title": "The Big Lebowski trailer", "url": "https://www.youtube.com/embed/cd-go0oBF4Y", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSDVCH23X-FDFidpBdIO_e5kzQ6-7bcO-PGLR71Rx0sd-pBgIYgE5_6ACMc", "year": 1998, "id": "0118715"}, {"plot": "Michael, Steven and Nick are young factory workers from Pennsylvania who enlist into the Army to fight in Vietnam. Before they go, Steven marries the pregnant Angela, and their wedding party also serves as the men's farewell party. After some time and many horrors, the three friends fall in the hands of the Vietcong and are brought to a prison camp in which they are forced to play Russian roulette against each other. Michael makes it possible for them to escape, but they soon get separated again.", "genres": ["Drama", "War"], "title": "The Deer Hunter trailer", "url": "https://www.youtube.com/embed/3Gqit3zVmyc", "pic": "", "year": 1978, "id": "0077416"}, {"plot": "The all new \"true crime\" case of Fargo's new chapter travels back to 1979 in Sioux Falls, South Dakota and Luverne, Minnesota, where a young State Police Officer Lou Solverson, recently back from Vietnam, investigates a case involving a local crime gang and a major Mob syndicate. Helping him piece things together is his father-in-law, Sheriff Hank Larsson. The investigation will lead them to a colorful cast of characters that includes Karl Weathers, the town lawyer of Luverne, Minnesota. A Korean War vet, Karl is a flowery drunk blessed with the gift of gab and the eloquence of a true con artist. Joe Bulo, the front man for the northern expansion of a Kansas City crime syndicate. The new face of corporate crime, Joe's bringing a Walmart mentality to small town America. His number two is Mike Milligan. Part enforcer, part detective, Mike is always smiling - but the joke is usually on you. Bulo and his crew have their sights set on the Gerhardt crime family in Fargo, currently led by matriarch Floyd Gerhardt. With her husband at death's door, Floyd takes over the family business, frustrating her eldest son, Dodd Gerhardt. An impatient hothead with a cruel streak to match his ambitions, Dodd can't wait for both his parents to die so he can take over and expand their business from kingdom to empire. Bear Gerhardt is the middle son, an intimidatingly large man who, although inarticulate, is the most decent of his clan. Rye Gerhardt, the youngest of the Gerhardt clan, views himself as a big shot, but in reality he's just a small dog who barks big.", "genres": ["Crime", "Drama", "Thriller"], "title": "Fargo trailer", "url": "https://www.youtube.com/embed/EfVSep6ajuc", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRHyP0HTrwwYTyxDzmPVfu6FAYprSl9PcIXcEjnv7TUjhLIowkT2mF5ag4", "year": 2014, "id": "2802850"}, {"plot": "An elderly couple journey to Tokyo to visit their children and are confronted by indifference, ingratitude and selfishness. When the parents are packed off to a resort by their impatient children, the film deepens into an unbearably moving meditation on mortality.", "genres": ["Drama"], "title": "Tokyo Story trailer", "url": "https://www.youtube.com/embed/5zEKw4VQIeY", "pic": "", "year": 1953, "id": "0046438"}, {"plot": "A clown fish named Marlin lives in the Great Barrier Reef loses his son, Nemo. After he ventures into the open sea, despite his father's constant warnings about many of the ocean's dangers. Nemo is abducted by a boat and netted up and sent to a dentist's office in Sydney. So, while Marlin ventures off to try to retrieve Nemo, Marlin meets a fish named Dory, a blue tang suffering from short-term memory loss. The companions travel a great distance, encountering various dangerous sea creatures such as sharks, anglerfish and jellyfish, in order to rescue Nemo from the dentist's office, which is situated by Sydney Harbor. While the two are doing this, Nemo and the other sea animals in the dentist's fish tank plot a way to return to Sydney Harbor to live their lives free again.", "genres": ["Animation", "Adventure", "Comedy", "Family"], "title": "Finding Nemo trailer", "url": "https://www.youtube.com/embed/CTPPCs7ZqYo", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcT0zKHaHUlnnw4zu8VAl4KIJxFYtO7aj0Z6UHXmBcPNb6rp848cTsWz7PxS", "year": 2003, "id": "0266543"}, {"plot": "A US research station, Antarctica, early-winter 1982. The base is suddenly buzzed by a helicopter from the nearby Norwegian research station. They are trying to kill a dog that has escaped from their base. After the destruction of the Norwegian chopper the members of the US team fly to the Norwegian base, only to discover them all dead or missing. They do find the remains of a strange creature the Norwegians burned. The Americans take it to their base and deduce that it an alien life form. After a while it is apparent that the alien can take over and assimilate into other life forms, including humans, and can spread like a virus. This means that anyone at the base could be inhabited by The Thing, and tensions escalate.", "genres": ["Horror", "Mystery", "Sci-Fi"], "title": "The Thing trailer", "url": "https://www.youtube.com/embed/5ftmr17M-a4", "pic": "", "year": 1982, "id": "0084787"}, {"plot": "In rural Texas, welder and hunter Llewelyn Moss (Josh Brolin) discovers the remains of several drug runners who have all killed each other in an exchange gone violently wrong. Rather than report the discovery to the police, Moss decides to simply take the two million dollars present for himself. This puts the psychopathic killer, Anton Chigurh (Javier Bardem), on his trail as he dispassionately murders nearly every rival, bystander and even employer in his pursuit of his quarry and the money. As Moss desperately attempts to keep one step ahead, the blood from this hunt begins to flow behind him with relentlessly growing intensity as Chigurh closes in. Meanwhile, the laconic Sherrif Ed Tom Bell (Tommy Lee Jones) blithely oversees the investigation even as he struggles to face the sheer enormity of the crimes he is attempting to thwart.", "genres": ["Crime", "Drama", "Thriller"], "title": "No Country for Old Men trailer", "url": "https://www.youtube.com/embed/1YLfpDBzhFI", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTR3RukGGu6kAPRcmFhHTQiN8t80HouJTfpsVVp0Soux0fFplILDcKJrA", "year": 2007, "id": "0477348"}, {"plot": "A shy ladies' companion, staying in Monte Carlo with her stuffy employer, meets the wealthy Maxim de Winter. She and Max fall in love, marry and return to Manderley, his large country estate in Cornwall. Max is still troubled by the death of his first wife, Rebecca, in a boating accident the year before. The second Mrs. de Winter clashes with the housekeeper, Mrs. Danvers, and discovers that Rebecca still has a strange hold on everyone at Manderley.", "genres": ["Drama", "Mystery", "Romance", "Thriller"], "title": "Rebecca trailer", "url": "https://www.youtube.com/embed/CANjLGLrdak", "pic": "", "year": 1940, "id": "0032976"}, {"plot": "Long ago up North on the Island of Berk, the young Viking, Hiccup, wants to join his town's fight against the dragons that continually raid their town. However, his macho father and village leader, Stoik the Vast, will not allow his small, clumsy, but inventive son to do so. Regardless, Hiccup ventures out into battle and downs a mysterious Night Fury dragon with his invention, but can't bring himself to kill it. Instead, Hiccup and the dragon, whom he dubs Toothless, begin a friendship that would open up both their worlds as the observant boy learns that his people have misjudged the species. But even as the two each take flight in their own way, they find that they must fight the destructive ignorance plaguing their world.", "genres": ["Animation", "Action", "Adventure", "Comedy", "Family", "Fantasy"], "title": "How to Train Your Dragon trailer", "url": "https://www.youtube.com/embed/HqMYHjlBMUY", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRE6YoyZLr5f_U0KzzLAUUuTw5oyt0mRUKKkJ5rZefbxlW8_i9kz2EaXAuV", "year": 2010, "id": "0892769"}, {"plot": "The intersecting life stories of Daniel Plainview and Eli Sunday in early twentieth century California presents miner-turned-oilman Daniel Plainview, a driven man who will do whatever it takes to achieve his goals. He works hard but also takes advantage of those around him at their expense if need be. His business partner/son (H.W.) is, in reality, an \"acquired\" child whose true biological single-parent father (working on one of Daniel's rigs) died in a workplace accident. Daniel is deeply protective of H.W. if only for what H.W. brings to the partnership. Eli Sunday is one in a pair of twins whose family farm Daniel purchases for the major oil deposit located on it. Eli, a local preacher and a self-proclaimed faith healer, wants the money from the sale of the property to finance his own church. The lives of the two competitive men often clash as Daniel pumps oil off the property and tries to acquire all the surrounding land at bargain prices to be able to build a pipeline to the coast, and as Eli tries to build his own religious empire.", "genres": ["Drama", "History"], "title": "There Will Be Blood trailer", "url": "https://www.youtube.com/embed/f3THVbr4hlY", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTy7u7kqAD-283W1f9oYBJfJYzdPgbo8xjYUsCWisg2o8Aou8eooy08PCA", "year": 2007, "id": "0469494"}, {"plot": "Based on a true story. After graduating from Emory University, Christopher McCandless abandoned his possessions, gave his entire savings account to charity, and hitchhiked to Alaska to live in the wilderness. Along the way, Christopher encounters a series of characters who shape his life.", "genres": ["Adventure", "Biography", "Drama"], "title": "Into the Wild trailer", "url": "https://www.youtube.com/embed/2LAuzT_x8Ek", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSLeppx7uhokRsmuTgdZCyeqJJ_UMo14FFUON48aWzCG2Hg9X8A8WXvc68", "year": 2007, "id": "0758758"}, {"plot": "On the occasion of his fifth wedding anniversary, Nick Dunne reports that his wife, Amy, has gone missing. Under pressure from the police and a growing media frenzy, Nick's portrait of a blissful union begins to crumble. Soon his lies, deceits and strange behavior have everyone asking the same dark question: Did Nick Dunne kill his wife?", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Gone Girl trailer", "url": "https://www.youtube.com/embed/Ym3LB0lOJ0o", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTupyo2hOWXCGKlI4Y7RZHb0QI07gn6dK5YPa_2dh1LrEXuAOQP0tOEZI0", "year": 2014, "id": "2267998"}, {"plot": "During WWII, a Belarusian boy is thrust into the atrocities of war, fighting with a hopelessly unequipped Soviet resistance movement against ruthless German forces. Witnessing scenes of abject terror and surviving horrifying situations, he loses his innocence and then his mind.", "genres": ["Drama", "War"], "title": "Come and See trailer", "url": "", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSoXhil5PjhB4eJVHyJeeAY8Jab42osY1uka8c6RUgP-sx83Zd6AhPLPlFv", "year": 1985, "id": "0091251"}, {"plot": "The story of Brian of Nazareth, born on the same day as Jesus of Nazareth, who takes a different path in life that leads to the same conclusion. Brian joins a political resistance movement aiming to get the Romans out of Judea. Brian scores a victory of sorts when he manages to paint political slogans on an entire wall in the city of Jerusalem. The movement is not very effective but somehow Brian becomes a prophet and gathers his own following. His fate is sealed however and he lives a very short life.", "genres": ["Comedy"], "title": "Life of Brian trailer", "url": "https://www.youtube.com/embed/TKPmGjVFbrY", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQFHTBU-jAr7f9bdsJvM0GrRU0hyOJcXog1RqLsvF2MHMb1WImhikOod1w", "year": 1979, "id": "0079470"}, {"plot": "In India gangsters are called Bhai (brothers). One such Bhai is Munna, who is feared by everyone in Mumbai, a big city in India. He cons his village-based parents into believing that he is a doctor. He gets a shock when he finds out that they are coming to verify for themselves. So he transforms a rooming shanty house into a makeshift hospital, populated by patients, people he beats up. His parents arrive, are pleased, and happy that their son is well settled. They would like him to get married to a doctor's daughter. The marriage is arranged, but before the engagement, the bride's father finds out the truth about Munna, and cancels the marriage. Munna's humiliated parents see the truth for themselves, and hurt, they return home, leaving Munna with a strong desire to hurt the doctor - and force him to let his daughter get married to him - even if it means getting admitted in the medical college - with forged documents!!!", "genres": ["Comedy", "Drama", "Romance"], "title": "Munna Bhai M.B.B.S. trailer", "url": "https://www.youtube.com/embed/UpNCtPMRV7s", "pic": "", "year": 2003, "id": "0374887"}, {"plot": "It's 1954, and up-and-coming U.S. marshal Teddy Daniels is assigned to investigate the disappearance of a patient from Boston's Shutter Island Ashecliffe Hospital. He's been pushing for an assignment on the island for personal reasons, but before long he wonders whether he hasn't been brought there as part of a twisted plot by hospital doctors whose radical treatments range from unethical to illegal to downright sinister. Teddy's shrewd investigating skills soon provide a promising lead, but the hospital refuses him access to records he suspects would break the case wide open. As a hurricane cuts off communication with the mainland, more dangerous criminals \"escape\" in the confusion, and the puzzling, improbable clues multiply, Teddy begins to doubt everything - his memory, his partner, even his own sanity.", "genres": ["Mystery", "Thriller"], "title": "Shutter Island trailer", "url": "https://www.youtube.com/embed/5iaYLCiq5RM", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTKTmyifLbHsiead9He6QW7tQwFjELv6lK9x5ax817d7lFO1-Ot8zJnnZSa", "year": 2010, "id": "1130884"}, {"plot": "During the 1990s, some of the worst atrocities in the history of mankind took place in the country of Rwanda--and in an era of high-speed communication and round the clock news, the events went almost unnoticed by the rest of the world. In only three months, one million people were brutally murdered. In the face of these unspeakable actions, inspired by his love for his family, an ordinary man summons extraordinary courage to save the lives of over a thousand helpless refugees, by granting them shelter in the hotel he manages.", "genres": ["Biography", "Drama", "History", "War"], "title": "Hotel Rwanda trailer", "url": "https://www.youtube.com/embed/qZzfxL90100", "pic": "", "year": 2004, "id": "0395169"}, {"plot": "Set against the sexy, glamorous golden age of Formula 1 racing in the 1970s, the film is based on the true story of a great sporting rivalry between handsome English playboy James Hunt (Hemsworth), and his methodical, brilliant opponent, Austrian driver Niki Lauda (Bruhl). The story follows their distinctly different personal styles on and off the track, their loves and the astonishing 1976 season in which both drivers were willing to risk everything to become world champion in a sport with no margin for error: if you make a mistake, you die.", "genres": ["Action", "Biography", "Drama", "Sport"], "title": "Rush (I) trailer", "url": "https://www.youtube.com/embed/L_u3FODrenM", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTEEhH_kxIQhppY-lyit51O8DyFDSv9mwpmvaZTrTCFh3BLH7W9HRFe4cU", "year": 2013, "id": "1979320"}, {"plot": "Sholay means embers in Hindi. In this particular movie, a Police Officer, who's family was killed by a bandit named Gabbar Singh, decides to fight fire with fire and recruits two convicts, Jai and Veeru to capture Gabbar. He approaches them in jail, puts the proposal in front of them, and they agree to bring in Gabbar Singh alive - for a hefty price. After their discharge from jail, they travel by train to the village where the Police Officer lives - now with only his widowed daughter-in-law. The three band together to fight one of the most elusive and dreaded bandits of all time. Will the two ex-cons be able to bring Gabbar alive to the Police Officer?", "genres": ["Action", "Adventure", "Comedy", "Drama", "Musical", "Thriller"], "title": "Sholay trailer", "url": "https://www.youtube.com/embed/ci_VNqzCa-Y", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRlVdxIx6VSiDWkz1yDUX7SfuKDNp6h41nNL6J9hFKilGL6CXukakZBZwQ", "year": 1975, "id": "0073707"}, {"plot": "Baburao is a landlord in India, who is very near-sighted, and always in financial trouble. He has a tenant named Raja, who has not paid his rent for several months. He also has anther tenant named Shyam, who has come to the city to look for a job in his late father's place, but is unable to find employment. The three men quarrel amongst themselves frequently. Then one day, the three men get a phone call from a kidnapper named Kabira, and decide to make use of this phone call to overcome their financial problems - pretend to be the real kidnappers, increase the ransom amount, keep the incremental amount for themselves, and then give the original ransom demanded to Kabira. Will they get away with this idea?", "genres": ["Comedy", "Crime", "Thriller"], "title": "Hera Pheri trailer", "url": "https://www.youtube.com/embed/x-qMfdUYC-8", "pic": "", "year": 2000, "id": "0242519"}, {"plot": "It's the summer of 1959 in Castlerock, Oregon and four 12 year-old boys - Gordie, Chris, Teddy and Vern - are fast friends. After learning of the general location of the body of a local boy who has been missing for several days, they set off into woods to see it. Along the way, they learn about themselves, the meaning of friendship and the need to stand up for what is right.", "genres": ["Adventure", "Drama"], "title": "Stand by Me trailer", "url": "https://www.youtube.com/embed/FUVnfaA-kpI", "pic": "", "year": 1986, "id": "0092005"}, {"plot": "When the Boston Globe's tenacious \"Spotlight\" team of reporters delves into allegations of abuse in the Catholic Church, their year-long investigation uncovers a decades-long cover-up at the highest levels of Boston's religious, legal, and government establishment, touching off a wave of revelations around the world.", "genres": ["Crime", "Drama", "History"], "title": "Spotlight (I) trailer", "url": "https://www.youtube.com/embed/zgicIR5Skwc", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTM_1agSL-1pqNjFo_waPmIiKTXzut7tUEBiaQpcjTJprO9ZxpSu9q4IFkg", "year": 2015, "id": "1895587"}, {"plot": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and almost everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order. There's Max, a man of action and a man of few words, who seeks peace of mind following the loss of his wife and child in the aftermath of the chaos. And Furiosa, a woman of action and a woman who believes her path to survival may be achieved if she can make it across the desert back to her childhood homeland.", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "title": "Mad Max: Fury Road trailer", "url": "https://www.youtube.com/embed/NY-r5-k5e04", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSfOsEEia78QA4nCKnRGUSr111GAuAcKidgiYgehtuFU_neJVoM0N-89muI", "year": 2015, "id": "1392190"}, {"plot": "Based on an incredible true story of one man's fight for survival and freedom. In the pre-Civil War United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty personified by a malevolent slave owner, as well as unexpected kindnesses, Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon's chance meeting with a Canadian abolitionist will forever alter his life.", "genres": ["Biography", "Drama", "History"], "title": "12 Years a Slave trailer", "url": "https://www.youtube.com/embed/NIqodUJ-UfM", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQXo9vEzIMZPSXiS6Kz6vzpOBJiHg9zTOm7ZzgwZVSSVrIYRLw4EZFRYkUp", "year": 2013, "id": "2024544"}, {"plot": "GRAND BUDAPEST HOTEL recounts the adventures of Gustave H, a legendary concierge at a famous European hotel between the wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend. The story involves the theft and recovery of a priceless Renaissance painting and the battle for an enormous family fortune -- all against the back-drop of a suddenly and dramatically changing Continent.", "genres": ["Adventure", "Comedy", "Drama"], "title": "The Grand Budapest Hotel trailer", "url": "https://www.youtube.com/embed/nGWVzaPUOOk", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQ67ohed0IkOH4xH7aJ-0OiwAfz1re0lXT08hQeqR_iTj_cmL50HPAyyhYG", "year": 2014, "id": "2278388"}, {"plot": "Judah Ben-Hur, a prince falsely accused of treason by his adopted brother, an officer in the Roman army, returns to his homeland after years at sea to seek revenge, but finds redemption.", "genres": ["Action", "Adventure", "Drama"], "title": "Ben-Hur trailer", "url": "https://www.youtube.com/embed/gsg69q_tdr8", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTsrXJZWCrRnK-bphBELxTD_AmdpSXkXfnDdnOHByWXBWJq0RDrMPuo4Bs", "year": 2016, "id": "2638144"}, {"plot": "Wanting to learn from the best, aspiring boxer Maggie Fitzgerald wants Frankie Dunn to train her. At the outset he flatly refuses saying he has no interest in training a girl. Frankie leads a lonely existence, alienated from his only daughter and having few friends. Maggie's rough around the edges but shows a lot of grit in the ring and he eventually relents. Maggie not only proves to be the boxer he always dreamed of having under his wing but a friend who fills the great void he's had in his life. Maggie's career skyrockets but an accident in the ring leads her to ask Frankie for one last favor.", "genres": ["Drama", "Sport"], "title": "Million Dollar Baby trailer", "url": "https://www.youtube.com/embed/GfHk5Vl8ZMM", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSLeppx7uhokRsmuTgdZCyeqJJ_UMo14FFUON48aWzCG2Hg9X8A8WXvc68", "year": 2004, "id": "0405159"}, {"plot": "Amar and Prem are two rivals who belonging to middle-class families with no scope of future advancement. Both individually, without the knowledge of the other decide to take matters into their hands and find ways to get rich quickly. Chaos and acrimony result when both find each other at loggerheads when both arrive to win the hand of the daughter of multi-millionaire Ram Gopal Bajaj amidst considerable upheavals when Shyam, the twin brother of Ram, decides to do away with Ram and assume his identity and thus take over the estate of the Bajaj family.", "genres": ["Comedy", "Family", "Romance"], "title": "Andaz Apna Apna trailer", "url": "https://www.youtube.com/embed/sW_HComeQpc", "pic": "", "year": 1994, "id": "0109117"}, {"plot": "30 years after the defeat of Darth Vader and the Empire, Rey, a scavenger from the planet Jakku, finds a BB-8 droid that knows the whereabouts of the long lost Luke Skywalker. Rey, as well as a rogue stormtrooper and two smugglers, are thrown into the middle of a battle between the Resistance and the daunting legions of the First Order.", "genres": ["Action", "Adventure", "Fantasy", "Sci-Fi"], "title": "Star Wars: The Force Awakens trailer", "url": "https://www.youtube.com/embed/sGbxmsDFVnE", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTPHO7Mkz1AbIlmcCaLJ5_Rk8LisIAoXqNKwWC08Kn2ede2eTJNIGSjHSOJ", "year": 2015, "id": "2488496"}, {"plot": "Rome, 1957. A woman, Cabiria, is robbed and left to drown by her boyfriend, Giorgio. Rescued, she resumes her life and tries her best to find happiness in a cynical world. Even when she thinks her struggles are over and she has found happiness and contentment, things may not be what they seem.", "genres": ["Drama"], "title": "The Nights of Cabiria trailer", "url": "https://www.youtube.com/embed/HHSw7jxYCOk", "pic": "", "year": 1957, "id": "0050783"}, {"plot": "Huge advancements in scientific technology have enabled a mogul to create an island full of living dinosaurs. John Hammond has invited four individuals, along with his two grandchildren, to join him at Jurassic Park. But will everything go according to plan? A park employee attempts to steal dinosaur embryos, critical security systems are shut down and it now becomes a race for survival with dinosaurs roaming freely over the island.", "genres": ["Adventure", "Sci-Fi", "Thriller"], "title": "Jurassic Park trailer", "url": "https://www.youtube.com/embed/p1FevaLUbTg", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSqq8bBpaPqB6l1RGLKkwUpZOloPalf97_EC4cL941VjdRKQcsLsibcQ2__", "year": 1993, "id": "0107290"}, {"plot": "In 1986, in the province of Gyunggi, in South Korea, a second young and beautiful woman is found dead, raped and tied and gagged with her underwear. Detective Park Doo-Man and Detective Cho Yong-koo, two brutal and stupid local detectives without any technique, investigate the murder using brutality and torturing the suspects, without any practical result. The Detective Seo Tae-Yoon from Seoul comes to the country to help the investigations and is convinced that a serial-killer is killing the women. When a third woman is found dead in the same \"modus-operandi\", the detectives find leads of the assassin.", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Memories of Murder trailer", "url": "https://www.youtube.com/embed/pLEFn55bpR0", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSLeppx7uhokRsmuTgdZCyeqJJ_UMo14FFUON48aWzCG2Hg9X8A8WXvc68", "year": 2003, "id": "0353969"}, {"plot": "In Bedridge, Professor Parker Wilson finds an abandoned dog at the train station and takes it home with the intention of returning the animal to its owner. He finds that the dog is an Akita and names it Hachiko. However, nobody claims the dog so his family decides to keep Hachi.", "genres": ["Drama", "Family"], "title": "Hachi: A Dog's Tale trailer", "url": "https://www.youtube.com/embed/TIl2o1hm1F4", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQmV737VFFzzUKE6OKeI9qUSmhY0Cp7M-NwylIrWEGifa1YFspimsKyYq0", "year": 2009, "id": "1028532"}, {"plot": "An animated fantasy-adventure. Set 1,000 years from now, the earth is ravaged by pollution and war. In the Valley of the Wind lives Nausicaa, princess of her people. Their land borders on a toxic jungle, filled with dangerous over-sized insects. Meanwhile two nearby nations are bitterly engaged in a war and the Valley of the Wind is stuck in the middle...", "genres": ["Animation", "Adventure", "Fantasy", "Sci-Fi"], "title": "Nausicaä of the Valley of the Wind trailer", "url": "https://www.youtube.com/embed/7wSba9hwCaU", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSbkazRCczVyZFjJi6wmO54-Ax0kSOFpmaEZxIi6LggDR5U--k5JQ1pVxcN", "year": 1984, "id": "0087544"}, {"plot": "American tourist Jesse and French student Celine meet by chance on the train from Budapest to Vienna. Sensing that they are developing a connection, Jesse asks Celine to spend the day with him in Vienna, and she agrees. So they pass the time before his scheduled flight the next morning together. How do two perfect strangers connect so intimately over the course of a single day? What is that special thing that bonds two people so strongly? As their bond turns to love, what will happen to them the next morning when Jesse flies away?", "genres": ["Drama", "Romance"], "title": "Before Sunrise trailer", "url": "https://www.youtube.com/embed/9v6X-Dytlko", "pic": "", "year": 1995, "id": "0112471"}, {"plot": "Mexican Narcotics officer Ramon Miguel 'Mike' Vargas has to interrupt his honeymoon on the Mexican-US border when an American building contractor is killed after someone places a bomb in his car. He's killed on the US side of the border but it's clear that the bomb was planted on the Mexican side. As a result, Vargas delays his return to Mexico City where he has been mounting a case against the Grandi family crime and narcotics syndicate. Police Captain Hank Quinlan is in charge on the US side and he soon has a suspect, a Mexican named Manolo Sanchez. Vargas is soon onto Quinlan and his Sergeant, Pete Menzies, when he catches them planting evidence to convict Sanchez. With his new American wife, Susie, safely tucked away in a hotel on the US side of the border - or so he thinks - he starts to review Quinlan's earlier cases. While concentrating on the corrupt policeman however, the Grandis have their own plans for Vargas and they start with his wife Susie.", "genres": ["Crime", "Drama", "Film-Noir", "Thriller"], "title": "Touch of Evil trailer", "url": "https://www.youtube.com/embed/dx125s0t6Gk", "pic": "", "year": 1958, "id": "0052311"}, {"plot": "Rocky Balboa is a struggling boxer trying to make the big time, working as a debt collector for a pittance. When heavyweight champion Apollo Creed visits Philadelphia, his managers want to set up an exhibition match between Creed and a struggling boxer, touting the fight as a chance for a \"nobody\" to become a \"somebody\". The match is supposed to be easily won by Creed, but someone forgot to tell Rocky, who sees this as his only shot at the big time.", "genres": ["Drama", "Sport"], "title": "Rocky trailer", "url": "https://www.youtube.com/embed/3VUblDwa648", "pic": "", "year": 1976, "id": "0075148"}, {"plot": "Harry, Ron, and Hermione continue their quest of finding and destroying the Dark Lord's three remaining Horcruxes, the magical items responsible for his immortality. But as the mystical Deathly Hallows are uncovered, and Voldemort finds out about their mission, the biggest battle begins and life as they know it will never be the same again.", "genres": ["Adventure", "Drama", "Fantasy", "Mystery"], "title": "Harry Potter and the Deathly Hallows: Part 2 trailer", "url": "https://www.youtube.com/embed/I_kDb-pRCds", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcR5j4InkCpk7JwU-A99qU0HRzbC66zSjjyXpfVcxLWlgJhkDTBEKghtaHff", "year": 2011, "id": "1201607"}, {"plot": "The wife and mistress of a sadistic boarding school headmaster plot to kill him. They drown him in the bathtub and dump the body in the school's filthy swimming pool... but when the pool is drained, the body has disappeared - and subsequent reported sightings of the headmaster slowly drive his 'killers' (and the audience) up the wall with almost unbearable suspense...", "genres": ["Crime", "Drama", "Horror", "Mystery", "Thriller"], "title": "Diabolique trailer", "url": "https://www.youtube.com/embed/w6nYruzj__8", "pic": "", "year": 1955, "id": "0046911"}, {"plot": "Bourne is once again brought out of hiding, this time inadvertently by London-based reporter Simon Ross who is trying to unveil Operation Blackbriar--an upgrade to Project Treadstone--in a series of newspaper columns. Bourne sets up a meeting with Ross and realizes instantly they're being scanned. Information from the reporter stirs a new set of memories, and Bourne must finally, ultimately, uncover his dark past whilst dodging The Company's best efforts in trying to eradicate him.", "genres": ["Action", "Mystery", "Thriller"], "title": "The Bourne Ultimatum trailer", "url": "https://www.youtube.com/embed/JJoVljaZP0k", "pic": "", "year": 2007, "id": "0440963"}, {"plot": "How far would you go to protect your family? Keller Dover is facing every parent's worst nightmare. His six-year-old daughter, Anna, is missing, together with her young friend, Joy, and as minutes turn to hours, panic sets in. The only lead is a dilapidated RV that had earlier been parked on their street. Heading the investigation, Detective Loki arrests its driver, Alex Jones, but a lack of evidence forces his release. As the police pursue multiple leads and pressure mounts, knowing his child's life is at stake the frantic Dover decides he has no choice but to take matters into his own hands. But just how far will this desperate father go to protect his family?", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Prisoners trailer", "url": "https://www.youtube.com/embed/t219JF1K57s", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTtzfS3M_-8tTi_E_xZhaeV2Y54MViWkrXLBN_mHIppUUxxaNt4Ly_33aUN", "year": 2013, "id": "1392214"}, {"plot": "New Rochelle, the 1960s. High schooler Frank Abagnale Jr. idolizes his father, who's in trouble with the IRS. When his parents separate, Frank runs away to Manhattan with $25 in his checking account, vowing to regain dad's losses and get his parents back together. Just a few years later, the FBI tracks him down in France; he's extradited, tried, and jailed for passing more than $4,000,000 in bad checks. Along the way, he's posed as a Pan Am pilot, a pediatrician, and an attorney. And, from nearly the beginning of this life of crime, he's been pursued by a dour FBI agent, Carl Hanratty. What starts as cat and mouse becomes something akin to father and son.", "genres": ["Biography", "Crime", "Drama"], "title": "Catch Me If You Can trailer", "url": "", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRU3cX8qi_CVkJ068usPZF1nmPxGr58CJ68dnqqImNvDrlNFn8N_5AVcYs", "year": 2002, "id": "0264464"}, {"plot": "Guido is a film director, trying to relax after his last big hit. He can't get a moment's peace, however, with the people who have worked with him in the past constantly looking for more work. He wrestles with his conscience, but is unable to come up with a new idea. While thinking, he starts to recall major happenings in his life, and all the women he has loved and left. An autobiographical film of Fellini, about the trials and tribulations of film making.", "genres": ["Drama", "Fantasy"], "title": "8½ trailer", "url": "https://www.youtube.com/embed/sBzbVFInMs8", "pic": "", "year": 1963, "id": "0056801"}, {"plot": "In this charming film based on the popular L. Frank Baum stories, Dorothy and her dog Toto are caught in a tornado's path and somehow end up in the land of Oz. Here she meets some memorable friends and foes in her journey to meet the Wizard of Oz who everyone says can help her return home and possibly grant her new friends their goals of a brain, heart and courage.", "genres": ["Adventure", "Family", "Fantasy", "Musical"], "title": "The Wizard of Oz trailer", "url": "https://www.youtube.com/embed/KkiGySEBCHY", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTvIblmCdMXqdt2pcfcErHIzDCh6gX-aad9Kw2DXvnQb8VuAS37GoTq2wQ", "year": 1939, "id": "0032138"}, {"plot": "A weather man is reluctantly sent to cover a story about a weather forecasting \"rat\" (as he calls it). This is his fourth year on the story, and he makes no effort to hide his frustration. On awaking the 'following' day he discovers that it's Groundhog Day again, and again, and again. First he uses this to his advantage, then comes the realisation that he is doomed to spend the rest of eternity in the same place, seeing the same people do the same thing EVERY day.", "genres": ["Comedy", "Fantasy", "Romance"], "title": "Groundhog Day trailer", "url": "https://www.youtube.com/embed/wE8nNUASSCo", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcT1gEjchygaLZUCssUYy8AXjEw-p_tdki9nmUpqIkDWoGOHE7Q7vOmb-CE", "year": 1993, "id": "0107048"}, {"plot": "Follows the journey of a time traveler from the post-apocalyptic future who appears in present day on a mission to locate and eradicate the source of a deadly plague that will nearly destroy the human race.", "genres": ["Adventure", "Drama", "Mystery", "Sci-Fi", "Thriller"], "title": "12 Monkeys trailer", "url": "https://www.youtube.com/embed/-XKv0NsYEb8", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQL2GF0u3gm1A0Rwv08DRa8e_D_VLozjjiTdpY9y3PO9o_X2UGnkIsoo9ow", "year": 2015, "id": "3148266"}, {"plot": "Vijay Salgaonkar runs a cable TV network in a remote and hilly village of Goa. He lives a happy life with his wife Nandini and two daughters. A 4th grade dropout & an orphan, Vijay has worked his way towards success with his sheer hard-work & street smartness in order to provide for his family who mean the world to him. A man of few means & needs; Vijay believes life is to be lived simplistically - his wife, while she loves him devoutly, wants Vijay's thrifty & miserly behavior to end and wants the world for her family. If there's one thing that Vijay cannot live without, it is his passion for watching films. Such is his 'filmy' obsession that he doesn't mind staying up all night at his office binging on TV movies! In a bizarre turn of events; a teenage boy goes missing; he is the son of a headstrong & no-nonsense cop; IG Meera Deshmukh and the Salgaonkar family is the prime suspect! Will a humble & middle class man, be able to protect his family from oppression of the powerful? How the family weathers the storm that ensues during the violent investigation forms the rest of the story leading to an unexpected & shocking climax.", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Drishyam trailer", "url": "https://www.youtube.com/embed/9kNOn1fLj00", "pic": "", "year": 2015, "id": "4430212"}, {"plot": "In the Eighteenth Century, in a small village in Ireland, Redmond Barry is a young farm boy in love with his cousin Nora Brady. When Nora gets engaged to the British Captain John Quin, Barry challenges him to a duel of pistols. He wins and escapes to Dublin but is robbed on the road. Without an alternative, Barry joins the British Army to fight in the Seven Years War. He deserts and is forced to join the Prussian Army where he saves the life of his captain and becomes his protégé and spy of the Irish gambler Chevalier de Balibari. He helps Chevalier and becomes his associate until he decides to marry the wealthy Lady Lyndon. They move to England and Barry, in his obsession of nobility, dissipates her fortune and makes a dangerous and revengeful enemy.", "genres": ["Adventure", "Drama", "History", "War"], "title": "Barry Lyndon trailer", "url": "https://www.youtube.com/embed/9lzSoKOs1fc", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTbT3rd1agdvXdz_nbTdwIcYTcO3nrs4l2sccfn6Znz5nSicryc_HAcj7g", "year": 1975, "id": "0072684"}, {"plot": "Chan Wing Yan, a young police officer, has been sent undercover as a mole in the local mafia. Lau Kin Ming, a young mafia member, infiltrates the police force. Years later, their older counterparts, Chen Wing Yan and Inspector Lau Kin Ming, respectively, race against time to expose the mole within their midst.", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Infernal Affairs trailer", "url": "https://www.youtube.com/embed/S4R3nHkqyfM", "pic": "", "year": 2002, "id": "0338564"}, {"plot": "The story concentrates on the social re-adjustment of three World War II servicemen, each from a different station of society. Al Stephenson returns to an influential banking position, but finds it hard to reconcile his loyalties to ex-servicemen with new commercial realities. Fred Derry is an ordinary working man who finds it difficult to hold down a job or pick up the threads of his marriage. Having had both hands burnt off during the war, Homer Parrish is unsure that his fiancée's feelings are still those of love and not those of pity. Each of the veterans faces a crisis upon his arrival, and each crisis is a microcosm of the experiences of many American warriors who found an alien world awaiting them when they came marching home.", "genres": ["Drama", "Romance", "War"], "title": "The Best Years of Our Lives trailer", "url": "https://www.youtube.com/embed/1yc5PugV4mk", "pic": "", "year": 1946, "id": "0036868"}, {"plot": "From the largest elephant to the smallest shrew, the city of Zootopia is a mammal metropolis where various animals live and thrive. When Judy Hopps becomes the first rabbit to join the police force, she quickly learns how tough it is to enforce the law. Determined to prove herself, Judy jumps at the opportunity to solve a mysterious case. Unfortunately, that means working with Nick Wilde, a wily fox who makes her job even harder.", "genres": ["Animation", "Adventure", "Comedy", "Crime", "Family", "Mystery"], "title": "Zootopia trailer", "url": "https://www.youtube.com/embed/prct6AB5tR8", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSUkO7BfkwJEUsub4jy_mkNDvhDiKSmjrj-Xk9Ibo-eRaXbgq10dgmuQ4sX", "year": 2016, "id": "2948356"}, {"plot": "Based upon a real-life story that happened in the early seventies in which the Chase Manhattan Bank in Gravesend, Brooklyn, was held siege by a gay bank robber determined to steal enough money for his male lover to undergo a sex change operation. On a hot summer afternoon, the First Savings Bank of Brooklyn is held up by Sonny and Sal, two down-and-out characters. Although the bank manager and female tellers agree not to interfere with the robbery, Sonny finds that there's actually nothing much to steal, as most of the cash has been picked up for the day. Sonny then gets an unexpected phone call from Police Captain Moretti, who tells him the place is surrounded by the city's entire police force. Having few options under the circumstances, Sonny nervously bargains with Moretti, demanding safe escort to the airport and a plane out of the country in return for the bank employees' safety.", "genres": ["Biography", "Crime", "Drama", "Thriller"], "title": "Dog Day Afternoon trailer", "url": "https://www.youtube.com/embed/TPwBfZHozQ8", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQY2MtY8ZCQNnBewQ5rpfTS9qP-PejpcHR0fZHa1eZdBpVUzLPm6uxuSLk", "year": 1975, "id": "0072890"}, {"plot": "Set in Mississippi during the 1960s, Skeeter (Stone) is a southern society girl who returns from college determined to become a writer, but turns her friends' lives -- and a Mississippi town -- upside down when she decides to interview the black women who have spent their lives taking care of prominent southern families. Aibileen (Davis), Skeeter's best friend's housekeeper, is the first to open up -- to the dismay of her friends in the tight-knit black community. Despite Skeeter's life-long friendships hanging in the balance, she and Aibileen continue their collaboration and soon more women come forward to tell their stories -- and as it turns out, they have a lot to say. Along the way, unlikely friendships are forged and a new sisterhood emerges, but not before everyone in town has a thing or two to say themselves when they become unwittingly -- and unwillingly -- caught up in the changing times.", "genres": ["Drama"], "title": "The Help trailer", "url": "https://www.youtube.com/embed/J_ajv_6pUnI", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQcd3vKbyLKE3hx-IbFqF03yJTmEg59LzCnIbULhs6vnK2oTvtae3Zts7wZ", "year": 2011, "id": "1454029"}, {"plot": "Bruno Anthony thinks he has the perfect plot to rid himself of his hated father and when he meets tennis player Guy Haines on a train, he thinks he's found the partner he needs to pull it off. His plan is relatively simple. Two strangers each agree to kill someone the other person wants disposed of. For example, Guy could kill his father and he could get rid of Guy's wife Miriam, freeing him to marry Anne Morton, the beautiful daughter of a U.S. Senator. Guy dismisses it all out of hand but Bruno goes ahead with his half of the 'bargain' and disposes of Miriam. When Guy balks, Bruno makes it quite clear that he will plant evidence to implicate Guy in her murder if he doesn't get rid of his father. Guy had also made some unfortunate statements about Miriam after she had refused him a divorce. It all leads the police to believe Guy is responsible for the murder, forcing him to deal with Bruno's mad ravings.", "genres": ["Crime", "Film-Noir", "Thriller"], "title": "Strangers on a Train trailer", "url": "https://www.youtube.com/embed/nfW7zD924j8", "pic": "", "year": 1951, "id": "0044079"}, {"plot": "This swash-buckling tale follows the quest of Captain Jack Sparrow, a savvy pirate, and Will Turner, a resourceful blacksmith, as they search for Elizabeth Swann. Elizabeth, the daughter of the governor and the love of Will's life, has been kidnapped by the feared Captain Barbossa. Little do they know, but the fierce and clever Barbossa has been cursed. He, along with his large crew, are under an ancient curse, doomed for eternity to neither live, nor die. That is, unless a blood sacrifice is made.", "genres": ["Action", "Adventure", "Fantasy"], "title": "Pirates of the Caribbean: The Curse of the Black Pearl trailer", "url": "https://www.youtube.com/embed/eQkAXLIMNQM", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRdZ0neYQCgpmq1-B2-eiBdleAD4eM-0z1jyExu4ifm80deQbIYV610VfA", "year": 2003, "id": "0325980"}, {"plot": "Four tales of crime adapted from Frank Miller's popular comics, focusing around a muscular brute who's looking for the person responsible for the death of his beloved Goldie, a man fed up with Sin City's corrupt law enforcement who takes the law into his own hands after a horrible mistake, a cop who risks his life to protect a girl from a deformed pedophile, and a hitman looking to make a little cash.", "genres": ["Crime", "Thriller"], "title": "Sin City trailer", "url": "https://www.youtube.com/embed/T2Dj6ktPU5c", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSLeppx7uhokRsmuTgdZCyeqJJ_UMo14FFUON48aWzCG2Hg9X8A8WXvc68", "year": 2005, "id": "0401792"}]


The Good, the Bad and the Ugly
Fight Club
The Lord of the Rings: The Fellowship of the Ring
Star Wars: Episode V - The Empire Strikes Back
Forrest Gump
Inception
The Lord of the Rings: The Two Towers
One Flew Over the Cuckoo's Nest
Goodfellas
The Matrix
Seven Samurai
Star Wars: Episode IV - A New Hope
City of God
Se7en
The Silence of the Lambs
It's a Wonderful Life
The Usual Suspects
Life Is Beautiful
Lon: The Professional
Spirited Away
Saving Private Ryan
Once Upon a Time in the West
American History X
Interstellar
Casablanca
City Lights
Psycho
The Green Mile
The Intouchables
Modern Times
Raiders of the Lost Ark
Rear Window
The Pianist
The Departed
Terminator 2: Judgment Day
Back to the Future
Whiplash
Gladiator
Memento
Logan
Apocalypse Now
The Prestige
The Lion King
Alien
Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb
Sunset Boulevard
The Great Dictator
Cinema Paradiso
The Lives of Others
Grave of the Fireflies
Paths of Glory
Django Unchained
The Shining
WALLE
American Beauty
The Dark Knight Rises
Princess Mononoke
Aliens
Oldboy
La La Land
Era Uma Vez na Amrica
Witness for the Prosecution
Das Boot
Citizen Kane
North by Northwest
Vertigo
Star Wars: Episode VI - Return of the Jedi
Reservoir Dogs
Braveheart
M
Requiem for a Dream
Amlie
A Clockwork Orange
Como Estrelas na Terra
Taxi Driver
Lawrence of Arabia
Double Indemnity
Eternal Sunshine of the Spotless Mind
To Kill a Mockingbird
Amadeus
Toy Story 3
Full Metal Jacket
Dangal
The Sting
2001: A Space Odyssey
Singin' in the Rain
Toy Story
Bicycle Thieves
Meu Pai e Meu Filho
The Kid
Inglourious Basterds
Snatch
Monty Python and the Holy Grail
3 Idiotas
L.A. Confidential
For a Few Dollars More
Scarface
The Hunt
The Apartment
Good Will Hunting
Rashomon
A Separation
Indiana Jones and the Last Crusade
Metrpolis
All About Eve
Yojimbo
Batman Begins
Up
Some Like It Hot
The Treasure of the Sierra Madre
Unforgiven
Downfall
Raging Bull
Die Hard
The Third Man
Children of Heaven
Heat
The Great Escape
Chinatown
Andrei Rublev
Pan's Labyrinth
Ikiru
Inside Out
My Neighbor Totoro
Ran
On the Waterfront
O Quarto de Jack
The Gold Rush
The Secret in Their Eyes
The Bridge on the River Kwai
Blade Runner
Howl's Moving Castle
Mr. Smith Goes to Washington
The Seventh Seal
Lock, Stock and Two Smoking Barrels
Judgment at Nuremberg
Incendies
Cassino
At o ltimo Homem
A Beautiful Mind
The Elephant Man
Wild Strawberries
The Bandit
V for Vendetta
The General
The Wolf of Wall Street
Warrior
Sunrise
A Wednesday
Trainspotting
Gran Torino
Dial M for Murder
The Big Lebowski
Pinte de Aafro
The Deer Hunter
The Passion of Joan of Arc
Fargo
Gone with the Wind
Tokyo Story
Finding Nemo
The Sixth Sense
The Thing
No Country for Old Men
Cool Hand Luke
Rebecca
How to Train Your Dragon
Kill Bill: Vol. 1
There Will Be Blood
Into the Wild
Mary e Max: Uma Amizade Diferente
Gone Girl
Come and See
Life of Brian
It Happened One Night
Munna Bhai M.B.B.S.
Shutter Island
Platoon
Hotel Rwanda
Rush
Network
Sholay
Relatos Selvagens
Hera Pheri
The Wages of Fear
Stand by Me
Em Nome do Pai
Spotlight
The 400 Blows
Mad Max: Fury Road
12 Years a Slave
Butch Cassidy and the Sundance Kid
The Grand Budapest Hotel
Ben-Hur
Persona
Million Dollar Baby
The Maltese Falcon
Andaz Apna Apna
Star Wars: The Force Awakens
Amores Perros
The Nights of Cabiria
Jurassic Park
The Princess Bride
Memories of Murder
Hachi: A Dog's Tale
Stalker
Nausica of the Valley of the Wind
The Truman Show
Before Sunrise
The Grapes of Wrath
Touch of Evil
Annie Hall
Rocky
Harry Potter and the Deathly Hallows: Part 2
Gandhi
Diabolique
Donnie Darko
The Bourne Ultimatum
Prisoners
Monsters, Inc.
Catch Me If You Can
The Terminator
8
The Wizard of Oz
Groundhog Day
Twelve Monkeys
La Haine
Drishyam
Barry Lyndon
Jaws
Infernal Affairs
The Message
The Best Years of Our Lives
Zootopia
The Battle of Algiers
Dog Day Afternoon
The Help
Gangs of Wasseypur
Strangers on a Train
Pirates of the Caribbean: The Curse of the Black Pearl
A Cano do Oceano
Sin City
Lagaan: Era uma Vez na ndia
