[{"plot": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red.", "genres": ["Crime", "Drama"], "title": "The Shawshank Redemption trailer", "url": "https://www.youtube.com/embed/NmzuHjWmXOc", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcR2tzHWPIm5r_QXJOaGIiN_D4cvUCE-Z5twUn37ypVwxczY09I16AEdG94", "year": 1994, "id": "0111161"}, {"plot": "When the aging head of a famous crime family decides to transfer his position to one of his subalterns, a series of unfortunate events start happening to the family, and a war begins between all the well-known families leading to insolence, deportation, murder and revenge, and ends with the favorable successor being finally chosen.", "genres": ["Crime", "Drama"], "title": "The Godfather trailer", "url": "https://www.youtube.com/embed/w0VGcWHkNeA", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTPsOlNHH9IE4AnORXqEwktoMRyfQwqi24N2grlPsnqYkeRnr2ojTpi-7o", "year": 1972, "id": "0068646"}, {"plot": "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba.", "genres": ["Crime", "Drama"], "title": "The Godfather: Part II trailer", "url": "https://www.youtube.com/embed/8PyZCU2vpi8", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTiv8NFcjU80MKE_G_chFtD1JGvxSLvLcShyUwNnI75mNs7d4PTYUH7uPYc", "year": 1974, "id": "0071562"}, {"plot": "Set within a year after the events of Batman Begins, Batman, Lieutenant James Gordon, and new district attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City until a mysterious and sadistic criminal mastermind known only as the Joker appears in Gotham, creating a new wave of chaos. Batman's struggle against the Joker becomes deeply personal, forcing him to \"confront everything he believes\" and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent and Rachel Dawes.", "genres": ["Action", "Crime", "Drama", "Thriller"], "title": "The Dark Knight trailer", "url": "https://www.youtube.com/embed/EXeTwQWrcwY", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQki37E38RH-VoT1m0HEBYAIfo8DZVv8r8iY1X3nP1eAcljxzhVZasVImo", "year": 2008, "id": "0468569"}, {"plot": "The defense and the prosecution have rested and the jury is filing into the jury room to decide if a young man is guilty or innocent of murdering his father. What begins as an open-and-shut case of murder soon becomes a detective story that presents a succession of clues creating doubt, and a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, and each other. Based on the play, all of the action takes place on the stage of the jury room.", "genres": ["Crime", "Drama"], "title": "12 Angry Men trailer", "url": "https://www.youtube.com/embed/fSG38tk6TpI", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcR-a-fWlaD3xwjsvKnHCq5NWb-gL0OnIxjFbrFHbeySdPWfG1nZS1Fs4A", "year": 1957, "id": "0050083"}, {"plot": "Oskar Schindler is a vainglorious and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us.", "genres": ["Biography", "Drama", "History"], "title": "Schindler's List trailer", "url": "https://www.youtube.com/embed/M5FpB6qDGAE", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRRm6M6zj35c8zAbbW1IMXUGWTFWoonRLN2tsXdU_YVpR_ngHXcUvNILdCP", "year": 1993, "id": "0108052"}, {"plot": "Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) are two hit men who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace (Ving Rhames). Wallace has also asked Vincent to take his wife Mia (Uma Thurman) out a few days later when Wallace himself will be out of town. Butch Coolidge (Bruce Willis) is an aging boxer who is paid by Wallace to lose his fight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents.", "genres": ["Crime", "Drama"], "title": "Pulp Fiction trailer", "url": "https://www.youtube.com/embed/ewlwcEBTvcg", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSJvjP11Q3LOZKq52radPZ6M1uc8S4PvRJWG2ipZ57x-pEC5Jm_Q8iJbaU", "year": 1994, "id": "0110912"}, {"plot": "The final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Hobbits Frodo and Sam reach Mordor in their quest to destroy the \"one ring\", while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith.", "genres": ["Adventure", "Drama", "Fantasy"], "title": "The Lord of the Rings: The Return of the King trailer", "url": "https://www.youtube.com/embed/y2rYRu8UW8M", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQy7kUjSEQfKdQKoQsq--OWt8cL1R_7vKDuls8rEQ_TrOpfs1sPHn2we58N", "year": 2003, "id": "0167260"}, {"plot": "Blondie (The Good) is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes (The Bad) is a hit man who always commits to a task and sees it through, as long as he is paid to do so. And Tuco (The Ugly) is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership together making money off Tuco's bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco come across a horse carriage loaded with dead bodies, they soon learn from the only survivor (Bill Carson) that he and a few other men have buried a stash of gold in a cemetery. Unfortunately Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie met with Carson and knows they know the location of the gold. All he needs is for the two to lead him to it. Now The Good, The Bad and The Ugly must all battle it out to get their hands on $200,000 worth of gold.", "genres": ["Western"], "title": "The Good, the Bad and the Ugly trailer", "url": "https://www.youtube.com/embed/WCN5JJY_wiA", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSZNjsA2AhfqFb5mXTkotZITekybz_d0eUbAFDaFoOq4S2Q4i1TTGQVyys", "year": 1966, "id": "0060196"}, {"plot": "A nameless first person narrator (Edward Norton) attends support groups in attempt to subdue his emotional state and relieve his insomniac state. When he meets Marla (Helena Bonham Carter), another fake attendee of support groups, his life seems to become a little more bearable. However when he associates himself with Tyler (Brad Pitt) he is dragged into an underground fight club and soap making scheme. Together the two men spiral out of control and engage in competitive rivalry for love and power. When the narrator is exposed to the hidden agenda of Tyler's fight club, he must accept the awful truth that Tyler may not be who he says he is.", "genres": ["Drama"], "title": "Fight Club trailer", "url": "https://www.youtube.com/embed/_XgQA9Ab0Gw", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRepODjKATHQZheR-GMKtRn3kT2wvitm-evTG9Km7Smn-v5uAtL0tSdhrU", "year": 1999, "id": "0137523"}, {"plot": "An ancient Ring thought lost for centuries has been found, and through a strange twist in fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it! However he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir and his three Hobbit friends Merry, Pippin and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign!", "genres": ["Adventure", "Drama", "Fantasy"], "title": "The Lord of the Rings: The Fellowship of the Ring trailer", "url": "https://www.youtube.com/embed/V75dMMIW2B4", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcS4m0hl8eGO0SmF46PGkPkY7eg6eE2o3a6PKaZPRnaUYW8mMVaJhQUnNxrj", "year": 2001, "id": "0120737"}, {"plot": "Luke Skywalker, Han Solo, Princess Leia and Chewbacca face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi master's help will Luke survive when the dark side of the Force beckons him into the ultimate duel with Darth Vader.", "genres": ["Action", "Adventure", "Fantasy", "Sci-Fi"], "title": "Star Wars: Episode V - The Empire Strikes Back trailer", "url": "", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcT27kF5GCserfCKoTZ4OQiDT0Ijg1rm8yfCUZRGLWdSmes8r6Yzz4QjfOZD", "year": 1980, "id": "0080684"}, {"plot": "Forrest Gump is a simple man with a low I.Q. but good intentions. He is running through childhood with his best and only friend Jenny. His 'mama' teaches him the ways of life and leaves him to choose his destiny. Forrest joins the army for service in Vietnam, finding new friends called Dan and Bubba, he wins medals, creates a famous shrimp fishing fleet, inspires people to jog, starts a ping-pong craze, creates the smiley, writes bumper stickers and songs, donates to people and meets the president several times. However, this is all irrelevant to Forrest who can only think of his childhood sweetheart Jenny Curran, who has messed up her life. Although in the end all he wants to prove is that anyone can love anyone.", "genres": ["Comedy", "Drama", "Romance"], "title": "Forrest Gump trailer", "url": "https://www.youtube.com/embed/8dcYw4OwCA0", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRAu98Fs4e9kCPOZ32c-JI-7Iw0rHhbZAq7vBGbc74BfLt3aZhSoxM6Kq4", "year": 1994, "id": "0109830"}, {"plot": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible - inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "title": "Inception trailer", "url": "https://www.youtube.com/embed/XKPFWoQAfzM", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRYR-1uK_LSLHqwCZosjkKSWYDcR3QK3D3bRHO2RvDJOrZZaaQbIGXppRk", "year": 2010, "id": "1375666"}, {"plot": "While Frodo and Sam, now accompanied by a new guide, continue their hopeless journey towards the land of shadow to destroy the One Ring, each member of the broken fellowship plays their part in the battle against the evil wizard Saruman and his armies of Isengard.", "genres": ["Adventure", "Drama", "Fantasy"], "title": "The Lord of the Rings: The Two Towers trailer", "url": "https://www.youtube.com/embed/LbfMDwc4azU", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQ-Zzyu0kSRgfVodPxsFKpuU6tWt_ti1EnIuw5Qgc8AXF6MNhhPFVbAw6t4", "year": 2002, "id": "0167261"}, {"plot": "McMurphy has a criminal past and has once again gotten himself into trouble and is sentenced by the court. To escape labor duties in prison, McMurphy pleads insanity and is sent to a ward for the mentally unstable. Once here, McMurphy both endures and stands witness to the abuse and degradation of the oppressive Nurse Ratched, who gains superiority and power through the flaws of the other inmates. McMurphy and the other inmates band together to make a rebellious stance against the atrocious Nurse.", "genres": ["Drama"], "title": "One Flew Over the Cuckoo's Nest trailer", "url": "https://www.youtube.com/embed/NN1cCviBXmY", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcS6apC2RCLA6YJZ0yWB-qR9Am2ySwCXkoZt927rkLgBjkDC6RBvyPdu05E", "year": 1975, "id": "0073486"}, {"plot": "Henry Hill might be a small time gangster, who may have taken part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who might have set their sights a bit higher. His two partners could kill off everyone else involved in the robbery, and slowly start to think about climbing up through the hierarchy of the Mob. Henry, however, might be badly affected by his partners' success, but will he consider stooping low enough to bring about the downfall of Jimmy and Tommy?", "genres": ["Biography", "Crime", "Drama"], "title": "Goodfellas trailer", "url": "https://www.youtube.com/embed/qo5jJpHtI1Y", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcS_ffvp80rZ3sGocIh5Xz0EqkWu_XFvFHYxrB64OrU1BvOYeZ78pCiFISqe", "year": 1990, "id": "0099685"}, {"plot": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellion.", "genres": ["Action", "Sci-Fi"], "title": "The Matrix trailer", "url": "https://www.youtube.com/embed/vKQi3bBA1y8", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcR2D0PoelHcnMz4qzCR39n7BpHj63xUPfiRN7SiO9WOoxdcjPjVK6R7iKlY", "year": 1999, "id": "0133093"}, {"plot": "A veteran samurai, who has fallen on hard times, answers a village's request for protection from bandits. He gathers 6 other samurai to help him, and they teach the townspeople how to defend themselves, and they supply the samurai with three small meals a day. The film culminates in a giant battle when 40 bandits attack the village.", "genres": ["Adventure", "Drama"], "title": "Seven Samurai trailer", "url": "https://www.youtube.com/embed/bBfgNpSQm3I", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRwlb-jqP5-7QRLJttbEnRsUq-eoT1T426YDVpJJc4CIIwrEHcMpmcfU98", "year": 1954, "id": "0047478"}, {"plot": "The Imperial Forces, under orders from cruel Darth Vader, hold Princess Leia hostage in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker and Han Solo, captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 and C-3PO to rescue the beautiful princess, help the Rebel Alliance and restore freedom and justice to the Galaxy.", "genres": ["Action", "Adventure", "Fantasy", "Sci-Fi"], "title": "Star Wars: Episode IV - A New Hope trailer", "url": "https://www.youtube.com/embed/9gvqpFbRKtQ", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTSLlioQ6LxfoWOXd4mfjUwbIa2AjUpnPbM0mOUByBh5Mxn7ZVQAKyrmQ", "year": 1977, "id": "0076759"}, {"plot": "Brazil, 1960s, City of God. The Tender Trio robs motels and gas trucks. Younger kids watch and learn well...too well. 1970s: Li'l Zé has prospered very well and owns the city. He causes violence and fear as he wipes out rival gangs without mercy. His best friend Bené is the only one to keep him on the good side of sanity. Rocket has watched these two gain power for years, and he wants no part of it. Yet he keeps getting swept up in the madness. All he wants to do is take pictures. 1980s: Things are out of control between the last two remaining gangs...will it ever end? Welcome to the City of God.", "genres": ["Crime", "Drama"], "title": "City of God trailer", "url": "https://www.youtube.com/embed/15ZRgKm_GAc", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQaR9uF1uwNIwGiDYFgqDWeS_O2_rLzt7lPovord7eX61RpSut5A8BQNpg", "year": 2002, "id": "0317248"}, {"plot": "A film about two homicide detectives' (Morgan Freeman and (Brad Pitt desperate hunt for a serial killer who justifies his crimes as absolution for the world's ignorance of the Seven Deadly Sins. The movie takes us from the tortured remains of one victim to the next as the sociopathic \"John Doe\" (Kevin Spacey) sermonizes to Detectives Somerset and Mills -- one sin at a time. The sin of Gluttony comes first and the murderer's terrible capacity is graphically demonstrated in the dark and subdued tones characteristic of film noir. The seasoned and cultured but jaded Somerset researches the Seven Deadly Sins in an effort to understand the killer's modus operandi while the bright but green and impulsive Detective Mills (Pitt) scoffs at his efforts to get inside the mind of a killer...", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Se7en trailer", "url": "https://www.youtube.com/embed/J4YV2_TcCoE", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSgrcIOX0fBEiIIwYXhURjdLCl3PL1fmp_ageYpBgtXTfL5RM1GvvO93w", "year": 1995, "id": "0114369"}, {"plot": "FBI trainee Clarice Starling works hard to advance her career, including trying to hide or put behind her West Virginia roots, of which if some knew would automatically classify her as being backward or white trash. After graduation, she aspires to work in the agency's Behavioral Science Unit under the leadership of Jack Crawford. While she is still a trainee, Crawford does ask her to question Dr. Hannibal Lecter, a psychiatrist imprisoned thus far for eight years in maximum security isolation for being a serial killer, he who cannibalized his victims. Clarice is able to figure out the assignment is to pick Lecter's brains to help them solve another serial murder case, that of someone coined by the media as Buffalo Bill who has so far killed five victims, all located in the eastern US, all young women who are slightly overweight especially around the hips, all who were drowned in natural bodies of water, and all who were stripped of large swaths of skin. She also figures that Crawford chose her as a woman to be able to trigger some emotional response from Lecter. After speaking to Lecter for the first time, she realizes that everything with him will be a psychological game with her having often to read between the very cryptic lines he provides. She has to decide how much she will play along as his request in return for talking to him is to expose herself emotionally to him. The case takes more dire turns when a sixth victim is discovered, this one from who they are able to retrieve a key piece of evidence if Lecter is being forthright as to its meaning. A potential seventh victim is high profile Catherine Martin, the daughter of Senator Ruth Martin, which places greater scrutiny on the case as they search for a hopefully still alive Catherine. Who may factor into what happens is Dr. Frederick Chilton, the warden at the prison, he an opportunist who sees the higher profile with Catherine, meaning a higher profile for himself if he can insert himself successfully into the proceedings.", "genres": ["Crime", "Drama", "Thriller"], "title": "The Silence of the Lambs trailer", "url": "https://www.youtube.com/embed/lQKs169Sl0I", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRvx8UWIYit8wSC4y3TdofSIaiKAVGSzQk7w8kpUz6174HwNzlPf9J8lf3l", "year": 1991, "id": "0102926"}, {"plot": "George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Potter finds the misplaced money and hides it from Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Potter to take over the town. Thinking of his wife, their young children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in a gentle angel named Clarence coming to earth to help George, with the promise of earning his wings. He shows George what things would have been like if he had never been born. In a nightmarish vision in which the Potter-controlled town is sunk in sex and sin, those George loves are either dead, ruined, or miserable. He realizes that he has touched many people in a positive way and that his life has truly been a wonderful one.", "genres": ["Drama", "Family", "Fantasy"], "title": "It's a Wonderful Life trailer", "url": "https://www.youtube.com/embed/upnZeHhDMZE", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSVnsKWEY6IErGTnhARX8UKTOjScok7GTzWZg_e7gOqIQfMgEtU0qDlSA", "year": 1946, "id": "0038650"}, {"plot": "Following a truck hijack in New York, five conmen are arrested and brought together for questioning. As none of them are guilty, they plan a revenge operation against the police. The operation goes well, but then the influence of a legendary mastermind criminal called Keyser Söze is felt. It becomes clear that each one of them has wronged Söze at some point and must pay back now. The payback job leaves 27 men dead in a boat explosion, but the real question arises now: Who actually is Keyser Söze?", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "The Usual Suspects trailer", "url": "https://www.youtube.com/embed/D4NMO5b1_Ew", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTYEz5WMSG5kUJRh6V28fiX3Zr-SpNd0m7nCaz5O7lATlRf63YwPGyIztSQ", "year": 1995, "id": "0114814"}, {"plot": "In 1930s Italy, a carefree Jewish book keeper named Guido starts a fairy tale life by courting and marrying a lovely woman from a nearby city. Guido and his wife have a son and live happily together until the occupation of Italy by German forces. In an attempt to hold his family together and help his son survive the horrors of a Jewish Concentration Camp, Guido imagines that the Holocaust is a game and that the grand prize for winning is a tank.", "genres": ["Comedy", "Drama", "War"], "title": "Life Is Beautiful trailer", "url": "https://www.youtube.com/embed/4MpZyOdx4cs", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcScfKlQQMQUOWJPqopRmBwRgsHI9YPuElEJ91fWOtr1hwMxqp5JSPyAMgdZ", "year": 1997, "id": "0118799"}, {"plot": "After her father, mother, older sister and little brother are killed by her father's employers, the 12-year-old daughter of an abject drug dealer is forced to take refuge in the apartment of a professional hitman who at her request teaches her the methods of his job so she can take her revenge on the corrupt DEA agent who ruined her life by killing her beloved brother.", "genres": ["Crime", "Drama", "Thriller"], "title": "Léon: The Professional trailer", "url": "https://www.youtube.com/embed/jgTWdbWG7Iw", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcR9h6dmA9NcAakTdU6_5qQKQUfom25hMLQ0zUcwhUFhlYo4fUA3N6yvLWI", "year": 1994, "id": "0110413"}, {"plot": "Chihiro and her parents are moving to a small Japanese town in the countryside, much to Chihiro's dismay. On the way to their new home, Chihiro's father makes a wrong turn and drives down a lonely one-lane road which dead-ends in front of a tunnel. Her parents decide to stop the car and explore the area. They go through the tunnel and find an abandoned amusement park on the other side, with its own little town. When her parents see a restaurant with great-smelling food but no staff, they decide to eat and pay later. However, Chihiro refuses to eat and decides to explore the theme park a bit more. She meets a boy named Haku who tells her that Chihiro and her parents are in danger, and they must leave immediately. She runs to the restaurant and finds that her parents have turned into pigs. In addition, the theme park turns out to be a town inhabited by demons, spirits, and evil gods. At the center of the town is a bathhouse where these creatures go to relax. The owner of the bathhouse is the evil witch Yubaba, who is intent on keeping all trespassers as captive workers, including Chihiro. Chihiro must rely on Haku to save her parents in hopes of returning to their world.", "genres": ["Animation", "Adventure", "Family", "Fantasy", "Mystery"], "title": "Spirited Away trailer", "url": "https://www.youtube.com/embed/ByXuk9QqQkk", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTprKp06MVgYVOd-2cLPSwTkT6Cx-XTXtkM-8kacxtDiwafNq93RRKjd3Q", "year": 2001, "id": "0245429"}, {"plot": "Opening with the Allied invasion of Normandy on 6 June 1944, members of the 2nd Ranger Battalion under Cpt. Miller fight ashore to secure a beachhead. Amidst the fighting, two brothers are killed in action. Earlier in New Guinea, a third brother is KIA. Their mother, Mrs. Ryan, is to receive all three of the grave telegrams on the same day. The United States Army Chief of Staff, George C. Marshall, is given an opportunity to alleviate some of her grief when he learns of a fourth brother, Private James Ryan, and decides to send out 8 men (Cpt. Miller and select members from 2nd Rangers) to find him and bring him back home to his mother...", "genres": ["Drama", "War"], "title": "Saving Private Ryan trailer", "url": "https://www.youtube.com/embed/zwhP5b4tD6g", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSBOovETB1gFM2G2yIeNxJwevThhd9M2niqN98FoH771VGJD9W6i6AEfOU", "year": 1998, "id": "0120815"}, {"plot": "Story of a young woman, Mrs. McBain, who moves from New Orleans to frontier Utah, on the very edge of the American West. She arrives to find her new husband and family slaughtered, but by whom? The prime suspect, coffee-lover Cheyenne, befriends her and offers to go after the real killer, assassin gang leader Frank, in her honor. He is accompanied by Harmonica, a man already on a quest to get even.", "genres": ["Western"], "title": "Once Upon a Time in the West trailer", "url": "https://www.youtube.com/embed/7T1M-HDlEHc", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQekZ4E7kufUFBywBxJKJU_BZC424nlEoszNp_ivI6APaBoZM0Ogc-DPABa", "year": 1968, "id": "0064116"}, {"plot": "Derek Vineyard is paroled after serving 3 years in prison for brutally killing two black men who tried to break into/steal his truck. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did.", "genres": ["Crime", "Drama"], "title": "American History X trailer", "url": "https://www.youtube.com/embed/JsPW6Fj3BUI", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTwyB_bXjKAwsfDaB1hKABr7GLc-1yrOXfj_R3NbS3nkmaisI7TQpXxd30", "year": 1998, "id": "0120586"}, {"plot": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life.", "genres": ["Adventure", "Drama", "Sci-Fi"], "title": "Interstellar trailer", "url": "https://www.youtube.com/embed/3WzHXI5HizQ", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRc2itMW0TcCGBfteFEG5blmfILItLFXAAeNSoqemC1wUv7gsI6BnDnELc", "year": 2014, "id": "0816692"}, {"plot": "In World War II Casablanca, Rick Blaine, exiled American and former freedom fighter, runs the most popular nightspot in town. The cynical lone wolf Blaine comes into the possession of two valuable letters of transit. When Nazi Major Strasser arrives in Casablanca, the sycophantic police Captain Renault does what he can to please him, including detaining a Czechoslovak underground leader Victor Laszlo. Much to Rick's surprise, Lazslo arrives with Ilsa, Rick's one time love. Rick is very bitter towards Ilsa, who ran out on him in Paris, but when he learns she had good reason to, they plan to run off together again using the letters of transit. Well, that was their original plan....", "genres": ["Drama", "Romance", "War"], "title": "Casablanca trailer", "url": "https://www.youtube.com/embed/CBmn7Jo5UtM", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSxlra9E-MXJd2u6mm2GQD05eDu0SZrYBheKGD80yZ3GAtvQSokVD7UrYQ", "year": 1942, "id": "0034583"}, {"plot": "A tramp falls in love with a beautiful blind girl. Her family is in financial trouble. The tramp's on-and-off friendship with a wealthy man allows him to be the girl's benefactor and suitor.", "genres": ["Comedy", "Drama", "Romance"], "title": "City Lights trailer", "url": "https://www.youtube.com/embed/X_W1tOngo-w", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSS5aVTQAIJ-9JY_ysfndZSNZ3jGoBuHGKLJWenVMyYsmXcGenh1u-R3xtN", "year": 1931, "id": "0021749"}, {"plot": "Phoenix officeworker Marion Crane is fed up with the way life has treated her. She has to meet her lover Sam in lunch breaks and they cannot get married because Sam has to give most of his money away in alimony. One Friday Marion is trusted to bank $40,000 by her employer. Seeing the opportunity to take the money and start a new life, Marion leaves town and heads towards Sam's California store. Tired after the long drive and caught in a storm, she gets off the main highway and pulls into The Bates Motel. The motel is managed by a quiet young man called Norman who seems to be dominated by his mother.", "genres": ["Horror", "Mystery", "Thriller"], "title": "Psycho trailer", "url": "https://www.youtube.com/embed/DTJQfFQ40lI", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcREEex5FpWvPm8b6Zh5LXfQYbpOrsvYRQ1H1_sHnG7KPmRQGVaOffxA1ASD", "year": 1960, "id": "0054215"}, {"plot": "Death Row guards at a penitentiary, in the 1930's, have a moral dilemma with their job when they discover one of their prisoners, a convicted murderer, has a special gift.", "genres": ["Crime", "Drama", "Fantasy", "Mystery"], "title": "The Green Mile trailer", "url": "https://www.youtube.com/embed/Ki4haFrqSrw", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRi9wyTH7YCAblkLYwfI83uAWa_6KvOl9a7XkeZsrHNqZmsfZXvYYCOqMjJ", "year": 1999, "id": "0120689"}, {"plot": "In Paris, the aristocratic and intellectual Philippe is a quadriplegic millionaire who is interviewing candidates for the position of his carer, with his red-haired secretary Magalie. Out of the blue, the rude African Driss cuts the line of candidates and brings a document from the Social Security and asks Phillipe to sign it to prove that he is seeking a job position so he can receive his unemployment benefit. Philippe challenges Driss, offering him a trial period of one month to gain experience helping him. Then Driss can decide whether he would like to stay with him or not. Driss accepts the challenge and moves to the mansion, changing the boring life of Phillipe and his employees.", "genres": ["Biography", "Comedy", "Drama"], "title": "The Intouchables trailer", "url": "https://www.youtube.com/embed/0RqDiYnFxTk", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRxHI7nROJDLOuxuOhmU37QHCQJDQG6jtbloa7FFX7hfaAonqKUIYabLxcq", "year": 2011, "id": "1675434"}, {"plot": "Chaplins last 'silent' film, filled with sound effects, was made when everyone else was making talkies. Charlie turns against modern society, the machine age, (The use of sound in films ?) and progress. Firstly we see him frantically trying to keep up with a production line, tightening bolts. He is selected for an experiment with an automatic feeding machine, but various mishaps leads his boss to believe he has gone mad, and Charlie is sent to a mental hospital... When he gets out, he is mistaken for a communist while waving a red flag, sent to jail, foils a jailbreak, and is let out again. We follow Charlie through many more escapades before the film is out.", "genres": ["Comedy", "Drama", "Family", "Romance"], "title": "Modern Times trailer", "url": "https://www.youtube.com/embed/7TRbdXpM4B0", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQGT-8O-A75u9CQlEb569SDl5n3eR_gWHgGRkC8GMys-7ZkxamdycQOHBg", "year": 1936, "id": "0027977"}, {"plot": "The year is 1936. An archeology professor named Indiana Jones is venturing in the jungles of South America searching for a golden statue. Unfortunately, he sets off a deadly trap but miraculously escapes. Then, Jones hears from a museum curator named Marcus Brody about a biblical artifact called The Ark of the Covenant, which can hold the key to humanly existence. Jones has to venture to vast places such as Nepal and Egypt to find this artifact. However, he will have to fight his enemy Rene Belloq and a band of Nazis in order to reach it.", "genres": ["Action", "Adventure"], "title": "Raiders of the Lost Ark trailer", "url": "https://www.youtube.com/embed/XkkzKHCx154", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcS0vZjCnGB6LrL11hV0-8Qr_JGQe2H2WaWuSTtqnp1_-In5TeVyH1YCTa8", "year": 1981, "id": "0082971"}, {"plot": "Professional photographer L.B. \"Jeff\" Jeffries breaks his leg while getting an action shot at an auto race. Confined to his New York apartment, he spends his time looking out of the rear window observing the neighbors. He begins to suspect that a man across the courtyard may have murdered his wife. Jeff enlists the help of his high society fashion-consultant girlfriend Lisa Freemont and his visiting nurse Stella to investigate.", "genres": ["Mystery", "Thriller"], "title": "Rear Window trailer", "url": "https://www.youtube.com/embed/Ob_Sq__g01E", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRJK5eVQj3ZMvuqP1ecctvv3xTtBlouhQH9kkUf9YAF7c2nGDseISIb9nv7", "year": 1954, "id": "0047396"}, {"plot": "In this adaptation of the autobiography \"The Pianist: The Extraordinary True Story of One Man's Survival in Warsaw, 1939-1945,\" Wladyslaw Szpilman, a Polish Jewish radio station pianist, sees Warsaw change gradually as World War II begins. Szpilman is forced into the Warsaw Ghetto, but is later separated from his family during Operation Reinhard. From this time until the concentration camp prisoners are released, Szpilman hides in various locations among the ruins of Warsaw.", "genres": ["Biography", "Drama", "War"], "title": "The Pianist trailer", "url": "https://www.youtube.com/embed/itR0-I9idXk", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRKz_JpWnZjzwUSvkDBFjQoBmK-ysOMVd9KNfQh8larizOAPxcVNWETYYE", "year": 2002, "id": "0253474"}, {"plot": "In South Boston, the state police force is waging war on Irish-American organized crime. Young undercover cop Billy Costigan is assigned to infiltrate the mob syndicate run by gangland chief Frank Costello. While Billy quickly gains Costello's confidence, Colin Sullivan, a hardened young criminal who has infiltrated the state police as an informer for the syndicate is rising to a position of power in the Special Investigation Unit. Each man becomes deeply consumed by their double lives, gathering information about the plans and counter-plans of the operations they have penetrated. But when it becomes clear to both the mob and the police that there is a mole in their midst, Billy and Colin are suddenly in danger of being caught and exposed to the enemy - and each must race to uncover the identity of the other man in time to save themselves. But is either willing to turn on their friends and comrades they've made during their long stints undercover?", "genres": ["Crime", "Drama", "Thriller"], "title": "The Departed trailer", "url": "https://www.youtube.com/embed/iQpb1LoeVUc", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTwAsyygeR9nrbv24SFlHllF42kmL9ncr22JKSpBB5rtspAHxjX6UNMrvBL", "year": 2006, "id": "0407887"}, {"plot": "Over 10 years have passed since the first cyborg called The Terminator tried to kill Sarah Connor and her unborn son, John Connor. John Connor, the future leader of the human resistance, is now a healthy young boy. However another Terminator is sent back through time called the T-1000, which is more advanced and more powerful than its predecessor. The Mission: to kill John Connor when he's still a child. However, Sarah and John do not have to face this threat of a Terminator alone. Another Terminator is also sent back through time. The mission: to protect John and Sarah Connor at all costs. The battle for tomorrow has begun...", "genres": ["Action", "Sci-Fi", "Thriller"], "title": "Terminator 2: Judgment Day trailer", "url": "https://www.youtube.com/embed/7QXDPzx71jQ", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTttGpT6cfgICA81OSbc-DGoblLKtOpdsByuRvp_LQ2Zf0FMQuwESdqIb9q", "year": 1991, "id": "0103064"}, {"plot": "Marty McFly, a typical American teenager of the Eighties, is accidentally sent back to 1955 in a plutonium-powered DeLorean \"time machine\" invented by a slightly mad scientist. During his often hysterical, always amazing trip back in time, Marty must make certain his teenage parents-to-be meet and fall in love - so he can get back to the future.", "genres": ["Adventure", "Comedy", "Sci-Fi"], "title": "Back to the Future trailer", "url": "https://www.youtube.com/embed/2SrV13F3x7Y", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTZdZGt2S9nZ1y4wyssKx6fw6s9ek2Ps1KPgxDvmVqOZ1C2b7_6XkEZoXU", "year": 1985, "id": "0088763"}, {"plot": "A young and talented drummer attending a prestigious music academy finds himself under the wing of the most respected professor at the school, one who does not hold back on abuse towards his students. The two form an odd relationship as the student wants to achieve greatness, and the professor pushes him.", "genres": ["Drama", "Music"], "title": "Whiplash trailer", "url": "https://www.youtube.com/embed/iTgk3WbTErk", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSdnJ7P9lYv2xky8kH0CDvVgk_cxrxYpQxLgsJj0io7Ho7XzFooZTFiZV8", "year": 2014, "id": "2582802"}, {"plot": "Maximus is a powerful Roman general, loved by the people and the aging Emperor, Marcus Aurelius. Before his death, the Emperor chooses Maximus to be his heir over his own son, Commodus, and a power struggle leaves Maximus and his family condemned to death. The powerful general is unable to save his family, and his loss of will allows him to get captured and put into the Gladiator games until he dies. The only desire that fuels him now is the chance to rise to the top so that he will be able to look into the eyes of the man who will feel his revenge.", "genres": ["Action", "Adventure", "Drama"], "title": "Gladiator trailer", "url": "https://www.youtube.com/embed/DQc0lFrHICQ", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSJ6kTrYNlsuaNvcVMx2W634LuXUeO60hntBVOz9ZZH3fAN5A37o-iic_Sp", "year": 2000, "id": "0172495"}, {"plot": "Memento chronicles two separate stories of Leonard, an ex-insurance investigator who can no longer build new memories, as he attempts to find the murderer of his wife, which is the last thing he remembers. One story line moves forward in time while the other tells the story backwards revealing more each time.", "genres": ["Mystery", "Thriller"], "title": "Memento trailer", "url": "https://www.youtube.com/embed/ploSYVE0uao", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcT0X0T4K8G0iVefhKLSd_Lcki-Ell_3Yb2q7q_TIN4uk-OIg0vatpThVf8", "year": 2000, "id": "0209144"}, {"plot": "In 2029 the mutant population has shrunk significantly and the X-Men have disbanded. Logan, whose power to self-heal is dwindling, has surrendered himself to alcohol and now earns a living as a chauffeur. He takes care of the ailing old Professor X whom he keeps hidden away. One day, a female stranger asks Logan to drive a girl named Laura to the Canadian border. At first he refuses, but the Professor has been waiting for a long time for her to appear. Laura possesses an extraordinary fighting prowess and is in many ways like Wolverine. She is pursued by sinister figures working for a powerful corporation; this is because her DNA contains the secret that connects her to Logan. A relentless pursuit begins - In this third cinematic outing featuring the Marvel comic book character Wolverine we see the superheroes beset by everyday problems. They are ageing, ailing and struggling to survive financially. A decrepit Logan is forced to ask himself if he can or even wants to put his remaining powers to good use. It would appear that in the near-future, the times in which they were able put the world to rights with razor sharp claws and telepathic powers are now over.", "genres": ["Action", "Drama", "Sci-Fi", "Thriller"], "title": "Logan trailer", "url": "https://www.youtube.com/embed/rwbA7VQo1nw", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTsukJ1VxFv17JBe26eUPtC1RNd6S_TNlqfx6N0nNhg5rrcEQMvzqMHE_PR", "year": 2017, "id": "3315342"}, {"plot": "It is the height of the war in Vietnam, and U.S. Army Captain Willard is sent by Colonel Lucas and a General to carry out a mission that, officially, 'does not exist - nor will it ever exist'. The mission: To seek out a mysterious Green Beret Colonel, Walter Kurtz, whose army has crossed the border into Cambodia and is conducting hit-and-run missions against the Viet Cong and NVA. The army believes Kurtz has gone completely insane and Willard's job is to eliminate him! Willard, sent up the Nung River on a U.S. Navy patrol boat, discovers that his target is one of the most decorated officers in the U.S. Army. His crew meets up with surfer-type Lt-Colonel Kilgore, head of a U.S Army helicopter cavalry group which eliminates a Viet Cong outpost to provide an entry point into the Nung River. After some hair-raising encounters, in which some of his crew are killed, Willard, Lance and Chef reach Colonel Kurtz's outpost, beyond the Do Lung Bridge. Now, after becoming prisoners of Kurtz, will Willard & the others be able to fulfill their mission?", "genres": ["Drama", "War"], "title": "Apocalypse Now trailer", "url": "https://www.youtube.com/embed/2Vucani2GNg", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQ1a2LY2HHoTwOsO4OgQgPX69B1RNuZZfCxIil0yluNhUMj7ZLM_Y6zD1k", "year": 1979, "id": "0078788"}, {"plot": "In the end of the Nineteenth Century, in London, Robert Angier, his beloved wife Julia McCullough and Alfred Borden are friends and assistants of a magician. When Julia accidentally dies during a performance, Robert blames Alfred for her death and they become enemies. Both become famous and rival magicians, sabotaging the performance of the other on the stage. When Alfred performs a successful trick, Robert becomes obsessed trying to disclose the secret of his competitor with tragic consequences.", "genres": ["Drama", "Mystery", "Sci-Fi", "Thriller"], "title": "The Prestige trailer", "url": "https://www.youtube.com/embed/o4gHCmTQDVI", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSMW4_fi_3H0BTjpAaiv_SzGEKd0Z3y6sefdTfD0b0vEm-Z8rhCn9-LzA", "year": 2006, "id": "0482571"}, {"plot": "A young lion Prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young Prince must decide his fate: will he remain an outcast, or face his demons and become what he needs to be?", "genres": ["Animation", "Adventure", "Drama", "Family", "Musical"], "title": "The Lion King trailer", "url": "https://www.youtube.com/embed/juV7ZcmSBKY", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSJlKn-XztYQO8mv52iqLYHsli9NBYxu5pqijdB30dOb8WWkkAddnGDhco", "year": 1994, "id": "0110357"}, {"plot": "A commercial crew aboard the deep space towing vessel, Nostromo is on its way home when they pick up an SOS warning from a distant moon. What they don't know is that the SOS warning is not like any other ordinary warning call. Picking up the signal, the crew realize that they are not alone on the spaceship when an alien stowaway is on the cargo ship.", "genres": ["Horror", "Sci-Fi"], "title": "Alien trailer", "url": "https://www.youtube.com/embed/LjLamj-b0I8", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQwS4IbQqi6F6dxZka4yhPiA1vBokoSMv1DZKKlZYtoPWBTSr_IJ7KSado", "year": 1979, "id": "0078748"}, {"plot": "Paranoid Brigadier General Jack D. Ripper of Burpelson Air Force Base, believing that fluoridation of the American water supply is a Soviet plot to poison the U.S. populace, is able to deploy through a back door mechanism a nuclear attack on the Soviet Union without the knowledge of his superiors, including the Chair of the Joint Chiefs of Staff, General Buck Turgidson, and President Merkin Muffley. Only Ripper knows the code to recall the B-52 bombers and he has shut down communication in and out of Burpelson as a measure to protect this attack. Ripper's executive officer, RAF Group Captain Lionel Mandrake (on exchange from Britain), who is being held at Burpelson by Ripper, believes he knows the recall codes if he can only get a message to the outside world. Meanwhile at the Pentagon War Room, key persons including Muffley, Turgidson and nuclear scientist and adviser, a former Nazi named Dr. Strangelove, are discussing measures to stop the attack or mitigate its blow-up into an all out nuclear war with the Soviets. Against Turgidson's wishes, Muffley brings Soviet Ambassador Alexi de Sadesky into the War Room, and get his boss, Soviet Premier Dimitri Kisov, on the hot line to inform him of what's going on. The Americans in the War Room are dismayed to learn that the Soviets have an as yet unannounced Doomsday Device to detonate if any of their key targets are hit. As Ripper, Mandrake and those in the War Room try and work the situation to their end goal, Major T.J. \"King\" Kong, one of the B-52 bomber pilots, is working on his own agenda of deploying his bomb where ever he can on enemy soil if he can't make it to his intended target.", "genres": ["Comedy"], "title": "Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb trailer", "url": "https://www.youtube.com/embed/IE9CmX15PYA", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQLCQ2o5hoWwOut3QkgEDILfpcRFujQthj9WDwQ8-bE-n1C749FEbLN4Yk", "year": 1964, "id": "0057012"}, {"plot": "In Hollywood of the 50's, the obscure screenplay writer Joe Gillis is not able to sell his work to the studios, is full of debts and is thinking in returning to his hometown to work in an office. While trying to escape from his creditors, he has a flat tire and parks his car in a decadent mansion in Sunset Boulevard. He meets the owner and former silent-movie star Norma Desmond, who lives alone wit her butler and driver Max von Mayerling. Norma is demented and believes she will return to the cinema industry, and is protected and isolated from the world by Max, who was his director and husband in the past and still loves her. Norma proposes Joe to move to the mansion and help her in writing a screenplay for her comeback to the cinema, and the small-time writer becomes her lover and gigolo. When Joe falls in love for the young aspirant writer Betty Schaefer, Norma becomes jealous and completely insane and her madness leads to a tragic end.", "genres": ["Drama", "Film-Noir"], "title": "Sunset Boulevard trailer", "url": "https://www.youtube.com/embed/Ine1eH8fKZc", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSkgaCuOIyBO-xcBlAGzTBceXPcq3mfstiFhm5veOvxUN5tKuoWcoyemMom", "year": 1950, "id": "0043014"}, {"plot": "Twenty years after the end of WWI in which the nation of Tomainia was on the losing side, Adenoid Hynkel has risen to power as the ruthless dictator of the country. He believes in a pure Aryan state, and the decimation of the Jews. This situation is unknown to a simple Jewish-Tomainian barber who has since been hospitalized the result of a WWI battle. Upon his release, the barber, who had been suffering from memory loss about the war, is shown the new persecuted life of the Jews by many living in the Jewish ghetto, including a washerwoman named Hannah, with whom he begins a relationship. The barber is ultimately spared such persecution by Commander Schultz, who he saved in that WWI battle. The lives of all Jews in Tomainia are eventually spared with a policy shift by Hynkel himself, who is doing so for ulterior motives. But those motives include a want for world domination, starting with the invasion of neighboring Osterlich, which may be threatened by Benzino Napaloni, the dictator of neighboring Bacteria. Ultimately Schultz, who has turned traitor against Hynkel's regime, and the barber, may be able to join forces to take control of the situation, they using Schultz's inside knowledge of the workings of the regime and the barber's uncanny resemblance to one of those in power.", "genres": ["Comedy", "Drama", "War"], "title": "The Great Dictator trailer", "url": "https://www.youtube.com/embed/4sfJxdytYn4", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRGbY948s5PEaKHRekwhoJqv3uSGfGs_8KpWIbpyPF2qRdvbf2zr4f3Sw", "year": 1940, "id": "0032553"}, {"plot": "A famous film director remembers his childhood at the Cinema Paradiso where Alfredo, the projectionist, first brought about his love of films. He returns home to his Sicilian village for the first time after almost 30 years and is reminded of his first love, Elena, who disappeared from his life before he left for Rome.", "genres": ["Drama"], "title": "Cinema Paradiso trailer", "url": "https://www.youtube.com/embed/S7GZlpJNOQ8", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQ-b4Y0CHQRjSMiFHDHE3p0vYp1vcXhtp6otTyMPe3o9GvMOnN8ohbgSMk", "year": 1988, "id": "0095765"}, {"plot": "Gerd Wiesler is an officer with the Stasi, the East German secret police. The film begins in 1984 when Wiesler attends a play written by Georg Dreyman, who is considered by many to be the ultimate example of the loyal citizen. Wiesler has a gut feeling that Dreyman can't be as ideal as he seems and believes surveillance is called for. The Minister of Culture agrees but only later does Wiesler learn that the Minister sees Dreyman as a rival and lusts after his partner Christa-Maria. The more time he spends listening in on them, the more he comes to care about them. The once rigid Stasi officer begins to intervene in their lives, in a positive way, protecting them whenever possible. Eventually, Wiesler activities catch up to him and while there is no proof of wrongdoing, he finds himself in menial jobs - until the unbelievable happens.", "genres": ["Drama", "Thriller"], "title": "The Lives of Others trailer", "url": "https://www.youtube.com/embed/n3_iLOp6IhM", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRoh7-PmUxujPSFw9P-vNzpWDB4gat8Da9HObY9fQF5OleQO3yZL04rqQ", "year": 2006, "id": "0405094"}, {"plot": "The story of Seita and Satsuko, two young Japanese siblings, living in the declining days of World War II. When an American firebombing separates the two children from their parents, the two siblings must rely completely on one another while they struggle to fight for their survival.", "genres": ["Animation", "Drama", "War"], "title": "Grave of the Fireflies trailer", "url": "https://www.youtube.com/embed/4vPeTSRd580", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSjA-DEmofnH9XmSQFHlp4fYTNEa4j9zq65QljmJVwKPLFBNIvusTeqA7Y", "year": 1988, "id": "0095327"}, {"plot": "The futility and irony of the war in the trenches in WWI is shown as a unit commander in the French army must deal with the mutiny of his men and a glory-seeking general after part of his force falls back under fire in an impossible attack.", "genres": ["Drama", "War"], "title": "Paths of Glory trailer", "url": "https://www.youtube.com/embed/nmDA60X-f_A", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQwLQavFxImaqGm8zr4xYKCwDaPWvgE6lz53dDYYnBN45_bZybOAnGgRA", "year": 1957, "id": "0050825"}, {"plot": "A German dentist buys the freedom of a slave and trains him with the intent to make him his deputy bounty hunter. Instead, he is led to the site of the slave's wife who belongs to a ruthless plantation owner.", "genres": ["Drama", "Western"], "title": "Django Unchained trailer", "url": "https://www.youtube.com/embed/eUdM9vrCbow", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQvg9BNnSbXq8G_pmY09QFWgX-TIx26aOwqs7KkMelKw0iS_e5q4t2Crebr", "year": 2012, "id": "1853728"}, {"plot": "Signing a contract, Jack Torrance, a normal writer and former teacher agrees to take care of a hotel which has a long, violent past that puts everyone in the hotel in a nervous situation. While Jack slowly gets more violent and angry of his life, his son, Danny, tries to use a special talent, the \"Shining\", to inform the people outside about whatever that is going on in the hotel.", "genres": ["Drama", "Horror"], "title": "The Shining trailer", "url": "https://www.youtube.com/embed/32A7bTalgAE", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRHQ6a3LmR1lB38QqlBNbOJWh0w894aB8mxlPv_eQZBNOjM37ReihI2pgk", "year": 1980, "id": "0081505"}, {"plot": "In a distant, but not so unrealistic, future where mankind has abandoned earth because it has become covered with trash from products sold by the powerful multi-national Buy N Large corporation, WALL-E, a garbage collecting robot has been left to clean up the mess. Mesmerized with trinkets of Earth's history and show tunes, WALL-E is alone on Earth except for a sprightly pet cockroach. One day, EVE, a sleek (and dangerous) reconnaissance robot, is sent to Earth to find proof that life is once again sustainable. WALL-E falls in love with EVE. WALL-E rescues EVE from a dust storm and shows her a living plant he found amongst the rubble. Consistent with her \"directive\", EVE takes the plant and automatically enters a deactivated state except for a blinking green beacon. WALL-E, doesn't understand what has happened to his new friend, but, true to his love, he protects her from wind, rain, and lightning, even as she is unresponsive. One day a massive ship comes to reclaim EVE, but WALL-E, out of love or loneliness, hitches a ride on the outside of the ship to rescue EVE. The ship arrives back at a large space cruise ship, which is carrying all of the humans who evacuated Earth 700 years earlier. The people of Earth ride around this space resort on hovering chairs which give them a constant feed of TV and video chatting. They drink all of their meals through a straw out of laziness and/or bone loss, and are all so fat that they can barely move. When the auto-pilot computer, acting on hastily-given instructions sent many centuries before, tries to prevent the people of Earth from returning by stealing the plant, WALL-E, EVE, the portly captain, and a band of broken robots stage a mutiny.", "genres": ["Animation", "Adventure", "Family", "Sci-Fi"], "title": "WALL·E trailer", "url": "https://www.youtube.com/embed/alIq_wG9FNk", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTr4S-VuJq7cA_z8Dxn9R_56u4vaRWugIe14P2xjcJ-SIzhdOdtDtVAx_Vi", "year": 2008, "id": "0910970"}, {"plot": "Lester and Carolyn Burnham are, on the outside, a perfect husband and wife in a perfect house in a perfect neighborhood. But inside, Lester is slipping deeper and deeper into a hopeless depression. He finally snaps when he becomes infatuated with one of his daughter's friends. Meanwhile, his daughter Jane is developing a happy friendship with a shy boy-next-door named Ricky, who lives with an abusive father.", "genres": ["Drama", "Romance"], "title": "American Beauty trailer", "url": "https://www.youtube.com/embed/y4DvNwt0FSM", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSQ2dkkFZDli7HSMb2YDtUr8NJnikwYJIWlULTLzCmWkaNt-uDFgcwD8Rk", "year": 1999, "id": "0169547"}, {"plot": "Despite his tarnished reputation after the events of The Dark Knight, in which he took the rap for Dent's crimes, Batman feels compelled to intervene to assist the city and its police force which is struggling to cope with Bane's plans to destroy the city.", "genres": ["Action", "Thriller"], "title": "The Dark Knight Rises trailer", "url": "https://www.youtube.com/embed/M-mf5IyVIAc", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcT_MUmsgi_EsgIqY6sm87XAMQTRAFsvTJtY5vOE2i1diJrxk0apDLllBDsb", "year": 2012, "id": "1345836"}, {"plot": "While protecting his village from rampaging boar-god/demon, a confident young warrior, Ashitaka, is stricken by a deadly curse. To save his life, he must journey to the forests of the west. Once there, he's embroiled in a fierce campaign that humans were waging on the forest. The ambitious Lady Eboshi and her loyal clan use their guns against the gods of the forest and a brave young woman, Princess Mononoke, who was raised by a wolf-god. Ashitaka sees the good in both sides and tries to stem the flood of blood. This is met be animosity by both sides as they each see him as supporting the enemy.", "genres": ["Animation", "Adventure", "Fantasy"], "title": "Princess Mononoke trailer", "url": "https://www.youtube.com/embed/t2y88IBYlQo", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcR3uLcW7_Z50vaUV9I7tbaB3P0laTzXT5VQndLn6EYgeDRdfYEoOEnFJTNW", "year": 1997, "id": "0119698"}, {"plot": "Fifty seven years after Ellen Ripley survived her disastrous ordeal, her escape vessel is recovered after drifting across the galaxy as she slept in cryogenic stasis. Back on Earth, nobody believed her story about the \"Aliens\" on the moon LV-426. After the \"Company\" orders the colony on LV-426 to investigate, however, all communication with the colony is lost. The Company enlists Ripley to aid a team of tough, rugged space marines on a rescue mission to the now partially terraformed moon to find out if there are aliens or survivors. As the mission unfolds, Ripley will be forced to come to grips with her worst nightmare, but even as she does, she finds that the worst is yet to come.", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "title": "Aliens trailer", "url": "https://www.youtube.com/embed/AW-7_HE98PY", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSuiES2DFWztAXz6p8Bw5PQQNOKc0yXp25fcyDdEzZlIo02ObWChw1UpJA", "year": 1986, "id": "0090605"}, {"plot": "An average man is kidnapped and imprisoned in a shabby cell for 15 years without explanation. He then is released, equipped with money, a cellphone and expensive clothes. As he strives to explain his imprisonment and get his revenge, Oh Dae-Su soon finds out that his kidnapper has a greater plan for him and is set onto a path of pain and suffering in an attempt to uncover the motive of his mysterious tormentor.", "genres": ["Drama", "Mystery", "Thriller"], "title": "Oldboy trailer", "url": "https://www.youtube.com/embed/2HkjrJ6IK5E", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQbepZq6WzNqV9T98YwG6c3UWD_0JRcGOInx2w4qBUunwJYwc_WfjKYgrxk", "year": 2003, "id": "0364569"}, {"plot": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.", "genres": ["Comedy", "Drama", "Music", "Musical", "Romance"], "title": "La La Land (I) trailer", "url": "https://www.youtube.com/embed/0pdqf4P9MB8", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcR5H_w1zF1Mwu6Dw_MpRtEW1HNsNzXWd2IQriBW8y7zl2wYlDqrr8vxKIla", "year": 2016, "id": "3783958"}, {"plot": "Epic tale of a group of Jewish gangsters in New York, from childhood, through their glory years during prohibition, and their meeting again 35 years later.", "genres": ["Crime", "Drama"], "title": "Era Uma Vez na América trailer", "url": "https://www.youtube.com/embed/Ck4UXtTa-9U", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRMIlRHbQWrtCk8rxJFbHhhTh6Vfv9bM2EC5wLdlMB29ESS7V3kFRjfXwNB", "year": 1984, "id": "0087843"}, {"plot": "It's Britain, 1953. Upon his return to work following a heart attack, irrepressible barrister Sir Wilfrid Robarts, known as a barrister for the hopeless, takes on a murder case, much to the exasperation of his medical team, led by his overly regulated private nurse, Miss Plimsoll, who tries her hardest to ensure that he not return to his hard living ways - including excessive cigar smoking and drinking - while he takes his medication and gets his much needed rest. That case is defending American war veteran Leonard Vole, a poor, out of work, struggling inventor who is accused of murdering his fifty-six year old lonely and wealthy widowed acquaintance, Emily French. The initial evidence is circumstantial but points to Leonard as the murderer. Despite being happily married to East German former beer hall performer Christine Vole, he fostered that friendship with Mrs. French in the hopes that she would finance one of his many inventions to the tune of a few hundred pounds. It thus does not help his case when it is learned that Mrs. French changed her will prior to her murder with Leonard being the primary beneficiary of a £80,000 estate. Leonard states that he knew nothing about the will. Christine is apparently the only alibi Leonard has to his whereabouts at the time of the murder. The usual methods Sir Wilfrid uses to test his clients' guilt or innocence leads to him believing that Leonard is indeed innocent. As the trial progresses, the prosecution calls a surprise witness, one that could place a nail in the coffin of Sir Wilfrid's planned line of defense. As Sir Wilfrid gets deeper and deeper into the case, something doesn't quite sit right with him, although he doesn't know what it is. The primary questions become how far Sir Wilfrid will go to obtain evidence to acquit Leonard, and if he will ever discover why he feels that there is something odd about the case.", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Witness for the Prosecution trailer", "url": "https://www.youtube.com/embed/KsVN1hv9D5c", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRajBQ5YgmO2i1XwzHacAw5xsN2aXHaG8xhhBjfAYqE9iJdTZjBpXz2lFj0", "year": 1957, "id": "0051201"}, {"plot": "It is 1942 and the German submarine fleet is heavily engaged in the so-called \"Battle of the Atlantic\" to harass and destroy British shipping. With better escorts of the Destroyer Class, however, German U-Boats have begun to take heavy losses. \"Das Boot\" is the story of one such U-Boat crew, with the film examining how these submariners maintained their professionalism as soldiers and attempted to accomplish impossible missions, all the while attempting to understand and obey the ideology of the government under which they served.", "genres": ["Adventure", "Drama", "Thriller", "War"], "title": "Das Boot trailer", "url": "https://www.youtube.com/embed/7pzKyeIex2Y", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQogl20fIVVM-gJhI46ujAggdNQgm-yJs42l1xuj_8xlbitjO8cX0l3cJpY", "year": 1981, "id": "0082096"}, {"plot": "A group of reporters are trying to decipher the last word ever spoken by Charles Foster Kane, the millionaire newspaper tycoon: \"Rosebud.\" The film begins with a news reel detailing Kane's life for the masses, and then from there, we are shown flashbacks from Kane's life. As the reporters investigate further, the viewers see a display of a fascinating man's rise to fame, and how he eventually fell off the top of the world.", "genres": ["Drama", "Mystery"], "title": "Citizen Kane trailer", "url": "https://www.youtube.com/embed/1TmXN4aIGzc", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSUnsFThq-zLI6Wv6-zneeke-PhdKhpELDX-Ys0J_vGHNlA4aHADxXqzOxF", "year": 1941, "id": "0033467"}, {"plot": "Madison Avenue advertising man Roger Thornhill finds himself thrust into the world of spies when he is mistaken for a man by the name of George Kaplan. Foreign spy Philip Vandamm and his henchman Leonard try to eliminate him but when Thornhill tries to make sense of the case, he is framed for murder. Now on the run from the police, he manages to board the 20th Century Limited bound for Chicago where he meets a beautiful blond, Eve Kendall, who helps him to evade the authorities. His world is turned upside down yet again when he learns that Eve isn't the innocent bystander he thought she was. Not all is as it seems however, leading to a dramatic rescue and escape at the top of Mt. Rushmore.", "genres": ["Action", "Adventure", "Mystery", "Thriller"], "title": "North by Northwest trailer", "url": "https://www.youtube.com/embed/9NPI9QeeDDc", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSsKYkHK2tLeGx3Pc5e-uW-DJVOOtKCnjFv20iMHG3v_iv0Y_jQ_0Vmquo", "year": 1959, "id": "0053125"}, {"plot": "John \"Scottie\" Ferguson is a retired San Francisco police detective who suffers from acrophobia and Madeleine is the lady who leads him to high places. A wealthy shipbuilder who is an acquaintance from college days approaches Scottie and asks him to follow his beautiful wife, Madeleine. He fears she is going insane, maybe even contemplating suicide, he believes she is possessed by a dead ancestor. Scottie is skeptical, but agrees after he sees the beautiful Madeleine.", "genres": ["Mystery", "Romance", "Thriller"], "title": "Vertigo trailer", "url": "https://www.youtube.com/embed/c2u96ONO5K0", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcS15BN_euAynVAf_Gsf5TjNNfvtodBdCRkGJ1G65UfFk9yN7knpRBDFx_M", "year": 1958, "id": "0052357"}, {"plot": "Luke Skywalker battles horrible Jabba the Hut and cruel Darth Vader to save his comrades in the Rebel Alliance and triumph over the Galactic Empire. Han Solo and Princess Leia reaffirm their love and team with Chewbacca, Lando Calrissian, the Ewoks and the androids C-3PO and R2-D2 to aid in the disruption of the Dark Side and the defeat of the evil emperor.", "genres": ["Action", "Adventure", "Fantasy", "Sci-Fi"], "title": "Star Wars: Episode VI - Return of the Jedi trailer", "url": "https://www.youtube.com/embed/B4cIPi_cBmI", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcT-9HmKnP7uuHDtsBNW_NlbJG3glBNwmVyuuXLBauW1InDOfAqYB3vMEBg", "year": 1983, "id": "0086190"}, {"plot": "Six criminals, who are strangers to each other, are hired by a crime boss, Joe Cabot, to carry out a diamond robbery. Right at the outset, they are given false names with the intention that they won't get too close and will concentrate on the job instead. They are completely sure that the robbery is going to be a success. But, when the police show up right at the time and the site of the robbery, panic spreads amongst the group members, and two of them are killed in the subsequent shootout, along with a few policemen and civilians. When the remaining people assemble at the premeditated rendezvous point (a warehouse), they begin to suspect that one of them is an undercover cop.", "genres": ["Crime", "Drama", "Thriller"], "title": "Reservoir Dogs trailer", "url": "https://www.youtube.com/embed/vayksn4Y93A", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQQZMj_mHFWDqveSjWpete799ySigRnnBScTaD-CLWXXbXbFi7iu3SUjeDD", "year": 1992, "id": "0105236"}, {"plot": "William Wallace is a Scottish rebel who leads an uprising against the cruel English ruler Edward the Longshanks, who wishes to inherit the crown of Scotland for himself. When he was a young boy, William Wallace's father and brother, along with many others, lost their lives trying to free Scotland. Once he loses another of his loved ones, William Wallace begins his long quest to make Scotland free once and for all, along with the assistance of Robert the Bruce.", "genres": ["Biography", "Drama", "History", "War"], "title": "Braveheart trailer", "url": "https://www.youtube.com/embed/1cnoM8EiGGU", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcR9tualQOFKLf6N0ezsoz7YuymaCoYEq0VPLS86saiWNETi9lsXhaJ05Hg", "year": 1995, "id": "0112573"}, {"plot": "In Germany, Hans Beckert is an unknown killer of girls. He whistles Edvard Grieg's 'In The Hall of the Mountain King', from the 'Peer Gynt' Suite I Op. 46 while attracting the little girls for death. The police force pressed by the Minister give its best effort trying unsuccessfully to arrest the serial killer. The organized crime has great losses due to the intense search and siege of the police and decides to chase the murderer, with the support of the beggars association. They catch Hans and briefly judge him.", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "M trailer", "url": "https://www.youtube.com/embed/nsVproWjN6c", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQPSWLTvYm_kKxVieHB2N3Zs3HzXZraDR0AjGDYuL9h_nzM5Q23_41Pt5Jg", "year": 1931, "id": "0022100"}, {"plot": "Sara Goldfarb (Ellen Burstyn) is a retired widow, living in a small apartment. She spends most of her time watching TV, especially a particular self-help show. She has delusions of rising above her current dull existence by being a guest on that show. Her son, Harry (Jared Leto) is a junkie but along with his friend Tyrone (Marlon Wayans) has visions of making it big by becoming a drug dealer. Harry's girlfriend Marion (Jennifer Connelly) could be fashion designer or artist but is swept along in Harry's drug-centric world. Meanwhile Sara has developed an addiction of her own. She desperately wants to lose weight and so goes on a crash course involving popping pills, pills which turn out to be very addictive and harmful to her mental state.", "genres": ["Drama"], "title": "Requiem for a Dream trailer", "url": "https://www.youtube.com/embed/1yjrEl8q7iM", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRRMu3oCDYGIUtCUMhi3NtOGlnkHmtJSH-VEDnNuQ-cM9P-q9m4K1mmr-o", "year": 2000, "id": "0180093"}, {"plot": "Amélie is a story about a girl named Amélie whose childhood was suppressed by her Father's mistaken concerns of a heart defect. With these concerns Amélie gets hardly any real life contact with other people. This leads Amélie to resort to her own fantastical world and dreams of love and beauty. She later on becomes a young woman and moves to the central part of Paris as a waitress. After finding a lost treasure belonging to the former occupant of her apartment, she decides to return it to him. After seeing his reaction and his new found perspective - she decides to devote her life to the people around her. Such as, her father who is obsessed with his garden-gnome, a failed writer, a hypochondriac, a man who stalks his ex girlfriends, the \"ghost\", a suppressed young soul, the love of her life and a man whose bones are as brittle as glass. But after consuming herself with these escapades - she finds out that she is disregarding her own life and damaging her quest for love. Amélie then discovers she must become more aggressive and take a hold of her life and capture the beauty of love she has always dreamed of.", "genres": ["Comedy", "Romance"], "title": "Amélie trailer", "url": "https://www.youtube.com/embed/HUECWi5pX7o", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSpvmAVY62oD40vQtXTIZZwSt1JtQOZONQ4P-wVACDSwvtk1OcmWVqLD4Ee", "year": 2001, "id": "0211915"}, {"plot": "Protagonist Alex DeLarge is an \"ultraviolent\" youth in futuristic Britain. As with all luck, his eventually runs out and he's arrested and convicted of murder and rape. While in prison, Alex learns of an experimental program in which convicts are programmed to detest violence. If he goes through the program, his sentence will be reduced and he will be back on the streets sooner than expected. But Alex's ordeals are far from over once he hits the mean streets of Britain that he had a hand in creating.", "genres": ["Crime", "Drama", "Sci-Fi"], "title": "A Clockwork Orange trailer", "url": "https://www.youtube.com/embed/RKBYRNn5MEo", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRKZBOoqTeqxWPs4bNdzbe9ulBkfpIzQxgSTzO2PRWVruM9mJnkp_1ez4M", "year": 1971, "id": "0066921"}, {"plot": "Ishaan Awasthi is an eight-year-old whose world is filled with wonders that no one else seems to appreciate; colours, fish, dogs and kites are just not important in the world of adults, who are much more interested in things like homework, marks and neatness. And Ishaan just cannot seem to get anything right in class. When he gets into far more trouble than his parents can handle, he is packed off to a boarding school to 'be disciplined'. Things are no different at his new school, and Ishaan has to contend with the added trauma of separation from his family. One day a new art teacher bursts onto the scene, Ram Shankar Nikumbh, who infects the students with joy and optimism. He breaks all the rules of 'how things are done' by asking them to think, dream and imagine, and all the children respond with enthusiasm, all except Ishaan. Nikumbh soon realizes that Ishaan is very unhappy, and he sets out to discover why. With time, patience and care, he ultimately helps Ishaan find himself.", "genres": ["Drama", "Family", "Music"], "title": "Como Estrelas na Terra trailer", "url": "https://www.youtube.com/embed/ImK0Ncl3xuI", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSFttxPHHdzHr1lp4bdo-xtE-Kw4QPsWq_iS6nB9yoXJyGx-vPnt28TS_E", "year": 2007, "id": "0986264"}, {"plot": "Travis Bickle is an ex-Marine and Vietnam War veteran living in New York City. As he suffers from insomnia, he spends his time working as a taxi driver at night, watching porn movies at seedy cinemas during the day, or thinking about how the world, New York in particular, has deteriorated into a cesspool. He's a loner who has strong opinions about what is right and wrong with mankind. For him, the one bright spot in New York humanity is Betsy, a worker on the presidential nomination campaign of Senator Charles Palantine. He becomes obsessed with her. After an incident with her, he believes he has to do whatever he needs to make the world a better place in his opinion. One of his priorities is to be the savior for Iris, a twelve-year-old runaway and prostitute who he believes wants out of the profession and under the thumb of her pimp and lover Matthew.", "genres": ["Crime", "Drama"], "title": "Taxi Driver trailer", "url": "https://www.youtube.com/embed/ikq-PlAuaLA", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRmubvvaXBYiv4Tz7Qz1NtweMNiCsDx7v1BgZ027SNgOnHRgvv8bL7xA_s", "year": 1976, "id": "0075314"}, {"plot": "Due to his knowledge of the native Bedouin tribes, British Lieutenant T.E. Lawrence is sent to Arabia to find Prince Faisal and serve as a liaison between the Arabs and the British in their fight against the Turks. With the aid of native Sherif Ali, Lawrence rebels against the orders of his superior officer and strikes out on a daring camel journey across the harsh desert to attack a well-guarded Turkish port.", "genres": ["Adventure", "Biography", "Drama", "History", "War"], "title": "Lawrence of Arabia trailer", "url": "https://www.youtube.com/embed/WNIi7LYvDVQ", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRu1yn5d1pZZ9UAJJ_6zPqqaSFQAl9PX-VHxw8K-JSDMAD80WkQ2h4QUsY", "year": 1962, "id": "0056172"}, {"plot": "In 1938, Walter Neff, an experienced salesman of the Pacific All Risk Insurance Co., meets the seductive wife of one of his clients, Phyllis Dietrichson, and they have an affair. Phyllis proposes to kill her husband to receive the proceeds of an accident insurance policy and Walter devises a scheme to receive twice the amount based on a double indemnity clause. When Mr. Dietrichson is found dead on a train track, the police accept the determination of accidental death. However, the insurance analyst and Walter's best friend Barton Keyes does not buy the story and suspects that Phyllis has murdered her husband with the help of another man.", "genres": ["Crime", "Drama", "Film-Noir", "Mystery", "Thriller"], "title": "Double Indemnity trailer", "url": "https://www.youtube.com/embed/S3wjJcuGsVE", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTmCwBK49Bz5UIFkopSxduBfMH8eXR0_pm_mNgNSeJqnxh3hyjuqqKmKg", "year": 1944, "id": "0036775"}, {"plot": "A man, Joel Barish, heartbroken that his girlfriend Clementine underwent a procedure to erase him from her memory, decides to do the same. However, as he watches his memories of her fade away, he realizes that he still loves her, and may be too late to correct his mistake.", "genres": ["Drama", "Romance", "Sci-Fi"], "title": "Eternal Sunshine of the Spotless Mind trailer", "url": "https://www.youtube.com/embed/yE-f1alkq9I", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTIxEUEnfV62bkoaQ_igvqBtOLzXf3QKGODnTQMadiyhK00iNlmYZtDLmw", "year": 2004, "id": "0338013"}, {"plot": "Small-town Alabama, 1932. Atticus Finch (played by Gregory Peck) is a lawyer and a widower. He has two young children, Jem and Scout. Atticus Finch is currently defending Tom Robinson, a black man accused of raping a white woman. Meanwhile, Jem and Scout are intrigued by their neighbours, the Radleys, and the mysterious, seldom-seen Boo Radley in particular.", "genres": ["Crime", "Drama"], "title": "To Kill a Mockingbird trailer", "url": "https://www.youtube.com/embed/V99St7H5gPI", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSTq9lFss9g3RsYRYm76ZjtaDOYcorxfa3dgG6qaFHI_6h-2FmgEYbM4jb-", "year": 1962, "id": "0056592"}, {"plot": "Antonio Salieri believes that Wolfgang Amadeus Mozart's music is divine and miraculous. He wishes he was himself as good a musician as Mozart so that he can praise the Lord through composing. He began his career as a devout man who believes his success and talent as a composer are God's rewards for his piety. He's also content as the respected, financially well-off, court composer of Austrian Emperor Joseph II. But he's shocked to learn that Mozart is such a vulgar creature, and can't understand why God favored Mozart to be his instrument. Salieri's envy has made him an enemy of God whose greatness was evident in Mozart. He is ready to take revenge against God and Mozart for his own musical mediocrity.", "genres": ["Biography", "Drama", "History", "Music"], "title": "Amadeus trailer", "url": "https://www.youtube.com/embed/3qikgX4rlG4", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSzf91JIWZyqKKG51iPec8evBBqf42zKaPIYePJUSl1hEvqn7EMKWWXf862", "year": 1984, "id": "0086879"}, {"plot": "Woody, Buzz and the whole gang are back. As their owner Andy prepares to depart for college, his loyal toys find themselves in daycare where untamed tots with their sticky little fingers do not play nice. So, it's all for one and one for all as they join Barbie's counterpart Ken, a thespian hedgehog named Mr. Pricklepants and a pink, strawberry-scented teddy bear called Lots-o'-Huggin' Bear to plan their great escape.", "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy"], "title": "Toy Story 3 trailer", "url": "https://www.youtube.com/embed/YscpiNUtRN0", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSC2JHdwAuaBnds96ummj0LDofNZM6VXLH8g5Ssi0kfA93GrmUGnvegKFVC", "year": 2010, "id": "0435761"}, {"plot": "A two-segment look at the effect of the military mindset and war itself on Vietnam era Marines. The first half follows a group of recruits in boot camp under the command of the punishing Gunnery Sergeant Hartman. The second half shows one of those recruits, Joker, covering the war as a correspondent for Stars and Stripes, focusing on the Tet offensive.", "genres": ["Drama", "War"], "title": "Full Metal Jacket trailer", "url": "https://www.youtube.com/embed/x9f6JaaX7Wg", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQ4bqNJ-Qsw-b5elcc4mvZpc4blncKzvKdVnRJc3v5ZImuatpY7-4Ow1amF", "year": 1987, "id": "0093058"}, {"plot": "Biopic of Mahavir Singh Phogat, who taught wrestling to his daughters Babita Kumari and Geeta Phogat. Geeta Phogat was India's first female wrestler to win at the 2010 Commonwealth Games, where she won the gold medal (55 kg) while her sister Babita Kumari won the silver (52 kg).", "genres": ["Action", "Biography", "Drama", "Sport"], "title": "Dangal trailer", "url": "https://www.youtube.com/embed/IEHCkBd3VPI", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQYtaOjTg1oqdpEORC6EkTr982CYfrGxFrQXuibIiog1MSH1-GvIAWx7Rk", "year": 2016, "id": "5074352"}, {"plot": "When a mutual friend is killed by a mob boss, two con men, one experienced and one young try to get even by pulling off the big con on the mob boss. The story unfolds with several twists and last minute alterations.", "genres": ["Comedy", "Crime", "Drama"], "title": "The Sting trailer", "url": "https://www.youtube.com/embed/_nAIb_J9T5M", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSz-3tSNYBRj1qk3vThT0xnMvNEqzP-I9zx4Vxqyq1z-AAml3q48XasRFIU", "year": 1973, "id": "0070735"}, {"plot": "\"2001\" is a story of evolution. Sometime in the distant past, someone or something nudged evolution by placing a monolith on Earth (presumably elsewhere throughout the universe as well). Evolution then enabled humankind to reach the moon's surface, where yet another monolith is found, one that signals the monolith placers that humankind has evolved that far. Now a race begins between computers (HAL) and human (Bowman) to reach the monolith placers. The winner will achieve the next step in evolution, whatever that may be.", "genres": ["Adventure", "Sci-Fi"], "title": "2001: A Space Odyssey trailer", "url": "https://www.youtube.com/embed/Qv4Jv15OSGI", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcS2Yfl4jEX7m7b8YkH24kZx-H6Sny88lGxfEZrbEiYFdYgHZlZABpcwu7g", "year": 1968, "id": "0062622"}, {"plot": "1927 Hollywood. Monumental Pictures' biggest stars, glamorous on-screen couple Lina Lamont and Don Lockwood, are also an off-screen couple if the trade papers and gossip columns are to be believed. Both perpetuate the public perception if only to please their adoring fans and bring people into the movie theaters. In reality, Don barely tolerates her, while Lina, despite thinking Don beneath her, simplemindedly believes what she sees on screen in order to bolster her own stardom and sense of self-importance. R.F. Simpson, Monumental's head, dismisses what he thinks is a flash in the pan: talking pictures. It isn't until The Jazz Singer (1927) becomes a bona fide hit which results in all the movie theaters installing sound equipment that R.F. knows Monumental, most specifically in the form of Don and Lina, have to jump on the talking picture bandwagon, despite no one at the studio knowing anything about the technology. Musician Cosmo Brown, Don's best friend, gets hired as Monumental's ideas man and musical director. And by this time, Don has secretly started dating Kathy Selden, a chorus girl who is trying to make it big in pictures herself. Don and Kathy's relationship is despite their less than friendly initial meeting. Cosmo and Kathy help Don, who had worked his way up through the movie ranks to stardom, try make the leap to talking picture stardom, with Kathy following along the way. However, they have to overcome the technological issues. But the bigger problem is Lina, who will do anything to ensure she also makes the successful leap into talking pictures, despite her own inabilities and at anyone and everyone else's expense if they get in her way, especially Kathy as Don's off screen girlfriend and possibly his new talking picture leading lady.", "genres": ["Comedy", "Musical", "Romance"], "title": "Singin' in the Rain trailer", "url": "https://www.youtube.com/embed/36QiuRc_3I8", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRJ_yA7jCb6vvue95NT2eixLVd_UA3h9D0hRzNecKwRlsGuet0_4sqXDug", "year": 1952, "id": "0045152"}, {"plot": "A little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that he has life (as a toy) good. However, he must worry about Andy's family moving, and what Woody does not know is about Andy's birthday party. Woody does not realize that Andy's mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy's new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips.", "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy"], "title": "Toy Story trailer", "url": "https://www.youtube.com/embed/KYz2wyBy3kc", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSA3nVORECAQfv_Bpjoi_v5n04dBRnvXNizC4IWNbPPaSX2Tb8IbRBUWQlO", "year": 1995, "id": "0114709"}, {"plot": "Ricci, an unemployed man in the depressed post-WWII economy of Italy, gets at last a good job - for which he needs a bike - hanging up posters. But soon his bicycle is stolen. He and his son walk the streets of Rome, looking for the bicycle. Ricci finally manages to locate the thief but with no proof, he has to abandon his cause. But he and his son know perfectly well that without a bike, Ricci won't be able to keep his job.", "genres": ["Drama"], "title": "Bicycle Thieves trailer", "url": "https://www.youtube.com/embed/HjZI2YN0ueY", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSzkEvXhu2I0UlUnn-h55X84xzXV1QniUf0aQ_u6DirEqPhWp739SNLIybG", "year": 1948, "id": "0040522"}, {"plot": "Sadik is one of the rebellious youth who has been politically active as a university student and became a left-wing journalist in the 70's, despite his father's expectations of him becoming an agricultural engineer and taking control of their family farm in an Aegean village. On the dawn of September 12, 1980, when a merciless military coup hits the country, they cannot find access to any hospital or a doctor and his wife dies while giving birth to their only child, Deniz. After a long-lasting period of torture, trials, and jail time, Sadik returns to his village with 7-8 years old Deniz, knowing that it will be hard to correct things with his father, Huseyin.", "genres": ["Drama"], "title": "Meu Pai e Meu Filho trailer", "url": "", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRGRTJXNgLQJd7Zthi9LZtMfTYBwYbGsWZDGF1GUDYwX41iH50LzWIs-A", "year": 2005, "id": "0476735"}, {"plot": "The opening title reads: \"A comedy with a smile--and perhaps a tear\". As she leaves the charity hospital and passes a church wedding, Edna deposits her new baby with a pleading note in a limousine and goes off to commit suicide. The limo is stolen by thieves who dump the baby by a garbage can. Charlie the Tramp finds the baby and makes a home for him. Five years later Edna has become an opera star but does charity work for slum youngsters in hope of finding her boy. A doctor called by Edna discovers the note with the truth about the Kid and reports it to the authorities who come to take him away from Charlie. Before he arrives at the Orphan Asylum Charlie steals him back and takes him to a flophouse. The proprietor reads of a reward for the Kid and takes him to Edna. Charlie is later awakened by a kind policeman who reunites him with the Kid at Edna's mansion.", "genres": ["Comedy", "Drama", "Family"], "title": "The Kid trailer", "url": "https://www.youtube.com/embed/UBX2Yy2dqg4", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQ_hFK0SFqO1WFtIUb1G3VzMvPjUEuX1ECSXV5EVujNbSbnZnaEZtrnV7k", "year": 1921, "id": "0012349"}, {"plot": "In German-occupied France, young Jewish refugee Shosanna Dreyfus witnesses the slaughter of her family by Colonel Hans Landa. Narrowly escaping with her life, she plots her revenge several years later when German war hero Fredrick Zoller takes a rapid interest in her and arranges an illustrious movie premiere at the theater she now runs. With the promise of every major Nazi officer in attendance, the event catches the attention of the \"Basterds\", a group of Jewish-American guerrilla soldiers led by the ruthless Lt. Aldo Raine. As the relentless executioners advance and the conspiring young girl's plans are set in motion, their paths will cross for a fateful evening that will shake the very annals of history.", "genres": ["Adventure", "Drama", "War"], "title": "Inglourious Basterds trailer", "url": "https://www.youtube.com/embed/fYfquwgz21g", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcS-TNmZtDlOqEYutg3thJU2ATlkuxsTYFRapCox5Er5tbOueeLn6kh7MxRX", "year": 2009, "id": "0361748"}, {"plot": "A group of up-and-coming hustlers who stumble upon a truck-load of stolen gold bullion are suddenly thrust into the high-stakes world of organized crime.", "genres": ["Comedy", "Crime"], "title": "Snatch trailer", "url": "https://www.youtube.com/embed/rqspjopFkxM", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQZSt7s5TCQx-GA_3fAoe5i8bq-sfKUXx-pRQk8XcTx7MBI_Vlt81qUuOE", "year": 2017, "id": "5992164"}, {"plot": "History is turned on its comic head when, in 10th century England, King Arthur travels the countryside to find knights who will join him at the Round Table in Camelot. Gathering up the men is a tale in itself but after a bit of a party at Camelot, many decide to leave only to be stopped by God who sends them on a quest: to find the Holy Grail. After a series of individual adventures, the knights are reunited but must face a wizard named Tim, killer rabbits and lessons in the use of holy hand grenades. Their quest comes to an end however when the police intervene - just what you would expect in a Monty Python movie.", "genres": ["Adventure", "Comedy", "Fantasy"], "title": "Monty Python and the Holy Grail trailer", "url": "https://www.youtube.com/embed/LG1PlkURjxE", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTrupGJ-5zJ0pyzfZuSMRSiElVwS04p9Rsvm2WKYM9tZzY6WLyiqPEwkxs", "year": 1975, "id": "0071853"}, {"plot": "Farhan Qureshi and Raju Rastogi want to re-unite with their fellow collegian, Rancho, after faking a stroke aboard an Air India plane, and excusing himself from his wife - trouser less - respectively. Enroute, they encounter another student, Chatur Ramalingam, now a successful businessman, who reminds them of a bet they had undertaken 10 years ago. The trio, while recollecting hilarious antics, including their run-ins with the Dean of Delhi's Imperial College of Engineering, Viru Sahastrabudhe, race to locate Rancho, at his last known address - little knowing the secret that was kept from them all this time.", "genres": ["Comedy", "Drama"], "title": "3 Idiotas trailer", "url": "https://www.youtube.com/embed/xvszmNXdM4w", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcR3cUBzHAEPyzY9ZbGAmNG6hVDAugn2Hek3Z7zhEDyqBX0jK4yj2ipRlA", "year": 2009, "id": "1187043"}, {"plot": "1950's Los Angeles is the seedy backdrop for this intricate noir-ish tale of police corruption and Hollywood sleaze. Three very different cops are all after the truth, each in their own style: Ed Exley, the golden boy of the police force, willing to do almost anything to get ahead, except sell out; Bud White, ready to break the rules to seek justice, but barely able to keep his raging violence under control; and Jack Vincennes, always looking for celebrity and a quick buck until his conscience drives him to join Exley and White down the one-way path to find the truth behind the dark world of L.A. crime.", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "L.A. Confidential trailer", "url": "https://www.youtube.com/embed/gg0VF_EnFI4", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRHtugpZNBLcWDJOx-8ZxZhnqHoN0mJqiZV2EAkrpa_1lkJPoqHlR58rjI", "year": 1997, "id": "0119488"}, {"plot": "Monco is a bounty killer chasing El Indio and his gang. During his hunting, he meets Col. Douglas Mortimer, another bounty killer, and they decide to make a partnership, chase the bad guys together and split the reward. During their enterprise, there will be lots of bullets and funny situations. In the end, one of the bounty hunters shows the real intention of his hunting.", "genres": ["Western"], "title": "For a Few Dollars More trailer", "url": "https://www.youtube.com/embed/XsS3GLw2-DA", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSk3PNiDL-n_7urL_uZ5t-aN9hBLsgHlcaeQUfYa1YmITXTZjfwQWRSOrU", "year": 1965, "id": "0059578"}, {"plot": "Tony Montana manages to leave Cuba during the Mariel exodus of 1980. He finds himself in a Florida refugee camp but his friend Manny has a way out for them: undertake a contract killing and arrangements will be made to get a green card. He's soon working for drug dealer Frank Lopez and shows his mettle when a deal with Colombian drug dealers goes bad. He also brings a new level of violence to Miami. Tony is protective of his younger sister but his mother knows what he does for a living and disowns him. Tony is impatient and wants it all however, including Frank's empire and his mistress Elvira Hancock. Once at the top however, Tony's outrageous actions make him a target and everything comes crumbling down.", "genres": ["Crime", "Drama"], "title": "Scarface trailer", "url": "https://www.youtube.com/embed/a9LVwNum6rE", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRwKgmWG9MDn-embKejvmq3x_znOqum8D95x6y2WpfpvmLQtuiXwREPSzk", "year": 1983, "id": "0086250"}, {"plot": "Lucas is a Kindergarten teacher who takes great care of his students. Unfortunately for him, young Klara has a run-away imagination and concocts a lie about her teacher. Before Lucas is even able to understand the consequences, he has become the outcast of the town. The hunt is on to prove his innocence before it's taken from him for good.", "genres": ["Drama"], "title": "The Hunt trailer", "url": "https://www.youtube.com/embed/RMPFnc3Gcbg", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQSRKzJmmWTfiEDrBOOfueeR8hZc63U8mFvgzzOI8nHknx4EFLDhN7XD7U", "year": 2012, "id": "2106476"}, {"plot": "As of November 1, 1959, mild mannered C.C. Baxter has been working at Consolidated Life, an insurance company, for close to four years, and is one of close to thirty-two thousand employees located in their Manhattan head office. To distinguish himself from all the other lowly cogs in the company in the hopes of moving up the corporate ladder, he often works late, but only because he can't get into his apartment, located off of Central Park West, since he has provided it to a handful of company executives - Mssrs. Dobisch, Kirkeby, Vanderhoff and Eichelberger - on a rotating basis for their extramarital liaisons in return for a good word to the personnel director, Jeff D. Sheldrake. When Baxter is called into Sheldrake's office for the first time, he learns that it isn't just to be promoted as he expects, but also to add married Sheldrake to the list to who he will lend his apartment. What Baxter is unaware of is that Sheldrake's mistress is Fran Kubelik, an elevator girl in the building who Baxter himself fancies. In turn, Sheldrake has no idea of Baxter's own interest in Fran. And Fran, who is in love with Sheldrake, has no idea that she is only the latest in a long line of Sheldrake's mistresses, that Sheldrake has no intention of leaving his wife for her, and that the apartment belongs to Baxter, who she likes as a friend. As some of these facts come to light on Christmas Eve, one of the three makes a unilateral decision. That decision sets off a series of events over the course of the next week which makes each of the three examine what he/she really wants which in turn may be incompatible with the other two. They are helped along the way by Dobisch, Kirkeby, Vanderhoff and Eichelberger who are now feeling neglected as Baxter no longer needs their assistance in moving up, by Miss Olsen, Sheldrake's long serving secretary who was also once his mistress, and by Dr. Dreyfus, a physician and one of Baxter's many exasperated neighbors who believes Baxter is a playboy based on all the noise he hears in Baxter's apartment and the plethora of empty liquor bottles Baxter seems to be always discarding.", "genres": ["Comedy", "Drama", "Romance"], "title": "The Apartment trailer", "url": "https://www.youtube.com/embed/rJMqXJVHrzo", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRTMr5u771lEU10PpE2VwU6ShS9w6aZlxsAedfbsKSavnpofnBJRD4Rk6A", "year": 1960, "id": "0053604"}, {"plot": "A touching tale of a wayward young man who struggles to find his identity, living in a world where he can solve any problem, except the one brewing deep within himself, until one day he meets his soul mate who opens his mind and his heart.", "genres": ["Drama"], "title": "Good Will Hunting trailer", "url": "https://www.youtube.com/embed/z02M3NRtkAA", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTssrwKjpTcq5JaC68SoiHDh-uwvP85kSxhweIo8_k8wkKofu5ejLdc_tgC", "year": 1997, "id": "0119217"}, {"plot": "A priest, a woodcutter and another man are taking refuge from a rainstorm in the shell of a former gatehouse called Rashômon. The priest and the woodcutter are recounting the story of a murdered samurai whose body the woodcutter discovered three days earlier in a forest grove. Both were summoned to testify at the murder trial, the priest who ran into the samurai and his wife traveling through the forest just before the murder occurred. Three other people who testified at the trial are supposedly the only direct witnesses: a notorious bandit named Tajômaru, who allegedly murdered the samurai and raped his wife; the white veil cloaked wife of the samurai; and the samurai himself who testifies through the use of a medium. The three tell a similarly structured story - that Tajômaru kidnapped and bound the samurai so that he could rape the wife - but which ultimately contradict each other, the motivations and the actual killing being what differ. The woodcutter reveals at Rashômon that he knows more than he let on at the trial, thus bringing into question his own actions. But another discovery at Rashômon and the resulting actions from the discovery bring back into focus the woodcutter's own humanity or lack thereof.", "genres": ["Crime", "Drama", "Mystery"], "title": "Rashomon trailer", "url": "https://www.youtube.com/embed/ankoam7pqck", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSqVcSz_XsFQc4o1qLu9PXk89693MJO-2vHgleVfiZ80LcbHVh7Nxvm97I", "year": 1950, "id": "0042876"}, {"plot": "Nader (Peyman Moaadi) and Simin (Leila Hatami) argue about living abroad. Simin prefers to live abroad to provide better opportunities for their only daughter, Termeh. However, Nader refuses to go because he thinks he must stay in Iran and take care of his father (Ali-Asghar Shahbazi), who suffers from Alzheimers. However, Simin is determined to get a divorce and leave the country with her daughter.", "genres": ["Drama", "Mystery"], "title": "A Separation trailer", "url": "https://www.youtube.com/embed/KfuM_v15v-o", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQ2IZkIKaF7bI885VeCnrzgll8I0upslZAjbyr5q44-vUHJmRAOnFcgJRE", "year": 2011, "id": "1832382"}, {"plot": "An art collector appeals to Jones to embark on a search for the Holy Grail. He learns that another archaeologist has disappeared while searching for the precious goblet, and the missing man is his own father, Dr. Henry Jones. The artifact is much harder to find than they expected, and its powers are too much for those impure in heart.", "genres": ["Action", "Adventure", "Fantasy"], "title": "Indiana Jones and the Last Crusade trailer", "url": "https://www.youtube.com/embed/WGpq-LDV6jU", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTtQqPno3C8XYZgYeDRpc80dUv7-Cy_T-rxgyUDvAltBL-fFhMN6Y_tZQ8", "year": 1989, "id": "0097576"}, {"plot": "Sometime in the future, the city of Metropolis is home to a Utopian society where its wealthy residents live a carefree life. One of those is Freder Fredersen. One day, he spots a beautiful woman with a group of children, she and the children who quickly disappear. Trying to follow her, he, oblivious to such, is horrified to find an underground world of workers, apparently who run the machinery which keeps the above ground Utopian world functioning. One of the few people above ground who knows about the world below is Freder's father, Joh Fredersen, who is the founder and master of Metropolis. Freder learns that the woman is Maria, who espouses the need to join the \"hands\" - the workers - to the \"head\" - those in power above - by a mediator or the \"heart\". Freder wants to help the plight of the workers in the want for a better life. But when Joh learns of what Maria is espousing and that Freder is joining their cause, Joh, with the assistance of an old colleague and now nemesis named Rotwang, an inventor, works toward quashing a supposed uprising, with Maria as the center of their plan. However, Joh is unaware that Rotwang has his own agenda. But if any of these plans includes the shut down of the machines, total anarchy could break loose both above ground and below.", "genres": ["Drama", "Sci-Fi"], "title": "Metrópolis trailer", "url": "https://www.youtube.com/embed/wvNipWws-so", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQNxR2iag58sUlna2AECOSSxJiXct2HaMedsDP-Fbjz1Rh-zmMBzizPYxCz", "year": 1927, "id": "0017136"}, {"plot": "Eve (Anne Baxter) is waiting backstage to meet her \"idol\" aging Broadway Star, Margo Channing (Bette Davis). It all seems innocent enough as Eve explains that she has seen Margo in EVERY performance of the current play she is in. Only Playright critic DeWitt (George Sanders) sees through Eve's evil plan, which is to take her parts and fiancé, Bill Simpson (Gary Merrill) When the fiancé shows no interest, she tries for playwright Hugh Marlowe (Lloyd Richards) but DeWitt stops her. After she accepts her award, she decides to skip the after-party and goes to her room, where we find a young woman named Phoebe, who snuck into her room and fell asleep. This is where the \"Circle of Life\" now comes to fruition as Eve is going to get played the way she did Margo.", "genres": ["Drama"], "title": "All About Eve trailer", "url": "https://www.youtube.com/embed/dokR0scNqiQ", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTwkqgiQ6tqAG0j5_JBpmOzR8EpONC7RkRA40vNHnplDgM2RHxNls6alIE", "year": 1950, "id": "0042192"}, {"plot": "Sanjuro, a wandering samurai enters a rural town in nineteenth century Japan. After learning from the innkeeper that the town is divided between two gangsters, he plays one side off against the other. His efforts are complicated by the arrival of the wily Unosuke, the son of one of the gangsters, who owns a revolver. Unosuke has Sanjuro beaten after he reunites an abducted woman with her husband and son, then massacres his father's opponents. During the slaughter, the samurai escapes with the help of the innkeeper; but while recuperating at a nearby temple, he learns of innkeeper's abduction by Unosuke, and returns to the town to confront him.", "genres": ["Action", "Drama", "Thriller"], "title": "Yojimbo trailer", "url": "https://www.youtube.com/embed/y_1iT_GmHTE", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQnJb5VQesSZUy860KTynP449AW0mM6rC9_RFibPWy35i7fJ_8vnW90a8S6", "year": 1961, "id": "0055630"}, {"plot": "When his parents are killed, billionaire playboy Bruce Wayne relocates to Asia where he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as 'Batman'. But it doesn't stay quiet for long.", "genres": ["Action", "Adventure"], "title": "Batman Begins trailer", "url": "https://www.youtube.com/embed/Co4-HRu7exw", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRTqU5tg5wY48I3kPwFptRN4qThsKp-1-OG7P_GhKl22QXYoZXM2A3kklU", "year": 2005, "id": "0372784"}, {"plot": "Carl Fredricksen as a boy wanted to explore South America and find the forbidden Paradise Falls. About 64 years later he gets to begin his journey along with a Boy Scout named Russel with help from 500 balloons. On their journey they discover many new friends including a talking dog and Carl and Russel figure out that someone evil plans. Carl soon realizes that this evildoer is his childhood idol. Will they be able to defeat him and will they find Paradise Falls?", "genres": ["Animation", "Adventure", "Comedy", "Family"], "title": "Up trailer", "url": "https://www.youtube.com/embed/qas5lWp7_R0", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRv6NTtNSf6p2Jg0zCd-N4guYAde4FJe8NGNndedUj84szSs1cKSta2x8k", "year": 2009, "id": "1049413"}, {"plot": "When two Chicago musicians, Joe and Jerry, witness the the St. Valentine's Day massacre, they want to get out of town and get away from the gangster responsible, Spats Colombo. They're desperate to get a gig out of town but the only job they know of is in an all-girl band heading to Florida. They show up at the train station as Josephine and Daphne, the replacement saxophone and bass players. They certainly enjoy being around the girls, especially Sugar Kane Kowalczyk who sings and plays the ukulele. Joe in particular sets out to woo her while Jerry/Daphne is wooed by a millionaire, Osgood Fielding III. Mayhem ensues as the two men try to keep their true identities hidden and Spats Colombo and his crew show up for a meeting with several other crime lords.", "genres": ["Comedy", "Romance"], "title": "Some Like It Hot trailer", "url": "https://www.youtube.com/embed/kqRIXAXL5yQ", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQXw91dT3ms3ZOAaIjhObxiDLKSsbmYqbeQhKHvhf8bTKd3oFrMRsyFH9q2", "year": 1959, "id": "0053291"}, {"plot": "Fred C. Dobbs and Bob Curtin, both down on their luck in Tampico, Mexico in 1925, meet up with a grizzled prospector named Howard and decide to join with him in search of gold in the wilds of central Mexico. Through enormous difficulties, they eventually succeed in finding gold, but bandits, the elements, and most especially greed threaten to turn their success into disaster.", "genres": ["Adventure", "Drama", "Western"], "title": "The Treasure of the Sierra Madre trailer", "url": "https://www.youtube.com/embed/vGpvO8JabEc", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRZTypFBp2zurcRoG3qoxvCc0eAKGOakRx0ZZiq9C-iD-EKJh17Nz5IDOQ", "year": 1948, "id": "0040897"}, {"plot": "The town of Big Whisky is full of normal people trying to lead quiet lives. Cowboys try to make a living. Sheriff 'Little Bill' tries to build a house and keep a heavy-handed order. The town whores just try to get by.Then a couple of cowboys cut up a whore. Dissatisfied with Bill's justice, the prostitutes put a bounty on the cowboys. The bounty attracts a young gun billing himself as 'The Schofield Kid', and aging killer William Munny. Munny reformed for his young wife, and has been raising crops and two children in peace. But his wife is gone. Farm life is hard. And Munny is no good at it. So he calls his old partner Ned, saddles his ornery nag, and rides off to kill one more time, blurring the lines between heroism and villainy, man and myth.", "genres": ["Drama", "Western"], "title": "Unforgiven trailer", "url": "https://www.youtube.com/embed/XDAXGILEdro", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTqCMLZi03y8MP5Td4LZX3xjdeh0SoSiuDcShV6VYHbHk4iVI5ge-Cy-Bg", "year": 1992, "id": "0105695"}, {"plot": "In April of 1945, Germany stands at the brink of defeat with the Soviet Armies closing in from the west and south. In Berlin, capital of the Third Reich, Adolf Hitler proclaims that Germany will still achieve victory and orders his Generals and advisers to fight to the last man. \"Downfall\" explores these final days of the Reich, where senior German leaders (such as Himmler and Goring) began defecting from their beloved Fuhrer, in an effort to save their own lives, while still others (Joseph Goebbels) pledge to die with Hitler. Hitler, himself, degenerates into a paranoid shell of a man, full of optimism one moment and suicidal depression the next. When the end finally does comes, and Hitler lies dead by his own hand, what is left of his military must find a way to end the killing that is the Battle of Berlin, and lay down their arms in surrender.", "genres": ["Biography", "Drama", "History", "War"], "title": "Downfall trailer", "url": "https://www.youtube.com/embed/Bp1RXmM1-60", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcT8zzKsfPfyW1mzv_JiSg9IHGm6QI52MGtl05B_3PfWnGGaSwEHR3hWlho", "year": 2004, "id": "0363163"}, {"plot": "When Jake LaMotta steps into a boxing ring and obliterates his opponent, he's a prizefighter. But when he treats his family and friends the same way, he's a ticking time bomb, ready to go off at any moment. Though LaMotta wants his family's love, something always seems to come between them. Perhaps it's his violent bouts of paranoia and jealousy. This kind of rage helped make him a champ, but in real life, he winds up in the ring alone.", "genres": ["Biography", "Drama", "Sport"], "title": "Raging Bull trailer", "url": "https://www.youtube.com/embed/YiVOwxsa4OM", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSdAqAJkZ5fjgyHJMKi6XM5qvPpCnvyItFvMqrkCDPCTQjkW_U6pSxrhd31", "year": 1980, "id": "0081398"}, {"plot": "NYPD cop John McClane goes on a Christmas vacation to visit his wife Holly in Los Angeles where she works for the Nakatomi Corporation. While they are at the Nakatomi headquarters for a Christmas party, a group of bank robbers led by Hans Gruber take control of the building and hold everyone hostage, with the exception of John, while they plan to perform a lucrative heist. Unable to escape and with no immediate police response, John is forced to take matters into his own hands.", "genres": ["Action", "Thriller"], "title": "Die Hard trailer", "url": "https://www.youtube.com/embed/2TQ-pOvI6Xo", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcT3J74daajNxYItaPtauxupcLNDdj-Fr4WYyy-7kuC-Ae8FHrIiLKIwGwzb", "year": 1988, "id": "0095016"}, {"plot": "An out of work pulp fiction novelist, Holly Martins, arrives in a post war Vienna divided into sectors by the victorious allies, and where a shortage of supplies has led to a flourishing black market. He arrives at the invitation of an ex-school friend, Harry Lime, who has offered him a job, only to discover that Lime has recently died in a peculiar traffic accident. From talking to Lime's friends and associates Martins soon notices that some of the stories are inconsistent, and determines to discover what really happened to Harry Lime.", "genres": ["Film-Noir", "Mystery", "Thriller"], "title": "The Third Man trailer", "url": "https://www.youtube.com/embed/F-QWLAndD1E", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcT6-r4xyJNyBQaJatM5EO7ul5UgQ30XhcD491YUwUh7NE10wnDreolBxXxo", "year": 1949, "id": "0041959"}, {"plot": "Zahra's shoes are gone; her older brother Ali lost them. They are poor, there are no shoes for Zahra until they come up with an idea: they will share one pair of shoes, Ali's. School awaits. Will the plan succeed?", "genres": ["Drama", "Family"], "title": "Children of Heaven trailer", "url": "https://www.youtube.com/embed/dqxvZeQsVzY", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSNOBZoMLl6-lAdQB-ZLvHkMajeFrJZTwpy6ssjwr7jXQd7VKbr16teKw2H", "year": 1997, "id": "0118849"}, {"plot": "Hunters and their prey--Neil and his professional criminal crew hunt to score big money targets (banks, vaults, armored cars) and are, in turn, hunted by Lt. Vincent Hanna and his team of cops in the Robbery/Homicide police division. A botched job puts Hanna onto their trail while they regroup and try to put together one last big 'retirement' score. Neil and Vincent are similar in many ways, including their troubled personal lives. At a crucial moment in his life, Neil disobeys the dictum taught to him long ago by his criminal mentor--'Never have anything in your life that you can't walk out on in thirty seconds flat, if you spot the heat coming around the corner'--as he falls in love. Thus the stage is set for the suspenseful ending....", "genres": ["Action", "Crime", "Drama", "Thriller"], "title": "Heat trailer", "url": "https://www.youtube.com/embed/RfKbIbiX458", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTHtW39PMhJEgfekeDb29uCaoG4I9v__rplHaW1FpE_IaVM3oN_oczI6CeZ", "year": 1995, "id": "0113277"}, {"plot": "Based on a true story, a group of allied escape artist-type prisoners-of-war (POWs) are all put in an 'escape proof' camp. Their leader decides to try to take out several hundred all at once. The first half of the film is played for comedy as the prisoners mostly outwit their jailers to dig the escape tunnel. The second half is high adventure as they use boats and trains and planes to get out of occupied Europe.", "genres": ["Adventure", "Drama", "History", "Thriller", "War"], "title": "The Great Escape trailer", "url": "https://www.youtube.com/embed/xbVCgc-4zj8", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSNPsN9jdjlnWKA06x65RXHghlSq1dP1atMh9nMbKcIxTAPyLDrSw0AVY2j", "year": 1963, "id": "0057115"}, {"plot": "JJ 'Jake' Gittes is a private detective who seems to specialize in matrimonial cases. He is hired by Evelyn Mulwray when she suspects her husband Hollis, builder of the city's water supply system, of having an affair. Gittes does what he does best and photographs him with a young girl but in the ensuing scandal, it seems he was hired by an impersonator and not the real Mrs. Mulwray. When Mr. Mulwray is found dead, Jake is plunged into a complex web of deceit involving murder, incest and municipal corruption all related to the city's water supply.", "genres": ["Drama", "Mystery", "Thriller"], "title": "Chinatown trailer", "url": "https://www.youtube.com/embed/Zh4BCgDLmmI", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcT-ngwyeiGHgUFHJ3DOaZqtQfUS34E8PlIzNdM9mLqYrmxHM1TCcdTz4qm8", "year": 1974, "id": "0071315"}, {"plot": "Andreiv Rublev charts the life of the great icon painter through a turbulent period of 15th Century Russian history, a period marked by endless fighting between rival Princes and by Tatar invasions.", "genres": ["Biography", "Drama", "History"], "title": "Andrei Rublev trailer", "url": "https://www.youtube.com/embed/8N5oiRPxUJ0", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSnOS-wlR9vxXUlaSXMmYM7YN_IFUo12siDMVTM7mcX_rgJ5qlGByYHM6s", "year": 1966, "id": "0060107"}, {"plot": "In 1944 falangist Spain, a girl, fascinated with fairy-tales, is sent along with her pregnant mother to live with her new stepfather, a ruthless captain of the Spanish army. During the night, she meets a fairy who takes her to an old faun in the center of the labyrinth. He tells her she's a princess, but must prove her royalty by surviving three gruesome tasks. If she fails, she will never prove herself to be the the true princess and will never see her real father, the king, again.", "genres": ["Drama", "Fantasy", "War"], "title": "Pan's Labyrinth trailer", "url": "https://www.youtube.com/embed/5mmV8YdehA0", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcR7uOMsAEABaSxmlpha_jfQpWPyftYrHNcBeuomtB0NaCd0QpP0rSOxQAux", "year": 2006, "id": "0457430"}, {"plot": "Kanji Watanabe is a civil servant. He has worked in the same department for 30 years. His life is pretty boring and monotonous, though he once used to have passion and drive. Then one day he discovers that he has stomach cancer and has less than a year to live. After the initial depression he sets about living for the first time in over 20 years. Then he realises that his limited time left is not just for living life to the full but to leave something meaningful behind...", "genres": ["Drama"], "title": "Ikiru trailer", "url": "https://www.youtube.com/embed/YMU6w-ZSQgA", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRkMmlzIp_Fcg5BusiRxe1IUtVx5jHNXcjTgTPtRsJ2Gi4dTsl9GZKQZ7s_", "year": 1952, "id": "0044741"}, {"plot": "Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy, Fear, Anger, Disgust and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school.", "genres": ["Animation", "Adventure", "Comedy", "Drama", "Family", "Fantasy"], "title": "Inside Out (I) trailer", "url": "", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSDrxlSPbEx2N5LT4NoRYQ1PnbDo23CB38LRePuU7kGJJLprTwVWnZh-m53", "year": 2015, "id": "2096673"}, {"plot": "Two young girls, Satsuki and her younger sister Mei, move into a house in the country with their father to be closer to their hospitalized mother. Satsuki and Mei discover that the nearby forest is inhabited by magical creatures called Totoros (pronounced toe-toe-ro). They soon befriend these Totoros, and have several magical adventures.", "genres": ["Animation", "Family", "Fantasy"], "title": "My Neighbor Totoro trailer", "url": "https://www.youtube.com/embed/B5vkCjMqO08", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTxrnNRjfl8HHn5pqetGXrf91RtAnc-rWr1F_KefS5WL8avOlSTTQI2jKEY", "year": 1988, "id": "0096283"}, {"plot": "Japanese warlord Hidetori Ichimonji decides the time has come to retire and divide his fiefdom among his three sons. His eldest and middle sons - Taro and Jiro - agree with his decision and promise to support him for his remaining days. The youngest son Saburo disagrees with all of them arguing that there is little likelihood the three brothers will remain united. Insulted by his son's brashness, the warlord banishes Saburo. As the warlord begins his retirement, he quickly realizes that his two eldest sons selfish and have no intention of keeping their promises. It leads to war and only banished Saburo can possibly save him.", "genres": ["Action", "Drama"], "title": "Ran trailer", "url": "https://www.youtube.com/embed/AbbfDntoRRk", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSfvHTyGcYjKhWsoDB5OO6oZMhxki1cyBuDSz5kQJ__DzPxhxZXmXL3Oyc", "year": 1985, "id": "0089881"}, {"plot": "Terry Malloy dreams about being a prize fighter, while tending his pigeons and running errands at the docks for Johnny Friendly, the corrupt boss of the dockers union. Terry witnesses a murder by two of Johnny's thugs, and later meets the dead man's sister and feels responsible for his death. She introduces him to Father Barry, who tries to force him to provide information for the courts that will smash the dock racketeers.", "genres": ["Crime", "Drama", "Thriller"], "title": "On the Waterfront trailer", "url": "https://www.youtube.com/embed/QOLHbQjtSFs", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSVWdTOk6lqNHdnIESIGtC654dt5keYo4SX-s9dxTcXlP_aE39_JJ3wLHnK", "year": 1954, "id": "0047296"}, {"plot": "ROOM tells the extraordinary story of Jack, a spirited 5-year-old who is looked after by his loving and devoted mother. Like any good mother, Ma dedicates herself to keeping Jack happy and safe, nurturing him with warmth and love and doing typical things like playing games and telling stories. Their life, however, is anything but typical--they are trapped--confined to a 10-by-10-foot space that Ma has euphemistically named Room. Ma has created a whole universe for Jack within Room, and she will stop at nothing to ensure that, even in this treacherous environment, Jack is able to live a complete and fulfilling life. But as Jack's curiosity about their situation grows, and Ma's resilience reaches its breaking point, they enact a risky plan to escape, ultimately bringing them face-to-face with what may turn out to be the scariest thing yet: the real world.", "genres": ["Drama"], "title": "O Quarto de Jack (I) trailer", "url": "https://www.youtube.com/embed/IeM5qJp2v8Y", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRK9KgwGZJoDRn1XpfpXzWAG2vR0TWPuAW-zjS5r04M9r1Snf7hkCWzjLPI", "year": 2015, "id": "3170832"}, {"plot": "A lone prospector ventures into Alaska looking for gold. He gets mixed up with some burly characters and falls in love with the beautiful Georgia. He tries to win her heart with his singular charm.", "genres": ["Adventure", "Comedy", "Drama", "Family"], "title": "The Gold Rush trailer", "url": "https://www.youtube.com/embed/4FhPYptZoDg", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcT2Cw2wVkAsYyEvPN71k_hsdfyt9ZTR43eDMcGwDi79OGpXBI-Iijvd_Uo", "year": 1925, "id": "0015864"}, {"plot": "In 1999, retired Argentinian federal justice agent Benjamín Espósito is writing a novel, using an old closed case as the source material. That case is the brutal rape and murder of Liliana Coloto. In addition to seeing the extreme grief of the victim's husband Ricardo Morales, Benjamín, his assistant Pablo Sandoval, and newly hired department chief Irene Menéndez-Hastings were personally affected by the case as Benjamín and Pablo tracked the killer, hence the reason why the unsatisfactory ending to the case has always bothered him. Despite the department already having two other suspects, Benjamín and Pablo ultimately were certain that a man named Isidoro Gómez is the real killer. Although he is aware that historical accuracy is not paramount for the novel, the process of revisiting the case is more an issue of closure for him. He tries to speak to the key players in the case, most specifically Irene, who still works in the justice department and who he has always been attracted to but never pursued due to the differences in their ages and social classes. The other issue is that Gómez is still at large, no one aware if he is alive or dead. But as Pablo at the time mentioned that passion is one thing that cannot be changed in behavior, Benjamín learns now that that premise still holds true.", "genres": ["Drama", "Mystery", "Thriller"], "title": "The Secret in Their Eyes trailer", "url": "https://www.youtube.com/embed/hlSASsGs73w", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQVfwqkoaGcPkUJHfrmc2yRZqvAwbiQyMA03aIB5Km2OeTqtqS1ZcG47Tw", "year": 2009, "id": "1305806"}, {"plot": "The film deals with the situation of British prisoners of war during World War II who are ordered to build a bridge to accommodate the Burma-Siam railway. Their instinct is to sabotage the bridge but, under the leadership of Colonel Nicholson, they are persuaded that the bridge should be constructed as a symbol of British morale, spirit and dignity in adverse circumstances. At first, the prisoners admire Nicholson when he bravely endures torture rather than compromise his principles for the benefit of the Japanese commandant Saito. He is an honorable but arrogant man, who is slowly revealed to be a deluded obsessive. He convinces himself that the bridge is a monument to British character, but actually is a monument to himself, and his insistence on its construction becomes a subtle form of collaboration with the enemy. Unknown to him, the Allies have sent a mission into the jungle, led by Warden and an American, Shears, to blow up the bridge.", "genres": ["Adventure", "Drama", "War"], "title": "The Bridge on the River Kwai trailer", "url": "https://www.youtube.com/embed/SFMmJMNRv-Q", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTKD2j2sjApxuNRv-k9iLTqVVmwp66ZIozMzkh0yhWceOL3v2S7bXI0_EmI", "year": 1957, "id": "0050212"}, {"plot": "In the futuristic year of 2019, Los Angeles has become a dark and depressing metropolis, filled with urban decay. Rick Deckard, an ex-cop, is a \"Blade Runner\". Blade runners are people assigned to assassinate \"replicants\". The replicants are androids that look like real human beings. When four replicants commit a bloody mutiny on the Off World colony, Deckard is called out of retirement to track down the androids. As he tracks the replicants, eliminating them one by one, he soon comes across another replicant, Rachel, who evokes human emotion, despite the fact that she's a replicant herself. As Deckard closes in on the leader of the replicant group, his true hatred toward artificial intelligence makes him question his own identity in this future world, including what's human and what's not human.", "genres": ["Sci-Fi", "Thriller"], "title": "Blade Runner trailer", "url": "https://www.youtube.com/embed/KPcZHjKJBnE", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcSQ1HzgMWRLHKxyLetfoszGf7Dru7cvuiBqZAY8xEN7A3_nPAEheLVwAEE", "year": 1982, "id": "0083658"}, {"plot": "A love story between an 18-year-old girl named Sophie, cursed by a witch into an old woman's body, and a magician named Howl. Under the curse, Sophie sets out to seek her fortune, which takes her to Howl's strange moving castle. In the castle, Sophie meets Howl's fire demon, named Karishifâ. Seeing that she is under a curse, the demon makes a deal with Sophie--if she breaks the contract he is under with Howl, then Karushifâ will lift the curse that Sophie is under, and she will return to her 18-year-old shape.", "genres": ["Animation", "Adventure", "Family", "Fantasy"], "title": "Howl's Moving Castle trailer", "url": "https://www.youtube.com/embed/UibodUGoL4M", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSAp8avzPLqnDK4UsqUcT6A2MZ7PeuDgkBIvPMn_X-gYfCaF5rEdoh8nQ", "year": 2004, "id": "0347149"}, {"plot": "Naive and idealistic Jefferson Smith, leader of the Boy Rangers, is appointed on a lark by the spineless governor of his state. He is reunited with the state's senior senator--presidential hopeful and childhood hero, Senator Joseph Paine. In Washington, however, Smith discovers many of the shortcomings of the political process as his earnest goal of a national boys' camp leads to a conflict with the state political boss, Jim Taylor. Taylor first tries to corrupt Smith and then later attempts to destroy Smith through a scandal.", "genres": ["Comedy", "Drama"], "title": "Mr. Smith Goes to Washington trailer", "url": "https://www.youtube.com/embed/sm9qaEJ3MBc", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRUrkPFPQl9GjSa_pev7IfWz_sKhY1IgxxNakUeCKsehd-h4UeTWOvD6l4", "year": 1939, "id": "0031679"}, {"plot": "A Knight and his squire are home from the crusades. Black Death is sweeping their country. As they approach home, Death appears to the knight and tells him it is his time. The knight challenges Death to a chess game for his life. The Knight and Death play as the cultural turmoil envelopes the people around them as they try, in different ways, to deal with the upheaval the plague has caused.", "genres": ["Drama", "Fantasy"], "title": "The Seventh Seal trailer", "url": "https://www.youtube.com/embed/4M3AQMHRufY", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSdzDwuHgyZx0ylwiyUgOszQrLY2t6vlKumVBaHwDLSlMDvtDIlfu2564na", "year": 1957, "id": "0050976"}, {"plot": "Four Jack-the-lads find themselves heavily - seriously heavily - in debt to an East End hard man and his enforcers after a crooked card game. Overhearing their neighbours in the next flat plotting to hold up a group of out-of-their-depth drug growers, our heros decide to stitch up the robbers in turn. In a way the confusion really starts when a pair of antique double-barrelled shotguns go missing in a completely different scam.", "genres": ["Comedy", "Crime"], "title": "Lock, Stock and Two Smoking Barrels trailer", "url": "https://www.youtube.com/embed/KZh33gGK3Y8", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRs4-osBA-8fLcO8uuG8AQR-reldayPDKufNft7HZcq1QdmJ-fUNoelGADa", "year": 1998, "id": "0120735"}, {"plot": "It has been three years since the most important Nazi leaders had already been tried. This trial is about 4 judges who used their offices to conduct Nazi sterilization and cleansing policies. Retired American judge, Dan Haywood has a daunting task ahead of him. The Cold War is heating up and no one wants any more trials as Germany, and Allied governments, want to forget the past. But is that the right thing to do is the question that the tribunal must decide.", "genres": ["Drama", "War"], "title": "Judgment at Nuremberg trailer", "url": "https://www.youtube.com/embed/RfOgZXIQ6fo", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTFOGOjybURMYwJOtLxfEynbwzCaIPBnjCjmdP_N4u4Xi5b85yY2GRgSFA", "year": 1961, "id": "0055031"}, {"plot": "A mother's last wishes send twins Jeanne and Simon on a journey to the Middle East in search of their tangled roots. Adapted from Wajdi Mouawad's acclaimed play, Incendies tells the powerful and moving tale of two young adults' voyage to the core of deep-rooted hatred, never-ending wars and enduring love.", "genres": ["Drama", "Mystery", "War"], "title": "Incendies trailer", "url": "https://www.youtube.com/embed/0nycksytL1A", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSoKb7KG_gBV8jHeAeZhw5vDEjZFtbONOanfAPXPN6DszSpVcpjLV5R-zii", "year": 2010, "id": "1255953"}, {"plot": "This Martin Scorsese film depicts the Janus-like quality of Las Vegas--it has a glittering, glamorous face, as well as a brutal, cruel one. Ace Rothstein and Nicky Santoro, mobsters who move to Las Vegas to make their mark, live and work in this paradoxical world. Seen through their eyes, each as a foil to the other, the details of mob involvement in the casinos of the 1970's and '80's are revealed. Ace is the smooth operator of the Tangiers casino, while Nicky is his boyhood friend and tough strongman, robbing and shaking down the locals. However, they each have a tragic flaw--Ace falls in love with a hustler, Ginger, and Nicky falls into an ever-deepening spiral of drugs and violence.", "genres": ["Biography", "Crime", "Drama"], "title": "Cassino trailer", "url": "https://www.youtube.com/embed/bf9XntKHijw", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRQb1uNFwZ9_-8MWDkGNvG3cz0cot3kfVQSHo2IYCez-t0nwE2DswILcQ", "year": 1995, "id": "0112641"}, {"plot": "The true story of Desmond T. Doss, the conscientious objector who, at the Battle of Okinawa, won the Medal of Honor for his incredible bravery and regard for his fellow soldiers. We see his upbringing and how this shaped his views, especially his religious view and anti-killing stance. We see Doss's trials and tribulations after enlisting in the US Army and trying to become a medic. Finally, we see the hell on Earth that was Hacksaw Ridge.", "genres": ["Biography", "Drama", "History", "War"], "title": "Até o Último Homem trailer", "url": "https://www.youtube.com/embed/R4cmOy0V8UA", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRCF6oEajmWf-wjZg2PLH1iwy2L8OKDR_9u-9Pp2P-VP3DDdFQcf8llfa2T", "year": 2016, "id": "2119532"}, {"plot": "From the heights of notoriety to the depths of depravity, John Forbes Nash, Jr. experienced it all. A mathematical genius, he made an astonishing discovery early in his career and stood on the brink of international acclaim. But the handsome and arrogant Nash soon found himself on a painful and harrowing journey of self-discovery. After many years of struggle, he eventually triumphed over his tragedy, and finally - late in life - received the Nobel Prize.", "genres": ["Biography", "Drama"], "title": "A Beautiful Mind trailer", "url": "https://www.youtube.com/embed/kKbKpTXmlLw", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQ005IjyDMe5SWtwTFzKH8ThE-Bv3Kh2WLQKvgRXjFdUzTsvawl7ljQJEw", "year": 2001, "id": "0268978"}, {"plot": "John Merrick (whose real name was Joseph, as this is based on a true story) is an intelligent and friendly man, but he is hated by his Victorian-era English society because he is severely deformed. Once he is discovered by a doctor, however, he is saved from his life in a freak show and he is treated like the human being that he really is.", "genres": ["Biography", "Drama"], "title": "The Elephant Man trailer", "url": "https://www.youtube.com/embed/2RDW1ldM9zM", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQ7G6vx6PRwOJn-hBRqNaCXq75DW-l7ilAyK9WNqV1781TLrGPvZvuZv-E", "year": 1980, "id": "0080678"}, {"plot": "With the exception of his elderly housekeeper Miss Agda who he treats almost like a surrogate platonic wife, widowed seventy-eight year old Dr. Isak Borg, a former medical doctor and professor, has retreated from any human contact, partly his own want but partly the decision of others who do not want to spend time with him because of his cold demeanor. He is traveling from his home in Stockholm to Lund to accept an honorary degree. Instead of flying as was the original plan, he decides to take the day long drive instead. Along for the ride is his daughter-in-law Marianne, who had been staying with him for the month but has now decided to go home. The many stops and encounters along the way make him reminisce about various parts of his life. Those stops which make him reminisce directly are at his childhood summer home, at the home of his equally emotionally cold mother, and at a gas station where the attendants praise him as a man for his work. But the lives of other people they encounter almost mirror his own, including hitchhikers Sara, Viktor and Anders - who remind him of his cousin Sara who he was going to marry, himself and his irresponsible brother Sigfrid who Sara eventually married - a bickering married couple Sten and Berit Alman, and Marianne and her husband and Isak's son Evald, whose marriage is as strained as was his own.", "genres": ["Drama", "Romance"], "title": "Wild Strawberries trailer", "url": "https://www.youtube.com/embed/0RzOCwer-gc", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQGis_Sue6KsLPmBlYxs4mKA4VNVn1Kka-xcBCv3YTZ58enyKwtLvSEMA", "year": 1957, "id": "0050986"}, {"plot": "The epic adventures of the legendary Baran the Bandit following his release from prison. After serving 35 years, it is no surprise that the world has changed dramatically. Still, Baran can't help but be shocked to discover that his home village is now underwater thanks to the construction of a new dam. He then heads for Istanbul to get revenge upon his former best friend, the man who snitched on him and stole his lover Keje. Along the way, Baran teams up with Cumali, a tough young punk who finds the thief's old-fashioned ways rather quaint. When Cumali gets into deep trouble with a crime boss, Baran adds another vengeful task to his roster.", "genres": ["Crime", "Drama", "Thriller"], "title": "The Bandit trailer", "url": "https://www.youtube.com/embed/J-pSteDL6g4", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcT-hBwOddRcgCdaCrMx0h9AB7EvaRBmPt5Y3GjkgtnEUgICVJ9J4Y1v5g", "year": 1996, "id": "0116231"}, {"plot": "Tells the story of Evey Hammond and her unlikely but instrumental part in bringing down the fascist government that has taken control of a futuristic Great Britain. Saved from a life-and-death situation by a man in a Guy Fawkes mask who calls himself V, she learns a general summary of V's past and, after a time, decides to help him bring down those who committed the atrocities that led to Britain being in the shape that it is in.", "genres": ["Action", "Drama", "Thriller"], "title": "V for Vendetta trailer", "url": "", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRTImVqevrcWkxTLWHL6eOdZl0qKSkx9pcblmvIlWzhnaTrGRT3vPS2qw0", "year": 2005, "id": "0434409"}, {"plot": "Johnnie loves his train (\"The General\") and Annabelle Lee. When the Civil War begins he is turned down for service because he's more valuable as an engineer. Annabelle thinks it's because he's a coward. Union spies capture The General with Annabelle on board. Johnnie must rescue both his loves.", "genres": ["Action", "Adventure", "Comedy", "Drama", "War", "Western"], "title": "The General trailer", "url": "https://www.youtube.com/embed/99TdN8W6EAA", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRnNNgB4MVim0918X3io5pM1dCxUVbaYFIUOlfBGXHzVNcTDhfuHvkawOlw", "year": 1926, "id": "0017925"}, {"plot": "Jordan Belfort is a Long Island penny stockbroker who served 22 months in prison for defrauding investors in a massive 1990s securities scam that involved widespread corruption on Wall Street and in the corporate banking world, including shoe designer Steve Madden.", "genres": ["Biography", "Comedy", "Crime", "Drama"], "title": "The Wolf of Wall Street trailer", "url": "https://www.youtube.com/embed/idAVRvQeYAE", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQSR7e2x7p8p3sweivTrrP0Iz2BWy_xtS9Vt5NEVLSc7Geh528Edem-E2Y", "year": 2013, "id": "0993846"}, {"plot": "Two brothers face the fight of a lifetime - and the wreckage of their broken family - within the brutal, high-stakes world of Mixed Martial Arts (MMA) fighting in Lionsgate's action/drama, WARRIOR. A former Marine, haunted by a tragic past, Tommy Riordan returns to his hometown of Pittsburgh and enlists his father, a recovered alcoholic and his former coach, to train him for an MMA tournament awarding the biggest purse in the history of the sport. As Tommy blazes a violent path towards the title prize, his brother, Brendan, a former MMA fighter unable to make ends meet as a public school teacher, returns to the amateur ring to provide for his family. Even though years have passed, recriminations and past betrayals keep Brendan bitterly estranged from both Tommy and his father. But when Brendan's unlikely rise as an underdog sets him on a collision course with Tommy, the two brothers must finally confront the forces that tore them apart, all the while waging the most intense, winner-takes-all battle of their lives.", "genres": ["Action", "Drama", "Sport"], "title": "Warrior trailer", "url": "https://www.youtube.com/embed/I5kzcwcQA1Q", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSVYCcCwxuSCgCvYKIOsnLJdHLcdr_uvYXmWfywCvOdVEb7J1SNKDKhc446", "year": 2011, "id": "1291584"}, {"plot": "In this fable-morality subtitled \"A Song of Two Humans\", the \"evil\" temptress is a city woman who bewitches farmer Anses and tries to convince him to murder his neglected wife, Indre.", "genres": ["Drama", "Romance"], "title": "Sunrise trailer", "url": "https://www.youtube.com/embed/M5GBF5HJhSQ", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcR0PXH4ive23GUlmXucI_oL2DvdAzEz58TsdzRi1EdNckofpmIQ-L-Mblo", "year": 1927, "id": "0018455"}, {"plot": "A man calls up the Mumbai police, and tells them he has placed five different bombs in the city -- all set to go off in some time. He wants four terrorists in exchange. Does he get them? Who is behind it all? What's his motive? Is there more than meets the eye?", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "A Wednesday trailer", "url": "https://www.youtube.com/embed/LGfwASavWNQ", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSXrvMLHKMM1iseyCpEFFzF9ukDft9Rrd64J04X4NUEMwMiHovgc4ZDvQ", "year": 2008, "id": "1280558"}, {"plot": "A wild, freeform, Rabelaisian trip through the darkest recesses of Edinburgh low-life, focusing on Mark Renton and his attempt to give up his heroin habit, and how the latter affects his relationship with family and friends: Sean Connery wannabe Sick Boy, dimbulb Spud, psycho Begbie, 14-year-old girlfriend Diane, and clean-cut athlete Tommy, who's never touched drugs but can't help being curious about them...", "genres": ["Drama"], "title": "Trainspotting trailer", "url": "https://www.youtube.com/embed/Ih3YnOeLg5k", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcT2Qt1B7clhk7HVvGrvxHhfsLzs4iWCtRF8mdIJtw7aepbUiHuvWEyVttfN", "year": 1996, "id": "0117951"}, {"plot": "Walt Kowalski is a widower who holds onto his prejudices despite the changes in his Michigan neighborhood and the world around him. Kowalski is a grumpy, tough-minded, unhappy old man who can't get along with either his kids or his neighbors. He is a Korean War veteran whose prize possession is a 1972 Gran Torino he keeps in mint condition. When his neighbor Thao, a young Hmong teenager under pressure from his gang member cousin, tries to steal his Gran Torino, Kowalski sets out to reform the youth. Drawn against his will into the life of Thao's family, Kowalski is soon taking steps to protect them from the gangs that infest their neighborhood.", "genres": ["Drama"], "title": "Gran Torino trailer", "url": "https://www.youtube.com/embed/EiC9dcPrMNE", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRM690vSkzLmdQti2J0sXkUPQgI0f-mdyJ1AWWdd6mv-2sueniv7F-xZ41D", "year": 2008, "id": "1205489"}, {"plot": "In London, wealthy Margot Mary Wendice had a brief love affair with the American writer Mark Halliday while her husband and professional tennis player Tony Wendice was on a tennis tour. Tony quits playing to dedicate to his wife and finds a regular job. She decides to give him a second chance for their marriage. When Mark arrives from America to visit the couple, Margot tells him that she had destroyed all his letters but one that was stolen. Subsequently she was blackmailed, but she had never retrieved the stolen letter. Tony arrives home, claims that he needs to work and asks Margot to go with Mark to the theater. Meanwhile Tony calls Captain Lesgate (aka Charles Alexander Swann who studied with him at college) and blackmails him to murder his wife, so that he can inherit her fortune. But there is no perfect crime, and things do not work as planned.", "genres": ["Crime", "Film-Noir", "Thriller"], "title": "Dial M for Murder trailer", "url": "https://www.youtube.com/embed/JWP_hrNHSN4", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRUYvC8K3yAQQjSIC6-WT2V2vol7vR3mxJTGlKQJHaJtKkowjS-ACYsSAg", "year": 1954, "id": "0046912"}, {"plot": "When \"The Dude\" Lebowski is mistaken for a millionaire Lebowski, two thugs urinate on his rug to coerce him into paying a debt he knows nothing about. While attempting to gain recompense for the ruined rug from his wealthy counterpart, he accepts a one-time job with high pay-off. He enlists the help of his bowling buddy, Walter, a gun-toting Jewish-convert with anger issues. Deception leads to more trouble, and it soon seems that everyone from porn empire tycoons to nihilists want something from The Dude.", "genres": ["Comedy", "Crime", "Mystery"], "title": "The Big Lebowski trailer", "url": "https://www.youtube.com/embed/cd-go0oBF4Y", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTTZld3FS1ZpdNi6A5CpeMReJQR_jHEm8-NAgljX9r6BuZkQiu6tuA8zwiW", "year": 1998, "id": "0118715"}, {"plot": "A young idealistic English filmmaker, Sue, arrives in India to make a film on Indian revolutionaries Bhagat Singh, Chandrashekhar Azad and their contemporaries and their fight for freedom from the British Raj. Owing to a lack of funds, she recruits students from Delhi University to act in her docu-drama. She finds DJ, who graduated five years ago but still wants to be a part of the University because he doesn't think there's too much out there in the real world to look forward to. Karan, the son of Industrialist Rajnath Singhania, who shares an uncomfortable relationship with his father, but continues to live off him, albeit very grudgingly. Aslam, is a middle class Muslim boy, who lives in the by-lanes near Jama Masjid, poet, philosopher and guide to his friends. Sukhi, the group's baby, innocent, vulnerable and with a weakness for only one thing - girls. Laxman Pandey, the fundamentalist in the group, the only one who still believes that politics can make the world a better place and finally Sonia - the sole girl in the group, tomboy and vivacious spirit, engaged to Ajay - the dashing air pilot. Through her film, Sue wishes to showcase to the world the efforts of these young revolutionaries and the enormity of their contribution to the freedom movement in India. What unfolds is the inspiration behind Sue's passion for bringing their story to the world. The twist in the tale is of course the fact that more than just telling the world, Sue's film makes DJ and his friends stop and stare at themselves for being the actual descendants of these great men and never recognizing and celebrating their courage and spirit.", "genres": ["Comedy", "Drama", "History", "Romance"], "title": "Pinte de Açafrão trailer", "url": "", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcS_OLYIHEoVeiBZQCIaGj49IYolZHbS7m1Gy_JhhBXLhLxWJBuYD85ydos", "year": 2006, "id": "0405508"}, {"plot": "Michael, Steven and Nick are young factory workers from Pennsylvania who enlist into the Army to fight in Vietnam. Before they go, Steven marries the pregnant Angela, and their wedding party also serves as the men's farewell party. After some time and many horrors, the three friends fall in the hands of the Vietcong and are brought to a prison camp in which they are forced to play Russian roulette against each other. Michael makes it possible for them to escape, but they soon get separated again.", "genres": ["Drama", "War"], "title": "The Deer Hunter trailer", "url": "https://www.youtube.com/embed/3Gqit3zVmyc", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTRzU2qBmJRhm08tT4G296V8hmRbD_FpepQqp8ZP-UIgd9NFoHNFN07Bu9a", "year": 1978, "id": "0077416"}, {"plot": "The sufferings of a martyr, Jeanne D'Arc (1412-1431). Jeanne appears in court where Cauchon questions her and d'Estivet spits on her. She predicts her rescue, is taken to her cell, and judges forge evidence against her. In her cell, priests interrogate her and judges deny her the Mass. Threatened first in a torture chamber and then offered communion if she will recant, she refuses. At a cemetery, in front of a crowd, a priest and supporters urge her to recant; she does, and Cauchon announces her sentence. In her cell, she explains her change of mind and receives communion. In the courtyard at Rouen castle, she burns at the stake; the soldiers turn on the protesting crowd.", "genres": ["Biography", "Drama", "History"], "title": "The Passion of Joan of Arc trailer", "url": "https://www.youtube.com/embed/CQj_3AY-E1g", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTgJiUYGaIsOrZpvgw4wzJiJtLnqU5FKxEjAHZEp04A7W8F-buRkdl-E2A", "year": 1928, "id": "0019254"}, {"plot": "The all new \"true crime\" case of Fargo's new chapter travels back to 1979 in Sioux Falls, South Dakota and Luverne, Minnesota, where a young State Police Officer Lou Solverson, recently back from Vietnam, investigates a case involving a local crime gang and a major Mob syndicate. Helping him piece things together is his father-in-law, Sheriff Hank Larsson. The investigation will lead them to a colorful cast of characters that includes Karl Weathers, the town lawyer of Luverne, Minnesota. A Korean War vet, Karl is a flowery drunk blessed with the gift of gab and the eloquence of a true con artist. Joe Bulo, the front man for the northern expansion of a Kansas City crime syndicate. The new face of corporate crime, Joe's bringing a Walmart mentality to small town America. His number two is Mike Milligan. Part enforcer, part detective, Mike is always smiling - but the joke is usually on you. Bulo and his crew have their sights set on the Gerhardt crime family in Fargo, currently led by matriarch Floyd Gerhardt. With her husband at death's door, Floyd takes over the family business, frustrating her eldest son, Dodd Gerhardt. An impatient hothead with a cruel streak to match his ambitions, Dodd can't wait for both his parents to die so he can take over and expand their business from kingdom to empire. Bear Gerhardt is the middle son, an intimidatingly large man who, although inarticulate, is the most decent of his clan. Rye Gerhardt, the youngest of the Gerhardt clan, views himself as a big shot, but in reality he's just a small dog who barks big.", "genres": ["Crime", "Drama", "Thriller"], "title": "Fargo trailer", "url": "https://www.youtube.com/embed/EfVSep6ajuc", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcR-roPCaofOwSIOGSV5JJX0WZmB4IRqlo9QB443tK2Av5--atq1_kXj0b89", "year": 2014, "id": "2802850"}, {"plot": "Scarlett is a woman who can deal with a nation at war, Atlanta burning, the Union Army carrying off everything from her beloved Tara, the carpetbaggers who arrive after the war. Scarlett is beautiful. She has vitality. But Ashley, the man she has wanted for so long, is going to marry his placid cousin, Melanie. Mammy warns Scarlett to behave herself at the party at Twelve Oaks. There is a new man there that day, the day the Civil War begins. Rhett Butler. Scarlett does not know he is in the room when she pleads with Ashley to choose her instead of Melanie.", "genres": ["Drama", "History", "Romance", "War"], "title": "Gone with the Wind trailer", "url": "https://www.youtube.com/embed/0dTsfsr6-X8", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcS5cqATlqizp18fcsJFFNXP75LS7Xi6k5pCNSyMj6cF-KBf88fW4Jp-bqs", "year": 1939, "id": "0031381"}, {"plot": "An elderly couple journey to Tokyo to visit their children and are confronted by indifference, ingratitude and selfishness. When the parents are packed off to a resort by their impatient children, the film deepens into an unbearably moving meditation on mortality.", "genres": ["Drama"], "title": "Tokyo Story trailer", "url": "https://www.youtube.com/embed/5zEKw4VQIeY", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcS7VI8Y_FwWwz18LydzathYL0klcYQMWa057f9soJQk-vS1Iv4ng-7Wvv6t", "year": 1953, "id": "0046438"}, {"plot": "A clown fish named Marlin lives in the Great Barrier Reef loses his son, Nemo. After he ventures into the open sea, despite his father's constant warnings about many of the ocean's dangers. Nemo is abducted by a boat and netted up and sent to a dentist's office in Sydney. So, while Marlin ventures off to try to retrieve Nemo, Marlin meets a fish named Dory, a blue tang suffering from short-term memory loss. The companions travel a great distance, encountering various dangerous sea creatures such as sharks, anglerfish and jellyfish, in order to rescue Nemo from the dentist's office, which is situated by Sydney Harbor. While the two are doing this, Nemo and the other sea animals in the dentist's fish tank plot a way to return to Sydney Harbor to live their lives free again.", "genres": ["Animation", "Adventure", "Comedy", "Family"], "title": "Finding Nemo trailer", "url": "https://www.youtube.com/embed/CTPPCs7ZqYo", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcR_O5y60lVYkyHqaGTFsvhY5-hgKOEFTXmn2fPlqrKLMK6XvYAWTXofdOQ", "year": 2003, "id": "0266543"}, {"plot": "Malcom Crowe (Bruce Willis)is a child psychologist who receives an award on the same night that he is visited by a very unhappy ex-patient. After this encounter, Crowe takes on the task of curing a young boy with the same ills as the ex-patient (Donnie Wahlberg) . This boy \"sees dead people\". Crowe spends a lot of time with the boy much to the dismay of his wife (Olivia Williams). Cole's mom (Toni Collette) is at her wit's end with what to do about her son's increasing problems. Crowe is the boy's only hope.", "genres": ["Drama", "Mystery", "Thriller"], "title": "The Sixth Sense trailer", "url": "https://www.youtube.com/embed/VG9AGf66tXM", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSpptd3-EorBsKV9vKBORmK4crgs5DHz_Bu28v8cjGw8yvsT-ZmzOqDPc6l", "year": 1999, "id": "0167404"}, {"plot": "A US research station, Antarctica, early-winter 1982. The base is suddenly buzzed by a helicopter from the nearby Norwegian research station. They are trying to kill a dog that has escaped from their base. After the destruction of the Norwegian chopper the members of the US team fly to the Norwegian base, only to discover them all dead or missing. They do find the remains of a strange creature the Norwegians burned. The Americans take it to their base and deduce that it an alien life form. After a while it is apparent that the alien can take over and assimilate into other life forms, including humans, and can spread like a virus. This means that anyone at the base could be inhabited by The Thing, and tensions escalate.", "genres": ["Horror", "Mystery", "Sci-Fi"], "title": "The Thing trailer", "url": "https://www.youtube.com/embed/5ftmr17M-a4", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTY_3ptu7PlSVaT1YNP70yQdoKNpj1al0laz86j1nWkoJUbtYLZxFRlOGz-", "year": 1982, "id": "0084787"}, {"plot": "In rural Texas, welder and hunter Llewelyn Moss (Josh Brolin) discovers the remains of several drug runners who have all killed each other in an exchange gone violently wrong. Rather than report the discovery to the police, Moss decides to simply take the two million dollars present for himself. This puts the psychopathic killer, Anton Chigurh (Javier Bardem), on his trail as he dispassionately murders nearly every rival, bystander and even employer in his pursuit of his quarry and the money. As Moss desperately attempts to keep one step ahead, the blood from this hunt begins to flow behind him with relentlessly growing intensity as Chigurh closes in. Meanwhile, the laconic Sherrif Ed Tom Bell (Tommy Lee Jones) blithely oversees the investigation even as he struggles to face the sheer enormity of the crimes he is attempting to thwart.", "genres": ["Crime", "Drama", "Thriller"], "title": "No Country for Old Men trailer", "url": "https://www.youtube.com/embed/1YLfpDBzhFI", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQdp78dmPeQhTeb8IJC5p1NPm8pXToRCIsNANSWJVYXyz5Hil7FfDGR24jt", "year": 2007, "id": "0477348"}, {"plot": "Luke Jackson is a cool, gutsy prisoner in a Southern chain gang, who, while refusing to buckle under to authority, keeps escaping and being recaptured. The prisoners admire Luke because, as Dragline explains it, \"You're an original, that's what you are!\" Nevertheless, the camp staff actively works to crush Luke until he finally breaks.", "genres": ["Crime", "Drama"], "title": "Cool Hand Luke trailer", "url": "https://www.youtube.com/embed/l3CPz21NzUc", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSbMF6jQmBtG5XCmTMQNMjlS6wcexoWYxKja-cEX2Kn2O7FcBnIQQpcovOX", "year": 1967, "id": "0061512"}, {"plot": "A shy ladies' companion, staying in Monte Carlo with her stuffy employer, meets the wealthy Maxim de Winter. She and Max fall in love, marry and return to Manderley, his large country estate in Cornwall. Max is still troubled by the death of his first wife, Rebecca, in a boating accident the year before. The second Mrs. de Winter clashes with the housekeeper, Mrs. Danvers, and discovers that Rebecca still has a strange hold on everyone at Manderley.", "genres": ["Drama", "Mystery", "Romance", "Thriller"], "title": "Rebecca trailer", "url": "https://www.youtube.com/embed/CANjLGLrdak", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcR0VsIV6y5PZU14CAK7MUI5goJ5brTMoJax3aQvVQDZihPJ5VNDnJoZcaA", "year": 1940, "id": "0032976"}, {"plot": "Long ago up North on the Island of Berk, the young Viking, Hiccup, wants to join his town's fight against the dragons that continually raid their town. However, his macho father and village leader, Stoik the Vast, will not allow his small, clumsy, but inventive son to do so. Regardless, Hiccup ventures out into battle and downs a mysterious Night Fury dragon with his invention, but can't bring himself to kill it. Instead, Hiccup and the dragon, whom he dubs Toothless, begin a friendship that would open up both their worlds as the observant boy learns that his people have misjudged the species. But even as the two each take flight in their own way, they find that they must fight the destructive ignorance plaguing their world.", "genres": ["Animation", "Action", "Adventure", "Comedy", "Family", "Fantasy"], "title": "How to Train Your Dragon trailer", "url": "https://www.youtube.com/embed/HqMYHjlBMUY", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSLQ5Cq93zf44bZrFwwutFfHjxljM07nbCbOv2YzhigqneWVWckdKQjYFM", "year": 2010, "id": "0892769"}, {"plot": "The lead character, called 'The Bride,' was a member of the Deadly Viper Assassination Squad, led by her lover 'Bill.' Upon realizing she was pregnant with Bill's child, 'The Bride' decided to escape her life as a killer. She fled to Texas, met a young man, who, on the day of their wedding rehearsal was gunned down by an angry and jealous Bill (with the assistance of the Deadly Viper Assassination Squad). Four years later, 'The Bride' wakes from a coma, and discovers her baby is gone. She, then, decides to seek revenge upon the five people who destroyed her life and killed her baby. The saga of Kill Bill Volume I begins.", "genres": ["Action", "Crime", "Thriller"], "title": "Kill Bill: Vol. 1 trailer", "url": "https://www.youtube.com/embed/ot6C1ZKyiME", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQqq0ZchWmfsfmSthRz7UhqyA889FOyQEXqMgIXVubU95YsKS36B2mhRho", "year": 2003, "id": "0266697"}, {"plot": "The intersecting life stories of Daniel Plainview and Eli Sunday in early twentieth century California presents miner-turned-oilman Daniel Plainview, a driven man who will do whatever it takes to achieve his goals. He works hard but also takes advantage of those around him at their expense if need be. His business partner/son (H.W.) is, in reality, an \"acquired\" child whose true biological single-parent father (working on one of Daniel's rigs) died in a workplace accident. Daniel is deeply protective of H.W. if only for what H.W. brings to the partnership. Eli Sunday is one in a pair of twins whose family farm Daniel purchases for the major oil deposit located on it. Eli, a local preacher and a self-proclaimed faith healer, wants the money from the sale of the property to finance his own church. The lives of the two competitive men often clash as Daniel pumps oil off the property and tries to acquire all the surrounding land at bargain prices to be able to build a pipeline to the coast, and as Eli tries to build his own religious empire.", "genres": ["Drama", "History"], "title": "There Will Be Blood trailer", "url": "https://www.youtube.com/embed/f3THVbr4hlY", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTxevwA2emmB17Nb4LbXeHq2caAIrhf4adVD2ZIDLH2G90p8wPM_6qxIfc", "year": 2007, "id": "0469494"}, {"plot": "Based on a true story. After graduating from Emory University, Christopher McCandless abandoned his possessions, gave his entire savings account to charity, and hitchhiked to Alaska to live in the wilderness. Along the way, Christopher encounters a series of characters who shape his life.", "genres": ["Adventure", "Biography", "Drama"], "title": "Into the Wild trailer", "url": "https://www.youtube.com/embed/2LAuzT_x8Ek", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcS7ls5uMBDUSJ7Cou37s5pi7cLaCBKODtOHXXlusRqsMErh90Q3DZ0Vyw", "year": 2007, "id": "0758758"}, {"plot": "In the mid-1970's, a homely, friendless Australian girl of 8 picks a name out of a Manhattan phone book and writes to him; she includes a chocolate bar. She's Mary Dinkle, the only child of an alcoholic mother and a distracted father. He's Max Horowitz, an overweight man with Asperger's, living alone in New York. He writes back, with chocolate. Thus begins a 20-year correspondence, interrupted by a stay in an asylum and a few misunderstandings. Mary falls in love with a neighbor, saves money to have a birthmark removed and deals with loss. Max has a friendship with a neighbor, tries to control his weight, and finally gets the dream job. Will the two ever meet face to face?", "genres": ["Animation", "Comedy", "Drama"], "title": "Mary e Max: Uma Amizade Diferente trailer", "url": "https://www.youtube.com/embed/V1YIJvOj6xM", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQboB1ddXCy5zf4EclD8s_Jmz6Njzb1TgX5A0NrZ_jjWxiHvjLn_Oq72I8", "year": 2009, "id": "0978762"}, {"plot": "On the occasion of his fifth wedding anniversary, Nick Dunne reports that his wife, Amy, has gone missing. Under pressure from the police and a growing media frenzy, Nick's portrait of a blissful union begins to crumble. Soon his lies, deceits and strange behavior have everyone asking the same dark question: Did Nick Dunne kill his wife?", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Gone Girl trailer", "url": "https://www.youtube.com/embed/Ym3LB0lOJ0o", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSNYMG1jyFprxfrDsNnNgevBbTPcFZDAMmuc6XpCjQz40-kB6I4RdjhNBk", "year": 2014, "id": "2267998"}, {"plot": "During WWII, a Belarusian boy is thrust into the atrocities of war, fighting with a hopelessly unequipped Soviet resistance movement against ruthless German forces. Witnessing scenes of abject terror and surviving horrifying situations, he loses his innocence and then his mind.", "genres": ["Drama", "War"], "title": "Come and See trailer", "url": "", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSQbpnA0RWboMCZjdsGgkE2MYdY0DOIT6U9jud7aWug1HLlqHFVQD1J5AY", "year": 1985, "id": "0091251"}, {"plot": "The story of Brian of Nazareth, born on the same day as Jesus of Nazareth, who takes a different path in life that leads to the same conclusion. Brian joins a political resistance movement aiming to get the Romans out of Judea. Brian scores a victory of sorts when he manages to paint political slogans on an entire wall in the city of Jerusalem. The movement is not very effective but somehow Brian becomes a prophet and gathers his own following. His fate is sealed however and he lives a very short life.", "genres": ["Comedy"], "title": "Life of Brian trailer", "url": "https://www.youtube.com/embed/TKPmGjVFbrY", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTcamLyKyvHX7D1qxCYprsZt_YeK_41fYU6J86HmubJCVhaQL6cy4FQ35Q", "year": 1979, "id": "0079470"}, {"plot": "Ellie Andrews has just tied the knot with society aviator King Westley when she is whisked away to her father's yacht and out of King's clutches. Ellie jumps ship and eventually winds up on a bus headed back to her husband. Reluctantly she must accept the help of out-of- work reporter Peter Warne. Actually, Warne doesn't give her any choice: either she sticks with him until he gets her back to her husband, or he'll blow the whistle on Ellie to her father. Either way, Peter gets what (he thinks!) he wants .... a really juicy newspaper story.", "genres": ["Comedy", "Romance"], "title": "It Happened One Night trailer", "url": "https://www.youtube.com/embed/ALmnUBqbhuo", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQiYYAJC7ng2IEIfC423i933ykUrSqYJCgAqQgGdHq66ySn_h9uwwSMf6k", "year": 1934, "id": "0025316"}, {"plot": "In India gangsters are called Bhai (brothers). One such Bhai is Munna, who is feared by everyone in Mumbai, a big city in India. He cons his village-based parents into believing that he is a doctor. He gets a shock when he finds out that they are coming to verify for themselves. So he transforms a rooming shanty house into a makeshift hospital, populated by patients, people he beats up. His parents arrive, are pleased, and happy that their son is well settled. They would like him to get married to a doctor's daughter. The marriage is arranged, but before the engagement, the bride's father finds out the truth about Munna, and cancels the marriage. Munna's humiliated parents see the truth for themselves, and hurt, they return home, leaving Munna with a strong desire to hurt the doctor - and force him to let his daughter get married to him - even if it means getting admitted in the medical college - with forged documents!!!", "genres": ["Comedy", "Drama", "Romance"], "title": "Munna Bhai M.B.B.S. trailer", "url": "https://www.youtube.com/embed/UpNCtPMRV7s", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcRQN6V50zA6xFRb2X4-g3MFr7BVO55wOKW718seGjxas6N7lxmdFlcWfRA", "year": 2003, "id": "0374887"}, {"plot": "It's 1954, and up-and-coming U.S. marshal Teddy Daniels is assigned to investigate the disappearance of a patient from Boston's Shutter Island Ashecliffe Hospital. He's been pushing for an assignment on the island for personal reasons, but before long he wonders whether he hasn't been brought there as part of a twisted plot by hospital doctors whose radical treatments range from unethical to illegal to downright sinister. Teddy's shrewd investigating skills soon provide a promising lead, but the hospital refuses him access to records he suspects would break the case wide open. As a hurricane cuts off communication with the mainland, more dangerous criminals \"escape\" in the confusion, and the puzzling, improbable clues multiply, Teddy begins to doubt everything - his memory, his partner, even his own sanity.", "genres": ["Mystery", "Thriller"], "title": "Shutter Island trailer", "url": "https://www.youtube.com/embed/5iaYLCiq5RM", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcS96mnBr8be-fg88k2HOikkWiSF9o1nDiZidgBoSshU7zE308M6Q9F0PgU6", "year": 2010, "id": "1130884"}, {"plot": "Chris Taylor is a young, naive American who gives up college and volunteers for combat in Vietnam. Upon arrival, he quickly discovers that his presence is quite nonessential, and is considered insignificant to the other soldiers, as he has not fought for as long as the rest of them and felt the effects of combat. Chris has two non-commissioned officers, the ill-tempered and indestructible Staff Sergeant Robert Barnes and the more pleasant and cooperative Sergeant Elias Grodin. A line is drawn between the two NCOs and a number of men in the platoon when an illegal killing occurs during a village raid. As the war continues, Chris himself draws towards psychological meltdown. And as he struggles for survival, he soon realizes he is fighting two battles, the conflict with the enemy and the conflict between the men within his platoon.", "genres": ["Drama", "War"], "title": "Platoon trailer", "url": "https://www.youtube.com/embed/pPi8EQzJ2Bg", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQ7cDGgcL3uWb9NNzXSoMKgOJ2bvtO6dF9ph1JbshNhZQri7e5djJx_vAsC", "year": 1986, "id": "0091763"}, {"plot": "During the 1990s, some of the worst atrocities in the history of mankind took place in the country of Rwanda--and in an era of high-speed communication and round the clock news, the events went almost unnoticed by the rest of the world. In only three months, one million people were brutally murdered. In the face of these unspeakable actions, inspired by his love for his family, an ordinary man summons extraordinary courage to save the lives of over a thousand helpless refugees, by granting them shelter in the hotel he manages.", "genres": ["Biography", "Drama", "History", "War"], "title": "Hotel Rwanda trailer", "url": "https://www.youtube.com/embed/4dd8rX5Dy_Q", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRW9aO_05LGtia9Z7bjoXgwWfCYcSrcBIhRgejpCXpY8su18j20rFbI72c", "year": 2004, "id": "0395169"}, {"plot": "Set against the sexy, glamorous golden age of Formula 1 racing in the 1970s, the film is based on the true story of a great sporting rivalry between handsome English playboy James Hunt (Hemsworth), and his methodical, brilliant opponent, Austrian driver Niki Lauda (Bruhl). The story follows their distinctly different personal styles on and off the track, their loves and the astonishing 1976 season in which both drivers were willing to risk everything to become world champion in a sport with no margin for error: if you make a mistake, you die.", "genres": ["Action", "Biography", "Drama", "Sport"], "title": "Rush (I) trailer", "url": "https://www.youtube.com/embed/1wUz56FyBqY", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTfoB36KXshQxVRNxcAHU_IolW2L2iAB36VuVDTW7mFm2h50b9Tal7Ws-Y5", "year": 2013, "id": "1979320"}, {"plot": "In the 1970s, terrorist violence is the stuff of networks' nightly news programming and the corporate structure of the UBS Television Network is changing. Meanwhile, Howard Beale, the aging UBS news anchor, has lost his once strong ratings share and so the network fires him. Beale reacts in an unexpected way. We then see how this affects the fortunes of Beale, his coworkers (Max Schumacher and Diana Christensen), and the network.", "genres": ["Drama"], "title": "Network trailer", "url": "https://www.youtube.com/embed/qnGgsJ26dao", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQrjDc5d908VUW4st8HOgcDQsXLoaQRcsAaT8bKHvc5ESHEPOxGxu-gCA", "year": 1976, "id": "0074958"}, {"plot": "Sholay means embers in Hindi. In this particular movie, a Police Officer, who's family was killed by a bandit named Gabbar Singh, decides to fight fire with fire and recruits two convicts, Jai and Veeru to capture Gabbar. He approaches them in jail, puts the proposal in front of them, and they agree to bring in Gabbar Singh alive - for a hefty price. After their discharge from jail, they travel by train to the village where the Police Officer lives - now with only his widowed daughter-in-law. The three band together to fight one of the most elusive and dreaded bandits of all time. Will the two ex-cons be able to bring Gabbar alive to the Police Officer?", "genres": ["Action", "Adventure", "Comedy", "Drama", "Musical", "Thriller"], "title": "Sholay trailer", "url": "https://www.youtube.com/embed/ci_VNqzCa-Y", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQp1qgxIXX7X5CJZnz9fM9DKJQUuEMzYeNcM3rTfaZnVoTX1QG71QZ-HRXZ", "year": 1975, "id": "0073707"}, {"plot": "The film is divided into six segments. (1) \"Pasternak\": While being on a plane, a model and a music critic realise they have a common acquaintance called Pasternak. Soon they discover that every passenger and crew member on board know Pasternak. Is this coincidence? (2) \"The Rats\": A waitress recognizes her client - it's the loan shark who caused a tragedy in her family. The cook suggests mixing rat poison with his food, but the waitress refuses. The stubborn cook, however, decides to proceed with her plan. (3) \"The Strongest\": Two drivers on a lone highway have an argument with tragic consequences. (4) \"Little Bomb\": A demolition engineer has his car towed by a truck for parking in a wrong place and he has an argument with the employee of the towing company. This event destroys his private and professional life, and he plots revenge against the corrupt towing company and the city hall. (5) \"The Proposal\": A reckless son of a wealthy family has an overnight hit-and-run accident, in which a pregnant woman gets killed. He wakes his parents up and his father calls the lawyer. The parents propose to pay the groundkeeper to take the blame for the boy. Soon the father discovers that he is a victim of extortion of his lawyer and the detective in charge of the investigation. What will be his decision? (6) \"Until Death Do Us Apart\": During the wedding party, the bride discovers that her newlywed husband has been cheating on her with one of the guests, and she decides to pay him back.", "genres": ["Comedy", "Drama", "Thriller"], "title": "Relatos Selvagens trailer", "url": "https://www.youtube.com/embed/Dgs8d78EKeQ", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcT9jor17u35wpt585sVDSRbzyZEoBfGHWfMgs6_MmGY_rl5adYa6odEjk4", "year": 2014, "id": "3011894"}, {"plot": "Baburao is a landlord in India, who is very near-sighted, and always in financial trouble. He has a tenant named Raja, who has not paid his rent for several months. He also has anther tenant named Shyam, who has come to the city to look for a job in his late father's place, but is unable to find employment. The three men quarrel amongst themselves frequently. Then one day, the three men get a phone call from a kidnapper named Kabira, and decide to make use of this phone call to overcome their financial problems - pretend to be the real kidnappers, increase the ransom amount, keep the incremental amount for themselves, and then give the original ransom demanded to Kabira. Will they get away with this idea?", "genres": ["Comedy", "Crime", "Thriller"], "title": "Hera Pheri trailer", "url": "https://www.youtube.com/embed/x-qMfdUYC-8", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSqBH2MAZl0r4WspY1mO2jqegreyye31TGROE0WmU3rik1S0pFGOygAjkk", "year": 2000, "id": "0242519"}, {"plot": "In the South American jungle supplies of nitroglycerin are needed at a remote oil field. The oil company pays four men to deliver the supplies in two trucks. A tense rivalry develops between the two sets of drivers and on the rough remote roads the slightest jolt can result in death.", "genres": ["Adventure", "Drama", "Thriller"], "title": "The Wages of Fear trailer", "url": "https://www.youtube.com/embed/OAYCADJHImc", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSni6Vt6hdFb6-3JR-u1UYdH4cLkZBJuKERg6y99JCVMjxoYM7iqyCisLQ", "year": 1953, "id": "0046268"}, {"plot": "It's the summer of 1959 in Castlerock, Oregon and four 12 year-old boys - Gordie, Chris, Teddy and Vern - are fast friends. After learning of the general location of the body of a local boy who has been missing for several days, they set off into woods to see it. Along the way, they learn about themselves, the meaning of friendship and the need to stand up for what is right.", "genres": ["Adventure", "Drama"], "title": "Stand by Me trailer", "url": "https://www.youtube.com/embed/FUVnfaA-kpI", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTVFRUeDsC2a29vTJpArf7nQHalSJay_bolXOeOmWhwcso_UpNQJ7ex_I1-", "year": 1986, "id": "0092005"}, {"plot": "A small time thief from Belfast, Gerry Conlon, is falsely implicated in the IRA bombing of a pub that kills several people while he is in London. Bullied by the British police, he and four of his friends are coerced into confessing their guilt. Gerry's father and other relatives in London are also implicated in the crime. He spends 15 years in prison with his father trying to prove his innocence with the help of a British attorney, Gareth Peirce. Based on a true story.", "genres": ["Biography", "Drama"], "title": "Em Nome do Pai trailer", "url": "https://www.youtube.com/embed/PyhKsyZOVbk", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQ5x99_giTFROFrceAH2lQgt7sUm5LuqZtc8vWeyHkh3rtbK6iAVPfAiQeb", "year": 1993, "id": "0107207"}, {"plot": "When the Boston Globe's tenacious \"Spotlight\" team of reporters delves into allegations of abuse in the Catholic Church, their year-long investigation uncovers a decades-long cover-up at the highest levels of Boston's religious, legal, and government establishment, touching off a wave of revelations around the world.", "genres": ["Crime", "Drama", "History"], "title": "Spotlight (I) trailer", "url": "https://www.youtube.com/embed/zgicIR5Skwc", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTjdvWY43k5ejkY3n8Kf58awLXlnOqTFdUNP1OiJJmI25mixQ-2yBjomYY", "year": 2015, "id": "1895587"}, {"plot": "Seemingly in constant trouble at school, 14 year-old Antoine Doinel returns at the end of every day to a drab and unhappy home life. His parents have little money and he sleeps on a couch that's been pushed into the kitchen. He knows his mother is having an affair and his parents bicker constantly. He decides to skip school and begins a downward spiral of lies and later stealing. His parents are at their wits end and after he's stopped by the police, they decide the best thing to do would be to let Antoine face the consequences. He's sent to a juvenile detention facility where he doesn't do much better. He does manage to escape however.........", "genres": ["Crime", "Drama"], "title": "The 400 Blows trailer", "url": "https://www.youtube.com/embed/gdXTtX_cz3s", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQbRDihXfD8vnqdhr8gw9C-ecPzN_EHbT5oxenSITCq0-uRTBoBLq-0_-3R", "year": 1959, "id": "0053198"}, {"plot": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and almost everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order. There's Max, a man of action and a man of few words, who seeks peace of mind following the loss of his wife and child in the aftermath of the chaos. And Furiosa, a woman of action and a woman who believes her path to survival may be achieved if she can make it across the desert back to her childhood homeland.", "genres": ["Action", "Adventure", "Sci-Fi", "Thriller"], "title": "Mad Max: Fury Road trailer", "url": "https://www.youtube.com/embed/hEJnMQG9ev8", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQNYc-6kZhu43H7urGAjWBMVIsRAXx0Y_POezmOAQD6unzsXwLAiKsn66Hp", "year": 2015, "id": "1392190"}, {"plot": "Based on an incredible true story of one man's fight for survival and freedom. In the pre-Civil War United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty personified by a malevolent slave owner, as well as unexpected kindnesses, Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon's chance meeting with a Canadian abolitionist will forever alter his life.", "genres": ["Biography", "Drama", "History"], "title": "12 Years a Slave trailer", "url": "https://www.youtube.com/embed/NIqodUJ-UfM", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRlcRqi5XLvPZe5TK1HE-KgDKmgo95tsUj1myyK3MXj0geGMm-ukxsR5I4t", "year": 2013, "id": "2024544"}, {"plot": "Butch and Sundance are the two leaders of the Hole-in-the-Wall Gang. Butch is all ideas, Sundance is all action and skill. The west is becoming civilized and when Butch and Sundance rob a train once too often, a special posse begins trailing them no matter where they run. Over rock, through towns, across rivers, the group is always just behind them. When they finally escape through sheer luck, Butch has another idea, \"Let's go to Bolivia\". Based on the exploits of the historical characters.", "genres": ["Biography", "Crime", "Drama", "Western"], "title": "Butch Cassidy and the Sundance Kid trailer", "url": "https://www.youtube.com/embed/501Afs54cso", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQzv58ooWe9Fx1CJleVLHuZ83UNeyNcNwuQkL5bIXkjswOcqTaras2wZUs", "year": 1969, "id": "0064115"}, {"plot": "GRAND BUDAPEST HOTEL recounts the adventures of Gustave H, a legendary concierge at a famous European hotel between the wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend. The story involves the theft and recovery of a priceless Renaissance painting and the battle for an enormous family fortune -- all against the back-drop of a suddenly and dramatically changing Continent.", "genres": ["Adventure", "Comedy", "Drama"], "title": "The Grand Budapest Hotel trailer", "url": "https://www.youtube.com/embed/MGE_UnWv43I", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQjuPxYArea3hXBpM_3jJW6aiMhxsX1QvBfKDQC7K8XSisRag2T4HA7Ec0", "year": 2014, "id": "2278388"}, {"plot": "Judah Ben-Hur, a prince falsely accused of treason by his adopted brother, an officer in the Roman army, returns to his homeland after years at sea to seek revenge, but finds redemption.", "genres": ["Action", "Adventure", "Drama"], "title": "Ben-Hur trailer", "url": "https://www.youtube.com/embed/QZbukl9Sxv4", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRUnZTbocVe_d-hTw4M1XKxlKjtCeDJ7XY7BAixdr92A0WErMZao3i91Pe5", "year": 2016, "id": "2638144"}, {"plot": "A young nurse, Alma, is put in charge of Elisabeth Vogler: an actress who is seemingly healthy in all respects, but will not talk. As they spend time together, Alma speaks to Elisabeth constantly, never receiving any answer. Alma eventually confesses her secrets to a seemingly sympathetic Elisabeth and finds that her own personality is being submerged into Elisabeth's persona.", "genres": ["Drama", "Thriller"], "title": "Persona trailer", "url": "https://www.youtube.com/embed/LUKV2QDvCWc", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQRssU2kmcRj1vhWfYiEM6bPip-eRyTMuJMokPdGYpLwczxIWx4mDGvCnF1", "year": 1966, "id": "0060827"}, {"plot": "Wanting to learn from the best, aspiring boxer Maggie Fitzgerald wants Frankie Dunn to train her. At the outset he flatly refuses saying he has no interest in training a girl. Frankie leads a lonely existence, alienated from his only daughter and having few friends. Maggie's rough around the edges but shows a lot of grit in the ring and he eventually relents. Maggie not only proves to be the boxer he always dreamed of having under his wing but a friend who fills the great void he's had in his life. Maggie's career skyrockets but an accident in the ring leads her to ask Frankie for one last favor.", "genres": ["Drama", "Sport"], "title": "Million Dollar Baby trailer", "url": "https://www.youtube.com/embed/GfHk5Vl8ZMM", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTGATRBIdhlfryEXStXfWL-oxFC0h8WA4cAZ-87BLcpmqrbSOj0OW6jhx0", "year": 2004, "id": "0405159"}, {"plot": "Spade and Archer is the name of a San Francisco detective agency. That's for Sam Spade and Miles Archer. The two men are partners, but Sam doesn't like Miles much. A knockout, who goes by the name of Miss Wonderly, walks into their office; and by that night everything's changed. Miles is dead. And so is a man named Floyd Thursby. It seems Miss Wonderly is surrounded by dangerous men. There's Joel Cairo, who uses gardenia-scented calling cards. There's Kasper Gutman, with his enormous girth and feigned civility. Her only hope of protection comes from Sam, who is suspected by the police of one or the other murder. More murders are yet to come, and it will all be because of these dangerous men -- and their lust for a statuette of a bird: the Maltese Falcon.", "genres": ["Crime", "Film-Noir", "Mystery"], "title": "The Maltese Falcon trailer", "url": "https://www.youtube.com/embed/K43u9n-B6Y4", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQUfjRSsXZMI97BhOx0I1S93an6aHVovz0l7PgjmAnnZFNi1hm2E9dUBl2X", "year": 1941, "id": "0033870"}, {"plot": "Amar and Prem are two rivals who belonging to middle-class families with no scope of future advancement. Both individually, without the knowledge of the other decide to take matters into their hands and find ways to get rich quickly. Chaos and acrimony result when both find each other at loggerheads when both arrive to win the hand of the daughter of multi-millionaire Ram Gopal Bajaj amidst considerable upheavals when Shyam, the twin brother of Ram, decides to do away with Ram and assume his identity and thus take over the estate of the Bajaj family.", "genres": ["Comedy", "Family", "Romance"], "title": "Andaz Apna Apna trailer", "url": "https://www.youtube.com/embed/sW_HComeQpc", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcT3Cky6fXmQFn9jJZdt4DIbFEW-kVpYpZ2_T9pXP31v7IA5q7N3qfgwP2Kt", "year": 1994, "id": "0109117"}, {"plot": "30 years after the defeat of Darth Vader and the Empire, Rey, a scavenger from the planet Jakku, finds a BB-8 droid that knows the whereabouts of the long lost Luke Skywalker. Rey, as well as a rogue stormtrooper and two smugglers, are thrown into the middle of a battle between the Resistance and the daunting legions of the First Order.", "genres": ["Action", "Adventure", "Fantasy", "Sci-Fi"], "title": "Star Wars: The Force Awakens trailer", "url": "https://www.youtube.com/embed/_Vvn_EHIXL4", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTNUh5Hnbe4u1OHFRv_Lf5iFr7-8dN5PZcMDnFddaAhj8u7Lt73xr9yX0o", "year": 2015, "id": "2488496"}, {"plot": "Three interconnected stories about the different strata of life in Mexico City all resolve with a fatal car accident. Octavio is trying to raise enough money to run away with his sister-in-law, and decides to enter his dog Cofi into the world of dogfighting. After a dogfight goes bad, Octavio flees in his car, running a red light and causing the accident. Daniel and Valeria's new-found bliss is prematurely ended when she loses her leg in the accident. El Chivo is a homeless man who cares for stray dogs and is there to witness the collision.", "genres": ["Drama", "Thriller"], "title": "Amores Perros trailer", "url": "https://www.youtube.com/embed/AsoUA8UodZI", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSNgPlZuTtujmyi2OxlpOLaM8V_1ARtYG0nHiqrkP6WaZmxUowQtiJwEA", "year": 2000, "id": "0245712"}, {"plot": "Rome, 1957. A woman, Cabiria, is robbed and left to drown by her boyfriend, Giorgio. Rescued, she resumes her life and tries her best to find happiness in a cynical world. Even when she thinks her struggles are over and she has found happiness and contentment, things may not be what they seem.", "genres": ["Drama"], "title": "The Nights of Cabiria trailer", "url": "https://www.youtube.com/embed/HHSw7jxYCOk", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQVaAJcGSgprhcLbUhhjdmmuSkiThseSn68G-HxO14U5pZsdHbTsk2bfQ", "year": 1957, "id": "0050783"}, {"plot": "Huge advancements in scientific technology have enabled a mogul to create an island full of living dinosaurs. John Hammond has invited four individuals, along with his two grandchildren, to join him at Jurassic Park. But will everything go according to plan? A park employee attempts to steal dinosaur embryos, critical security systems are shut down and it now becomes a race for survival with dinosaurs roaming freely over the island.", "genres": ["Adventure", "Sci-Fi", "Thriller"], "title": "Jurassic Park trailer", "url": "https://www.youtube.com/embed/p1FevaLUbTg", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTvndPe1_Dy6Uz-OowphoDkQfFJwMsRYuxAA-p-uln9Xtj6icQVpMPEcMA", "year": 1993, "id": "0107290"}, {"plot": "An elderly man reads the book \"The Princess Bride\" to his sick and thus currently bedridden adolescent grandson, the reading of the book which has been passed down within the family for generations. The grandson is sure he won't like the story, with a romance at its core, he preferring something with lots of action and \"no kissing\". But the grandson is powerless to stop his grandfather, whose feelings he doesn't want to hurt. The story centers on Buttercup, a former farm girl who has been chosen as the princess bride to Prince Humperdinck of Florian. Buttercup does not love him, she who still laments the death of her one true love, Westley, five years ago. Westley was a hired hand on the farm, his stock answer of \"as you wish\" to any request she made of him which she came to understand was his way of saying that he loved her. But Westley went away to sea, only to be killed by the Dread Pirate Roberts. On a horse ride to clear her mind of her upcoming predicament of marriage, Buttercup is kidnapped by a band of bandits: Vizzini who works on his wits, and his two associates, a giant named Fezzik who works on his brawn, and a Spaniard named Inigo Montoya, who has trained himself his entire life to be an expert swordsman. They in turn are chased by the Dread Pirate Roberts himself. But chasing them all is the Prince, and his men led by Count Tyrone Rugen. What happens to these collectives is dependent partly on Buttercup, who does not want to marry the Prince, and may see other options as lesser evils, and partly on the other motives of individuals within the groups. But a larger question is what the grandson will think of the story as it proceeds and at its end, especially as he sees justice as high a priority as action.", "genres": ["Adventure", "Family", "Fantasy", "Romance"], "title": "The Princess Bride trailer", "url": "https://www.youtube.com/embed/njZBYfNpWoE", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRd_ocQGlp1aqYUVzSqTbtW-LsFlsH4skSTIRNFL8HTH7rIi9UgLx5gK5ne", "year": 1987, "id": "0093779"}, {"plot": "In 1986, in the province of Gyunggi, in South Korea, a second young and beautiful woman is found dead, raped and tied and gagged with her underwear. Detective Park Doo-Man and Detective Cho Yong-koo, two brutal and stupid local detectives without any technique, investigate the murder using brutality and torturing the suspects, without any practical result. The Detective Seo Tae-Yoon from Seoul comes to the country to help the investigations and is convinced that a serial-killer is killing the women. When a third woman is found dead in the same \"modus-operandi\", the detectives find leads of the assassin.", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Memories of Murder trailer", "url": "https://www.youtube.com/embed/pLEFn55bpR0", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSlOaKHbwZRTOhGnI6rVcQ9JjNw0Hs8cREuSmWqASw5WOFPeuCL12yKVzo", "year": 2003, "id": "0353969"}, {"plot": "In Bedridge, Professor Parker Wilson finds an abandoned dog at the train station and takes it home with the intention of returning the animal to its owner. He finds that the dog is an Akita and names it Hachiko. However, nobody claims the dog so his family decides to keep Hachi.", "genres": ["Drama", "Family"], "title": "Hachi: A Dog's Tale trailer", "url": "https://www.youtube.com/embed/TIl2o1hm1F4", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQ1fIj_cJ7noUbIk3rOEobn_q4Ha8Oh8Zf_jJnKWKLYcp2L6jz7Yz4xnA", "year": 2009, "id": "1028532"}, {"plot": "Near a gray and unnamed city is the Zone, an alien place guarded by barbed wire and soldiers. Over his wife's objections, a man rises in the early morning and leaves her with their disabled daughter to meet two men. He's a Stalker, one of a handful who have the mental gifts (and who risk imprisonment) to lead people into the Zone to the Room, a place where one's secret hopes come true. His clients are a burned out popular writer, cynical, and questioning his talent; and a quiet scientist more concerned about his knapsack than the journey. In the deserted Zone, the approach to the Room must be indirect. As they draw near, the rules seem to change and the stalker faces a crisis.", "genres": ["Drama", "Sci-Fi"], "title": "Stalker trailer", "url": "https://www.youtube.com/embed/GBFJ8NBMiAg", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQVE25RRk15vPPY4CfnfGxuHcx7ynkeMU3C9CKPqG8RHEhH-M7nIgBtc-A", "year": 1979, "id": "0079944"}, {"plot": "An animated fantasy-adventure. Set 1,000 years from now, the earth is ravaged by pollution and war. In the Valley of the Wind lives Nausicaa, princess of her people. Their land borders on a toxic jungle, filled with dangerous over-sized insects. Meanwhile two nearby nations are bitterly engaged in a war and the Valley of the Wind is stuck in the middle...", "genres": ["Animation", "Adventure", "Fantasy", "Sci-Fi"], "title": "Nausicaä of the Valley of the Wind trailer", "url": "https://www.youtube.com/embed/gAC-c-rMV-c", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTtEhSNTGwh58HHgsXOi77xx69t_e_KMlhaUogiLrXfs30S3uhcfFZOiwaf", "year": 1984, "id": "0087544"}, {"plot": "In this movie, Truman is a man whose life is a fake one... The place he lives is in fact a big studio with hidden cameras everywhere, and all his friends and people around him, are actors who play their roles in the most popular TV-series in the world: The Truman Show. Truman thinks that he is an ordinary man with an ordinary life and has no idea about how he is exploited. Until one day... he finds out everything. Will he react?", "genres": ["Comedy", "Drama", "Sci-Fi"], "title": "The Truman Show trailer", "url": "https://www.youtube.com/embed/NkZM2oWcleM", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcR-7PxfBUqyL5aCwcp_DcLsJmc4T4YNvXu_JNZl8iwoYDACaWbmv_SRVuo", "year": 1998, "id": "0120382"}, {"plot": "American tourist Jesse and French student Celine meet by chance on the train from Budapest to Vienna. Sensing that they are developing a connection, Jesse asks Celine to spend the day with him in Vienna, and she agrees. So they pass the time before his scheduled flight the next morning together. How do two perfect strangers connect so intimately over the course of a single day? What is that special thing that bonds two people so strongly? As their bond turns to love, what will happen to them the next morning when Jesse flies away?", "genres": ["Drama", "Romance"], "title": "Before Sunrise trailer", "url": "https://www.youtube.com/embed/9v6X-Dytlko", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcQtzfhfYJAYpflLheyoPqD_BafNdKrRzjal6O0YwhlLwLp2lQXx8DbGdlo", "year": 1995, "id": "0112471"}, {"plot": "Tom Joad returns to his home after a jail sentence to find his family kicked out of their farm due to foreclosure. He catches up with them on his Uncles farm, and joins them the next day as they head for California and a new life... Hopefully.", "genres": ["Drama", "History"], "title": "The Grapes of Wrath trailer", "url": "https://www.youtube.com/embed/5ayi81QMuak", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQ3MuRhlseqmC7_JIwcwanBe7h7H12LbiHYadXDHNeqyFFUWdry2O7uMhlS", "year": 1940, "id": "0032551"}, {"plot": "Mexican Narcotics officer Ramon Miguel 'Mike' Vargas has to interrupt his honeymoon on the Mexican-US border when an American building contractor is killed after someone places a bomb in his car. He's killed on the US side of the border but it's clear that the bomb was planted on the Mexican side. As a result, Vargas delays his return to Mexico City where he has been mounting a case against the Grandi family crime and narcotics syndicate. Police Captain Hank Quinlan is in charge on the US side and he soon has a suspect, a Mexican named Manolo Sanchez. Vargas is soon onto Quinlan and his Sergeant, Pete Menzies, when he catches them planting evidence to convict Sanchez. With his new American wife, Susie, safely tucked away in a hotel on the US side of the border - or so he thinks - he starts to review Quinlan's earlier cases. While concentrating on the corrupt policeman however, the Grandis have their own plans for Vargas and they start with his wife Susie.", "genres": ["Crime", "Drama", "Film-Noir", "Thriller"], "title": "Touch of Evil trailer", "url": "https://www.youtube.com/embed/dx125s0t6Gk", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTlGbG5d7VbOAicUxtftBuSW5szXPe6orMZrQ6Y9ifGaBcmvnyNLfwxJQ", "year": 1958, "id": "0052311"}, {"plot": "Alvy Singer, a forty year old twice divorced, neurotic, intellectual Jewish New York stand-up comic, reflects on the demise of his latest relationship, to Annie Hall, an insecure, flighty, Midwestern WASP aspiring nightclub singer. Unlike his previous relationships, Alvy believed he may have worked out all the issues in his life through fifteen years of therapy to make this relationship with Annie last, among those issues being not wanting to date any woman that would want to date him, and thus subconsciously pushing those women away. Alvy not only reviews the many ups and many downs of their relationship, but also reviews the many facets of his makeup that led to him starting to date Annie. Those facets include growing up next to Coney Island in Brooklyn, being attracted to the opposite sex for as long as he can remember, and enduring years of Jewish guilt with his constantly arguing parents.", "genres": ["Comedy", "Romance"], "title": "Annie Hall trailer", "url": "https://www.youtube.com/embed/TBzHphcc2Jw", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSdO4cGovZ7hGNbHuZEukvSI6IMBnqVF1STV9bBb8msj8PsUa7-wB1RdQ", "year": 1977, "id": "0075686"}, {"plot": "Rocky Balboa is a struggling boxer trying to make the big time, working as a debt collector for a pittance. When heavyweight champion Apollo Creed visits Philadelphia, his managers want to set up an exhibition match between Creed and a struggling boxer, touting the fight as a chance for a \"nobody\" to become a \"somebody\". The match is supposed to be easily won by Creed, but someone forgot to tell Rocky, who sees this as his only shot at the big time.", "genres": ["Drama", "Sport"], "title": "Rocky trailer", "url": "https://www.youtube.com/embed/cWoE0KqUznQ", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTKni2A8HK1sRgwA1SHr-0MxVaRgcQOzt12Q9R8pLUZlkovt-j4No5s0ug", "year": 1976, "id": "0075148"}, {"plot": "Harry, Ron, and Hermione continue their quest of finding and destroying the Dark Lord's three remaining Horcruxes, the magical items responsible for his immortality. But as the mystical Deathly Hallows are uncovered, and Voldemort finds out about their mission, the biggest battle begins and life as they know it will never be the same again.", "genres": ["Adventure", "Drama", "Fantasy", "Mystery"], "title": "Harry Potter and the Deathly Hallows: Part 2 trailer", "url": "https://www.youtube.com/embed/I_kDb-pRCds", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSwgCYelHsbq1IRUxPv3R4oZmshQdZAG9CA95_IhuGfo4D3LAqRYQrNN1cN", "year": 2011, "id": "1201607"}, {"plot": "In 1893, Gandhi is thrown off a South African train for being an Indian and traveling in a first class compartment. Gandhi realizes that the laws are biased against Indians and decides to start a non-violent protest campaign for the rights of all Indians in South Africa. After numerous arrests and the unwanted attention of the world, the government finally relents by recognizing rights for Indians, though not for the native blacks of South Africa. After this victory, Gandhi is invited back to India, where he is now considered something of a national hero. He is urged to take up the fight for India's independence from the British Empire. Gandhi agrees, and mounts a non-violent non-cooperation campaign of unprecedented scale, coordinating millions of Indians nationwide. There are some setbacks, such as violence against the protesters and Gandhi's occasional imprisonment. Nevertheless, the campaign generates great attention, and Britain faces intense public pressure. Too weak from World War II to continue enforcing its will in India, Britain finally grants India's independence. Indians celebrate this victory, but their troubles are far from over. Religious tensions between Hindus and Muslims erupt into nation-wide violence. Gandhi declares a hunger strike, saying he will not eat until the fighting stops. The fighting does stop eventually, but the country is divided. It is decided that the northwest area of India, and eastern part of India (current day Bangladesh), both places where Muslims are in the majority, will become a new country called Pakistan (West and East Pakistan respectively). It is hoped that by encouraging the Muslims to live in a separate country, violence will abate. Gandhi is opposed to the idea, and is even willing to allow Muhammad Ali Jinnah to become the first prime minister of India, but the Partition of India is carried out nevertheless. Gandhi spends his last days trying to bring about peace between both nations. He thereby angers many dissidents on both sides, one of whom finally gets close enough to assassinate him.", "genres": ["Biography", "Drama", "History"], "title": "Gandhi trailer", "url": "https://www.youtube.com/embed/6oWqlb_TlLQ", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRWxC71Wd-26uYQwDj7MB7XMpzOJZNDjl1GOiRhA_E2wcsg1uARo9k4vWP-", "year": 1982, "id": "0083987"}, {"plot": "The wife and mistress of a sadistic boarding school headmaster plot to kill him. They drown him in the bathtub and dump the body in the school's filthy swimming pool... but when the pool is drained, the body has disappeared - and subsequent reported sightings of the headmaster slowly drive his 'killers' (and the audience) up the wall with almost unbearable suspense...", "genres": ["Crime", "Drama", "Horror", "Mystery", "Thriller"], "title": "Diabolique trailer", "url": "https://www.youtube.com/embed/w6nYruzj__8", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQj3V4wWqTidwlUPk5t6D5TN8Q1B1c4HNNEukw_FJKwyj7edVAgZdxZh2Q", "year": 1955, "id": "0046911"}, {"plot": "Donnie Darko doesn't get along too well with his family, his teachers and his classmates; but he does manage to find a sympathetic friend in Gretchen, who agrees to date him. He has a compassionate psychiatrist, who discovers hypnosis is the means to unlock hidden secrets. His other companion may not be a true ally. Donnie has a friend named Frank - a large bunny which only Donnie can see. When an engine falls off a plane and destroys his bedroom, Donnie is not there. Both the event, and Donnie's escape, seem to have been caused by supernatural events. Donnie's mental illness, if such it is, may never allow him to find out for sure.", "genres": ["Drama", "Sci-Fi", "Thriller"], "title": "Donnie Darko trailer", "url": "https://www.youtube.com/embed/ZZyBaFYFySk", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcQb9sErQVhKGMEcXmP0cVQhCgOpAM6AdC7V59Noeuwpl1rhm1mQtMIR00o", "year": 2001, "id": "0246578"}, {"plot": "Bourne is once again brought out of hiding, this time inadvertently by London-based reporter Simon Ross who is trying to unveil Operation Blackbriar--an upgrade to Project Treadstone--in a series of newspaper columns. Bourne sets up a meeting with Ross and realizes instantly they're being scanned. Information from the reporter stirs a new set of memories, and Bourne must finally, ultimately, uncover his dark past whilst dodging The Company's best efforts in trying to eradicate him.", "genres": ["Action", "Mystery", "Thriller"], "title": "The Bourne Ultimatum trailer", "url": "https://www.youtube.com/embed/JJoVljaZP0k", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcRZKflTuJG694hdyZmjpT2vjza208rmXrIK6FiHPUDYX6f2j1FG3WQ0XYQ", "year": 2007, "id": "0440963"}, {"plot": "How far would you go to protect your family? Keller Dover is facing every parent's worst nightmare. His six-year-old daughter, Anna, is missing, together with her young friend, Joy, and as minutes turn to hours, panic sets in. The only lead is a dilapidated RV that had earlier been parked on their street. Heading the investigation, Detective Loki arrests its driver, Alex Jones, but a lack of evidence forces his release. As the police pursue multiple leads and pressure mounts, knowing his child's life is at stake the frantic Dover decides he has no choice but to take matters into his own hands. But just how far will this desperate father go to protect his family?", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Prisoners trailer", "url": "https://www.youtube.com/embed/t219JF1K57s", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTbdRk1RN1rd2aXVhmIuPPwMxsKdBVH7NwuTFyL6yNZ-FQzFNHqSJAgoHPu", "year": 2013, "id": "1392214"}, {"plot": "A city of monsters with no humans called Monstropolis centers around the city's power company, Monsters, Inc. The lovable, confident, tough, furry blue behemoth-like giant monster named James P. Sullivan (better known as Sulley) and his wisecracking best friend, short, green cyclops monster Mike Wazowski, discover what happens when the real world interacts with theirs in the form of a 2-year-old baby girl dubbed \"Boo,\" who accidentally sneaks into the monster world with Sulley one night. And now it's up to Sulley and Mike to send Boo back in her door before anybody finds out, especially two evil villains such as Sulley's main rival as a scarer, chameleon-like Randall (a monster that Boo is very afraid of), who possesses the ability to change the color of his skin, and Mike and Sulley's boss Mr. Waternoose, the chairman and chief executive officer of Monsters, Inc.", "genres": ["Animation", "Adventure", "Comedy", "Family", "Fantasy"], "title": "Monsters, Inc. trailer", "url": "https://www.youtube.com/embed/UplAPb2sfbs", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcR884XHamZKmTQCNCY2zVVx2zuvZSZ_658M5wBsTq_SFxAQ2MIGppo_wQ", "year": 2001, "id": "0198781"}, {"plot": "New Rochelle, the 1960s. High schooler Frank Abagnale Jr. idolizes his father, who's in trouble with the IRS. When his parents separate, Frank runs away to Manhattan with $25 in his checking account, vowing to regain dad's losses and get his parents back together. Just a few years later, the FBI tracks him down in France; he's extradited, tried, and jailed for passing more than $4,000,000 in bad checks. Along the way, he's posed as a Pan Am pilot, a pediatrician, and an attorney. And, from nearly the beginning of this life of crime, he's been pursued by a dour FBI agent, Carl Hanratty. What starts as cat and mouse becomes something akin to father and son.", "genres": ["Biography", "Crime", "Drama"], "title": "Catch Me If You Can trailer", "url": "", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQhQU_jtHxvANXgCnc5UEyz-Pf96JjxRye8eIu48nQpa3FTtM7dzLCQD4Q", "year": 2002, "id": "0264464"}, {"plot": "A cyborg is sent from the future on a deadly mission. He has to kill Sarah Connor, a young woman whose life will have a great significance in years to come. Sarah has only one protector - Kyle Reese - also sent from the future. The Terminator uses his exceptional intelligence and strength to find Sarah, but is there any way to stop the seemingly indestructible cyborg ?", "genres": ["Action", "Sci-Fi"], "title": "The Terminator trailer", "url": "https://www.youtube.com/embed/EpdAcA6ziiA", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTltqdmvtVh6IJsaZq0pFl1pY3TlPIyXRG8wyau31cYfhrwxvBBX4_KzF9_", "year": 1984, "id": "0088247"}, {"plot": "Guido is a film director, trying to relax after his last big hit. He can't get a moment's peace, however, with the people who have worked with him in the past constantly looking for more work. He wrestles with his conscience, but is unable to come up with a new idea. While thinking, he starts to recall major happenings in his life, and all the women he has loved and left. An autobiographical film of Fellini, about the trials and tribulations of film making.", "genres": ["Drama", "Fantasy"], "title": "8½ trailer", "url": "https://www.youtube.com/embed/sBzbVFInMs8", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRV41tjwGyh4swDNh1hXB5kx1PSjpgATbkFPFhbBv1a_HngCVS42qIllSY", "year": 1963, "id": "0056801"}, {"plot": "In this charming film based on the popular L. Frank Baum stories, Dorothy and her dog Toto are caught in a tornado's path and somehow end up in the land of Oz. Here she meets some memorable friends and foes in her journey to meet the Wizard of Oz who everyone says can help her return home and possibly grant her new friends their goals of a brain, heart and courage.", "genres": ["Adventure", "Family", "Fantasy", "Musical"], "title": "The Wizard of Oz trailer", "url": "https://www.youtube.com/embed/KkiGySEBCHY", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTsefNLOrbFuaNfPe2weqkhd3JSLGXQPk-AUcd-XoAszc6G60DJAtOrVC4", "year": 1939, "id": "0032138"}, {"plot": "A weather man is reluctantly sent to cover a story about a weather forecasting \"rat\" (as he calls it). This is his fourth year on the story, and he makes no effort to hide his frustration. On awaking the 'following' day he discovers that it's Groundhog Day again, and again, and again. First he uses this to his advantage, then comes the realisation that he is doomed to spend the rest of eternity in the same place, seeing the same people do the same thing EVERY day.", "genres": ["Comedy", "Fantasy", "Romance"], "title": "Groundhog Day trailer", "url": "https://www.youtube.com/embed/wE8nNUASSCo", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcTxulA3WpokR96zorYDr0sAbLzqzP3xTOxAIK1J2QBiWqwmy82YclroeCU", "year": 1993, "id": "0107048"}, {"plot": "Follows the journey of a time traveler from the post-apocalyptic future who appears in present day on a mission to locate and eradicate the source of a deadly plague that will nearly destroy the human race.", "genres": ["Adventure", "Drama", "Mystery", "Sci-Fi", "Thriller"], "title": "12 Monkeys trailer", "url": "https://www.youtube.com/embed/-XKv0NsYEb8", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSgGYcl1w4QrKCLlC3r2S9Wh1PH-tqzZSmUnvZK1RCBWuqiu4PTib7n2ww", "year": 2015, "id": "3148266"}, {"plot": "The film follows three young men and their time spent in the French suburban \"ghetto,\" over a span of twenty-four hours. Vinz, a Jew, Saïd, an Arab, and Hubert, a black boxer, have grown up in these French suburbs where high levels of diversity coupled with the racist and oppressive police force have raised tensions to a critical breaking point. During the riots that took place a night before, a police officer lost his handgun in the ensuing madness, only to leave it for Vinz to find. Now, with a newfound means to gain the respect he deserves, Vinz vows to kill a cop if his friend Abdel dies in the hospital, due the beating he received while in police custody.", "genres": ["Crime", "Drama"], "title": "La Haine trailer", "url": "https://www.youtube.com/embed/cy5TaO6qTBU", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTKyI6Mfb-W4B9tYTRF7Hd7TvdlX4Qgnx0fYBxLD5LmLmxg3KAagBZXGco", "year": 1995, "id": "0113247"}, {"plot": "Vijay Salgaonkar runs a cable TV network in a remote and hilly village of Goa. He lives a happy life with his wife Nandini and two daughters. A 4th grade dropout & an orphan, Vijay has worked his way towards success with his sheer hard-work & street smartness in order to provide for his family who mean the world to him. A man of few means & needs; Vijay believes life is to be lived simplistically - his wife, while she loves him devoutly, wants Vijay's thrifty & miserly behavior to end and wants the world for her family. If there's one thing that Vijay cannot live without, it is his passion for watching films. Such is his 'filmy' obsession that he doesn't mind staying up all night at his office binging on TV movies! In a bizarre turn of events; a teenage boy goes missing; he is the son of a headstrong & no-nonsense cop; IG Meera Deshmukh and the Salgaonkar family is the prime suspect! Will a humble & middle class man, be able to protect his family from oppression of the powerful? How the family weathers the storm that ensues during the violent investigation forms the rest of the story leading to an unexpected & shocking climax.", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Drishyam trailer", "url": "https://www.youtube.com/embed/9kNOn1fLj00", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcQp27x1IBTeii1cVOMazFXC3MwHujFMk8FZOdv27VK5SSBt1k0MKE83Wm8", "year": 2015, "id": "4430212"}, {"plot": "In the Eighteenth Century, in a small village in Ireland, Redmond Barry is a young farm boy in love with his cousin Nora Brady. When Nora gets engaged to the British Captain John Quin, Barry challenges him to a duel of pistols. He wins and escapes to Dublin but is robbed on the road. Without an alternative, Barry joins the British Army to fight in the Seven Years War. He deserts and is forced to join the Prussian Army where he saves the life of his captain and becomes his protégé and spy of the Irish gambler Chevalier de Balibari. He helps Chevalier and becomes his associate until he decides to marry the wealthy Lady Lyndon. They move to England and Barry, in his obsession of nobility, dissipates her fortune and makes a dangerous and revengeful enemy.", "genres": ["Adventure", "Drama", "History", "War"], "title": "Barry Lyndon trailer", "url": "https://www.youtube.com/embed/9lzSoKOs1fc", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcSQE1oZHZMcDDVKt9U-tcXVjr7A1MMFsI4ZDZf7_WkWednCfu2jJJCgfw", "year": 1975, "id": "0072684"}, {"plot": "It's a hot summer on Amity Island, a small community whose main business is its beaches. When new Sheriff Martin Brody discovers the remains of a shark attack victim, his first inclination is to close the beaches to swimmers. This doesn't sit well with Mayor Larry Vaughn and several of the local businessmen. Brody backs down to his regret as that weekend a young boy is killed by the predator. The dead boy's mother puts out a bounty on the shark and Amity is soon swamped with amateur hunters and fisherman hoping to cash in on the reward. A local fisherman with much experience hunting sharks, Quint, offers to hunt down the creature for a hefty fee. Soon Quint, Brody and Matt Hooper from the Oceanographic Institute are at sea hunting the Great White shark. As Brody succinctly surmises after their first encounter with the creature, they're going to need a bigger boat.", "genres": ["Adventure", "Drama", "Thriller"], "title": "Jaws trailer", "url": "https://www.youtube.com/embed/U1fu_sA7XhE", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSFz0nGS_hNzBe-W9vKW_seefh_M3CZ9sH9k04HnoTpb6pW3K6QjDnvyB-P", "year": 1975, "id": "0073195"}, {"plot": "Chan Wing Yan, a young police officer, has been sent undercover as a mole in the local mafia. Lau Kin Ming, a young mafia member, infiltrates the police force. Years later, their older counterparts, Chen Wing Yan and Inspector Lau Kin Ming, respectively, race against time to expose the mole within their midst.", "genres": ["Crime", "Drama", "Mystery", "Thriller"], "title": "Infernal Affairs trailer", "url": "https://www.youtube.com/embed/S4R3nHkqyfM", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTumUBND3_Pm7d-PcGPOJPxXnx7Z9F3M0ArzN6z7314BNxauh-xjMK2DWM", "year": 2002, "id": "0338564"}, {"plot": "In the 7th century, Mohammed, Peace Be Upon Him, is visited by Angel Gabriel who urges him to lead the people of Mecca and worship God. But they're exiled in Medina before returning to Mecca to take up arms against their oppressors and liberate their city in the name of God (Allah).", "genres": ["Adventure", "Biography", "Drama", "History", "War"], "title": "The Message trailer", "url": "https://www.youtube.com/embed/9f_zzSFKqoc", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTIeiSahJJOARH8rdMCWgDmcTqvjoyRSC1o43ylVTehu_v35abKViIFCAVz", "year": 1976, "id": "0074896"}, {"plot": "The story concentrates on the social re-adjustment of three World War II servicemen, each from a different station of society. Al Stephenson returns to an influential banking position, but finds it hard to reconcile his loyalties to ex-servicemen with new commercial realities. Fred Derry is an ordinary working man who finds it difficult to hold down a job or pick up the threads of his marriage. Having had both hands burnt off during the war, Homer Parrish is unsure that his fiancée's feelings are still those of love and not those of pity. Each of the veterans faces a crisis upon his arrival, and each crisis is a microcosm of the experiences of many American warriors who found an alien world awaiting them when they came marching home.", "genres": ["Drama", "Romance", "War"], "title": "The Best Years of Our Lives trailer", "url": "https://www.youtube.com/embed/1yc5PugV4mk", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcTzfvznlxKDzcIT_Nmo_eNrO72L8FPl9cc1cVZ0CRyejtcfG8hrWIev8Q", "year": 1946, "id": "0036868"}, {"plot": "From the largest elephant to the smallest shrew, the city of Zootopia is a mammal metropolis where various animals live and thrive. When Judy Hopps becomes the first rabbit to join the police force, she quickly learns how tough it is to enforce the law. Determined to prove herself, Judy jumps at the opportunity to solve a mysterious case. Unfortunately, that means working with Nick Wilde, a wily fox who makes her job even harder.", "genres": ["Animation", "Adventure", "Comedy", "Crime", "Family", "Mystery"], "title": "Zootopia trailer", "url": "https://www.youtube.com/embed/prct6AB5tR8", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQEjWQ18biRsr2OLjxPJyYHKT7G8BXHpkOHuN3V_jab_R8gWoUJnMhsO4E", "year": 2016, "id": "2948356"}, {"plot": "A film commissioned by the Algerian government that shows the Algerian revolution from both sides. The French foreign legion has left Vietnam in defeat and has something to prove. The Algerians are seeking independence. The two clash. The torture used by the French is contrasted with the Algerian's use of bombs in soda shops. A look at war as a nasty thing that harms and sullies everyone who participates in it.", "genres": ["Drama", "War"], "title": "The Battle of Algiers trailer", "url": "https://www.youtube.com/embed/Ca3M2feqJk8", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcQ6Yje3-7z4nAnnGsMqcn7jx4n-iD08x8l3PL9FK8FkIpzLK5lIRNgSdPU", "year": 1966, "id": "0058946"}, {"plot": "Based upon a real-life story that happened in the early seventies in which the Chase Manhattan Bank in Gravesend, Brooklyn, was held siege by a gay bank robber determined to steal enough money for his male lover to undergo a sex change operation. On a hot summer afternoon, the First Savings Bank of Brooklyn is held up by Sonny and Sal, two down-and-out characters. Although the bank manager and female tellers agree not to interfere with the robbery, Sonny finds that there's actually nothing much to steal, as most of the cash has been picked up for the day. Sonny then gets an unexpected phone call from Police Captain Moretti, who tells him the place is surrounded by the city's entire police force. Having few options under the circumstances, Sonny nervously bargains with Moretti, demanding safe escort to the airport and a plane out of the country in return for the bank employees' safety.", "genres": ["Biography", "Crime", "Drama", "Thriller"], "title": "Dog Day Afternoon trailer", "url": "https://www.youtube.com/embed/TPwBfZHozQ8", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcRpq8mS7TLMV6lHCVc3DdW921l9xhhgvBvAXCmkq39JZEbrV_ukwIS5N2nv", "year": 1975, "id": "0072890"}, {"plot": "Set in Mississippi during the 1960s, Skeeter (Stone) is a southern society girl who returns from college determined to become a writer, but turns her friends' lives -- and a Mississippi town -- upside down when she decides to interview the black women who have spent their lives taking care of prominent southern families. Aibileen (Davis), Skeeter's best friend's housekeeper, is the first to open up -- to the dismay of her friends in the tight-knit black community. Despite Skeeter's life-long friendships hanging in the balance, she and Aibileen continue their collaboration and soon more women come forward to tell their stories -- and as it turns out, they have a lot to say. Along the way, unlikely friendships are forged and a new sisterhood emerges, but not before everyone in town has a thing or two to say themselves when they become unwittingly -- and unwillingly -- caught up in the changing times.", "genres": ["Drama"], "title": "The Help trailer", "url": "https://www.youtube.com/embed/Cqn4XN21O1g", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcSIGbk8X_SG3iVwmvXfwmreM1IaQi-8gGCYN3klLGxmp6QBBxImtyva1JlT", "year": 2011, "id": "1454029"}, {"plot": "Shahid Khan is exiled after impersonating the legendary Sultana Daku in order to rob British trains. Now outcast, Shahid becomes a worker at Ramadhir Singh's colliery, only to spur a revenge battle that passes on to generations. At the turn of the decade, Shahid's son, the philandering Sardar Khan vows to get his father's honor back, becoming the most feared man of Wasseypur.", "genres": ["Action", "Crime", "Drama", "Thriller"], "title": "Gangs of Wasseypur trailer", "url": "https://www.youtube.com/embed/9ZpPQdrHfl8", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcTM8V0eqcBnX4E2sy7Gj8MbheyWRtOuDsiRvXhnTr0AXjKwIcb8rlb0xGE", "year": 2012, "id": "1954470"}, {"plot": "Bruno Anthony thinks he has the perfect plot to rid himself of his hated father and when he meets tennis player Guy Haines on a train, he thinks he's found the partner he needs to pull it off. His plan is relatively simple. Two strangers each agree to kill someone the other person wants disposed of. For example, Guy could kill his father and he could get rid of Guy's wife Miriam, freeing him to marry Anne Morton, the beautiful daughter of a U.S. Senator. Guy dismisses it all out of hand but Bruno goes ahead with his half of the 'bargain' and disposes of Miriam. When Guy balks, Bruno makes it quite clear that he will plant evidence to implicate Guy in her murder if he doesn't get rid of his father. Guy had also made some unfortunate statements about Miriam after she had refused him a divorce. It all leads the police to believe Guy is responsible for the murder, forcing him to deal with Bruno's mad ravings.", "genres": ["Crime", "Film-Noir", "Thriller"], "title": "Strangers on a Train trailer", "url": "https://www.youtube.com/embed/nfW7zD924j8", "pic": "http://t1.gstatic.com/images?q=tbn:ANd9GcTA30ejFGfbldma1mXEqKN_OoHc8GQsemzboo2v3R89q_JwrKXKyIFCK6I", "year": 1951, "id": "0044079"}, {"plot": "This swash-buckling tale follows the quest of Captain Jack Sparrow, a savvy pirate, and Will Turner, a resourceful blacksmith, as they search for Elizabeth Swann. Elizabeth, the daughter of the governor and the love of Will's life, has been kidnapped by the feared Captain Barbossa. Little do they know, but the fierce and clever Barbossa has been cursed. He, along with his large crew, are under an ancient curse, doomed for eternity to neither live, nor die. That is, unless a blood sacrifice is made.", "genres": ["Action", "Adventure", "Fantasy"], "title": "Pirates of the Caribbean: The Curse of the Black Pearl trailer", "url": "https://www.youtube.com/embed/eQkAXLIMNQM", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcRdZ0neYQCgpmq1-B2-eiBdleAD4eM-0z1jyExu4ifm80deQbIYV610VfA", "year": 2003, "id": "0325980"}, {"plot": "Saoirse is a child who is the last of the selkies, women in Irish and Scottish legends who transform from seals into people. She escapes from her grandmother's home to journey to the sea and free fairy creatures trapped in the modern world.", "genres": ["Animation", "Adventure", "Family", "Fantasy"], "title": "A Canção do Oceano trailer", "url": "https://www.youtube.com/embed/Rk89c14RinA", "pic": "http://t3.gstatic.com/images?q=tbn:ANd9GcS549k2XQDw7Us7CuxbQuRE_9NdQz8BQo7SHwyAy-XIO_JxJyFR-yyS2w", "year": 2014, "id": "1865505"}, {"plot": "Four tales of crime adapted from Frank Miller's popular comics, focusing around a muscular brute who's looking for the person responsible for the death of his beloved Goldie, a man fed up with Sin City's corrupt law enforcement who takes the law into his own hands after a horrible mistake, a cop who risks his life to protect a girl from a deformed pedophile, and a hitman looking to make a little cash.", "genres": ["Crime", "Thriller"], "title": "Sin City trailer", "url": "https://www.youtube.com/embed/T2Dj6ktPU5c", "pic": "http://t0.gstatic.com/images?q=tbn:ANd9GcR3Fu0li1QJZHf-8nIJqiXsg8QNk8KzPUr_0dvMqxPMXc381SEfStZPxH0", "year": 2005, "id": "0401792"}, {"plot": "This is the story about the resilience shown by the Indians when they were under the British Rule. They are already taxed to the bone by the British and their cronies, but when Jack Russell announces that he will double the Lagaan (tax) from all villagers, they decide to oppose it. Leading the villagers is a handsome young man named Bhuvan, who challenges them to a game of cricket, a game that is to be played by veteran British cricket players, versus villagers, including Bhuvan himself, who have never played this game before, and do not even know a bat from a piece of wood. As the challenge is accepted, the interest grows and attracts Indians from all over the region, as well as the British from all over the country - as everyone gathers to see the 'fair play' that the British will display against their counter-parts, who are aided by none other than the sister, Elizabeth, of Captain Rusell.", "genres": ["Adventure", "Drama", "Musical", "Romance", "Sport"], "title": "Lagaan: Era uma Vez na Índia trailer", "url": "https://www.youtube.com/embed/UxmNg0T6Fsk", "pic": "http://t2.gstatic.com/images?q=tbn:ANd9GcSSFqPoQ8JCkXlScIJtsS75HcvtdPDNLbSUTaBDCzkMt2nFIOyLrlptnmU", "year": 2001, "id": "0169102"}]